{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "Account Or Contract Number",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of the account or contract held by the customer. Account number is defined as numbers, letters or alphanumeric code assigned to every significant customer, supplier and lender for ease of reference in accounting records of the financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "As Of Date",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Counterparty Country Code",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Indicates the country where policy is effective and issued for as per terms and conditions. This is the country code associated with the counterparty. There are several popular country codes as part of ISO 3166 standard published by the International Organization for Standardization. ISO 3166 defines codes for the names of countries, dependent territories, special areas of geographical interest and their principal subdivisions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Counterparty Industry Code",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the code that describes the primary business activity of the obligor or the industry to which the party is associated to as per the North American Industry Classification System, NAICS. If the NAICS code is not available, provide either the Standard Industrial Classification, SIC, or Global Industry Classification Standard, GICS. If the obligor is an individual, the industry code should be consistent with the industry in which the commercial purpose of the loan operates.\nIf the business or individual operates in multiple industries, the BHC or IHC should report the industry that best represents the commercial risk of the loan, i.e., the predominant industry.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Counterparty Ownership Type",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the organization defined code for the ownership type of the account. Expected values are IND Individual, JOINT Joint Tenant or Community Property, TRUST Trust, CUST Custodian, CORP Corporate, FIRM Firm Owned and OTHER Other.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Counterparty Risk Coverage Exposure Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of the exposures. This will be the amount, post adjustment for any regulatory capital calculation purpose. If there are any adjustments to the accounting exposure amount due to netting, or any other regulatory capital related computations, the same will be updated. This will be the End of period balance for the on balance sheet exposures, and the adjusted notional balance for the derivatives.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Counterparty Risk Coverage Exposure Amount In Reporting Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of the exposures in reporting currency. This will be the amount, post adjustment for any regulatory capital calculation purpose. If there are any adjustments to the accounting exposure amount due to netting, or any other regulatory capital related computations, the same will be updated. This will be the End of period balance for the on balance sheet exposures, and the adjusted notional balance for the derivatives.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Counterparty Standard Party Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of the standard party type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to end of period balance which includes accrued interest. All the calculations such as interest, prepayment amounts etc. are based on this amount. This is used in all the calculations performed by cash flow engine. In Case of LC Contracts, EOP Balance should be populated when LC Is executed. Till LC is executed, LC amount sanctioned should be hold in Total Commitment Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Balance In Reporting Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to end of period balance in reporting currency. All the calculations such as interest, prepayment amounts etc. are based on this amount. This is used in all the calculations performed by cash flow engine. In Case of LC Contracts, EOP Balance should be populated when LC Is executed. Till LC is executed, LC amount sanctioned should be hold in Total Commitment Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "ISO Country Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the country code associated with the business. There are several popular country codes as part of ISO 3166 standard published by the International Organization for Standardization. ISO 3166 defines codes for the names of countries, dependent territories, special areas of geographical interest and their principal subdivisions. In case of party, it Refers to the country of birth of the party.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "ISO Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Industry Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the code that describes the primary business activity of the obligor or the industry to which the party is associated to as per the North American Industry Classification System, NAICS. If the NAICS code is not available, provide either the Standard Industrial Classification, SIC, or Global Industry Classification Standard, GICS. If the obligor is an individual, the industry code should be consistent with the industry in which the commercial purpose of the loan operates.\nIf the business or individual operates in multiple industries, the BHC or IHC should report the industry that best represents the commercial risk of the loan, i.e., the predominant industry.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Legal Entity Code",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the entity code of the legal entity to which the account will be attributed in the general ledger.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Party Identifier",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier for the party. Party is defined as an entity or a person who takes part or is involved in an agreement, lawsuit, or transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Primary Counterparty Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the referenced counterparty is primary or not. A value Y means the counterparty is primary and N means not primary. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Risk Covered Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the joint liability share in percentage per debtor as per the contractual agreement.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Run Identifier",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the run identifier for a set of Records participating in the particular Run with the Run Execution identifier. This is a combination of Run Main Identifier and Run Execution Identifier.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Standard Product Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the standard product type code.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [],
            "useCases": []
        }
    ]
}