{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "As Of Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Basel Product Type Category Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Basel product type category code. The category will be a grouping of the various products into a common category, and multiple categories will be part of the Level 1 product type of On balance sheet or Off balance sheet etc. Some of the categories are loans, deposits etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Basel Product Type Category Description",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description",
                    "gcd": "This column stores the description of the Basel product type category code. The category will be a grouping of the various products into a common category, and multiple categories will be part of the Level 1 product type of On balance sheet or Off balance sheet etc. Some of the categories are loans, deposits etc.\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Basel Product Type Code",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to an unique synthetic Key as a substitute for product Type Code Natural Key.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Basel Product Type Description",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description",
                    "gcd": "Refers to the Description of the product type.\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Basel Product Type Level One Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code corresponding to the product type one level higher than the product Type Code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Basel Product Type Level One Description",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description",
                    "gcd": "Refers to the description corresponding to product Type Code Level One.\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Basel Product Type Numeric Identifier",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "SurrogateKey",
                    "gcd": "Refers to the equivalent numeric identifier of the Basel Product Type Numeric Identifier.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source system from where data is extracted. Data can be sourced from multiple sources, this column will Refers to the source code from where the data is extracted for this extraction date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Dimension Value Closed Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the given dimension value record has been disabled or expired. The list of values includes Y- Indicates that the dimension value has been disabled, N- Indicates that the dimension value is not disabled and is still active.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Seeded Record Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "It Indicates if dimension record is seeded by product or not. The SCD component would not overwrite the record if it is set to 'Y'.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unfunded Commitment Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Indicates if the product type can be called an unfunded commitment.\n",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [],
            "useCases": []
        }
    ]
}