{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "Account Attrition Score",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the attrition score of the account. Attrition score is to define the probability of losing the account. Higher score translates into more chances of losing the account. Attrition reason can be Pricing Dissatisfaction, Product features dissatisfaction, Service Dissatisfaction etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Classification Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to classification code of the account. The list of values of account classification can be Fair Value, Amortized Cost, Available for Sale, Held till Maturity etc. Account Classification Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Close Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the account is closed. Account can be an active or closed, this column will remain blank till account is active. Accounts can be closed upon maturity, transfer or death of a customer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Customer Net Revenue",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to total revenue less the loss or expenses and taxes incurred for that account at customer level. \nIn case of Investments, Leases, Merchant Cards, Options, Swaps and Trusts: It is the sum of Total Commitment Amount Plus Fee Amount Plus Communication Charges Plus Other Charges Plus Other Party Charges Minus Allocated Cost.\nIn case of Casa, Cards, OD, TD, LC and Commitment contracts: Interest earned + Fees + Charges + Commission, Interest rate paid + Expenses.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Manager Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the account manager is an employee who is responsible for the day to day management of accounts of a particular customer. The account manager is a point of contact, and provides customer support, up selling, technical assistance and general relationship management. An account manager may be in charge of a number of smaller accounts, or may focus on a few larger accounts. This column Refers to the account manager code or the unique employee identifier of the manager assigned by the financial institution. Management Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Or Contract Number",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of the account or contract held by the customer. Account number is defined as numbers, letters or alphanumeric code assigned to every significant customer, supplier and lender for ease of reference in accounting records of the financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Pool Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the pool id generated using Retail Pooling, Basel pooling, etc. used for exposure.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Purpose Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the purpose for which account has originated, purpose or special use of this account. Account purpose dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Retention Segment Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to unique identifier of the account retention segment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Risk Score",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to risk score of the account. This is generally applicable for retail customers. Higher score translates into better credit rating.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the status of the account. List of values can be Active, Inactive, in foreclosure, Re negotiated, Dispute, Frozen, Past Due, Closed etc. Account Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Status Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the current account status became effective.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Sub Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Account Sub Type Code that is sub classified as per the banking source system for their internal operational purpose.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Account Type Code that is classified as per the banking source system for their internal operational purpose. \nIn case of ALM FTP applications, Account type are fixed set of values.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Under Enforcement Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if an account that has been written off, defaulted, is under enforcement for the recovery of dues.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accounting Standard Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the accounting standard or the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. E.g. GAAP, IFRS etc. Generally Accepted Accounting Principles, GAAP. GAAP are the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. The Generally Accepted Accounting Principles exist to ensure that accountants are using the same or almost the same standards so that comparison of financial statements between or within a company is easy and accurate. They also promote transparency in accounting. However, GAAP provides broad guidelines, there is room for companies to follow an approach within a guideline.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjusted Loss Given Default Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the Adjusted LGD for an exposure and mainly used for Internal Model Method to arrive at RWA. This is expressed in decimal number, For example, 30 percent will be 0.3.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjustment Effective Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the adjustment Effective Date for determining the reference date for the IRC rate lookup.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjustment Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier for adjustment type dimension at an account. Examples can be CONTRA,NEW etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Allocated Transfer Risk Reserve Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Allocated Transfer Risk Reserve, ATRR. An allowance for bad debts that a bank keeps in order to protect against country risk. For example, a bank may keep an ATRR in case a country renders its currency inconvertible, which would prevent a foreign borrower in that country from making payments. This is a requirement of FDIC regulation which mandates that a banking institution shall establish an allocated transfer risk reserve, ATRR, for specified international assets when required by the Board.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Term",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the amortization term is used in conjunction with amortization term unit to define the term over which the payment is amortized, depreciated. Amortization term identifies whether a record is a balloon and is used in calculation of payment amounts. It is also used when recalculating payment amounts for User Defined Payment Pattern records that are defined as percentage of Current Payment and have more than one payment frequency defined in the Payment Pattern interface.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Term Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the amortization term unit is used in conjunction with amortization term, AMRT_TERM, to define the term over which the payment is amortized. Expected values are D Days, M Months and Y Years.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amount Due In Next Twelve Months",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Amount Due In Next 12 Months.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Application Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the application number that was filled by the customer that formed the basis for the contract. Application is a document that provides the essential financial and other information about the borrower on which the lender bases the decision to lend.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "As Of Date",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Attrition Reason Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the reason code for which customer has canceled the contract or the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Automatic Cancellation Of Commitment Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the contract has a feature of automatic cancellation in it. An automatic cancellable contract means that the contract can be cancelled automatically, if certain conditions mentioned in the contract agreement are satisfied. This is used for the assignment of credit conversion factor, in the case of Regulatory capital calculations like Basel.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Available For Sale Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the account has been marked for sale or securitization in near future.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Available Undrawn Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the available unfunded, undrawn amount of Total Commitment Amount, applicable for revolving and delay draw instruments. One portion of undrawn amount is available for utilizing based on current factors. From the perspective of LCR calculations, this attribute captures the portion of the undrawn amount that is available during the liquidity horizon. The regulatory liquidity horizon is 30 days.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bank Base Role Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Identifier of the bank role in the Securitization Exposure. LOVs are  Originator, Investor, Sponsor, Credit Protection Provider, Missing Bank Base Role and Third Party.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bank Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code or identifier of the financial institution which owns the transaction, assigned by the central bank. Bank identifier can be one of the following identifier or code: BIC Code, Bank Identifier Codes, ABA Code, Routing transfer number, IFSC Code, Indian Financial System Code, BCHH etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Banks Own Estimate Of Credit Conversion Factor Percent",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the Credit Conversion Factor percent estimate by the bank. This is applicable only to the off balance amount or products and not to the bills contracts. Using this weight as factor, Risk weighted Assets are calculated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Behavior Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to unique identifier of behavior type code. Expected values are Non Maturity, Non Performing And Devolvement, Recovery, Volatile, Core and Non Core. \nThe payment and repricing characteristics can be gathered for most financial instruments, but for some the contractual cashflows may be absent or may be based on occurrence of certain events. Asset Liability Management allows you to define custom behavior, payment and repricing patterns to accurately model the unique characteristics for such instruments. Behavior pattern can be defined for the following types of instruments \nNon maturity Instruments,\nNon Performing Instruments,\nDevolvement and Recovery of Guarantees.\n\nOnce you create a behavior pattern, you can use it by mapping the unique behavior pattern code as the amortization type code for your instruments. Behavior pattern codes are defined within a pre set range, 70000 – 99999. When the cash flow engine encounters an instrument with an amortization type code within this pre determined range, it understands that a Behavior Pattern should be referenced for determining the principal cash flow amounts. Non performing Asset need not have a sub type associated, all the events i.e. substandard, doubtful or loss is processed. No interest cashflow will be generated and any balance on the maturity date would be written off. In the case of non maturity instruments the core and volatile runoff events are run. Interest cashflow is paid out on the payment dates. The engine assumes the maturity of the longest non maturing instrument as the maturity date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Benchmark Index Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the primary currency associated with the benchmark of the interest rate. This is applicable in case of adjustable rate instruments. For example, if the interest rate benchmark is LIBOR USD, the currency will be USD and the benchmark code will be LIBOR.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Branch Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the branch code. A branch, banking center or financial center is a retail location where a financial institution offers a wide array of face to face and automated services to its customers. This column Refers to the unique branch code assigned by the financial institution. A branch may specialize to offer certain type of products to customers. Branch needs approval from the regulators.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Unit Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the business unit code as defined by the organization. A business unit is generally a broader definition and represents all the units in an organization. Business Unit dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Calculation Option Display Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the choice between Just shifting the dates for holiday calendar and recalculating the payments based on the new dates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Campaign Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the campaign under which the account was acquired. Campaign is defined as Specific activities designed to promote a product, service or business. A marketing campaign is a coordinated series of steps that can include promotion of a product through different mediums like television, radio, print, online using a variety of different types of advertisements. The campaign doesn't have to rely solely on advertising, and can also include demonstrations, word of mouth and other interactive techniques. Campaigns are created or started by financial institutions to promote sales, improve visibility of the brand or product and create opportunities for addon sales and cross selling.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Capital Market Exposure Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is a capital market exposure. The capital market exposures would include both their direct exposures and indirect exposures of a financial institution. This is applicable to India jurisdiction. As per Reserve Bank of India, following would qualify as a capital market exposure, CME, Direct investments in equity shares, convertible bonds, convertible debentures and units of equity oriented mutual funds the corpus of which is not exclusively invested in corporate debt, advances against shares or bonds or debentures or other securities or on clean basis to individuals for investment in shares, including IPOs or ESOPs, convertible bonds, convertible debentures, and units of equity oriented mutual funds, advances for any other purposes where shares or convertible bonds or convertible debentures or units of equity oriented mutual funds are taken as primary security, advances for any other purposes to the extent secured by the collateral security of shares or convertible bonds or convertible debentures or units of equity oriented mutual funds i.e. where the primary security other than shares or convertible bonds or convertible debentures or units of equity oriented mutual funds does not fully cover the advances, secured and unsecured advances to stockbrokers and guarantees issued on behalf of stockbrokers and market makers, loans sanctioned to corporate against the security of shares or bonds or debentures or other securities or on clean basis for meeting contribution of promoter to the equity of new companies in anticipation of raising resources, bridge loans to companies against expected equity flows or issues, underwriting commitments taken up by the banks in respect of primary issue of shares or convertible bonds or convertible debentures or units of equity oriented mutual funds. However, with effect from April 16, 2008, banks may exclude their own underwriting commitments, as also the underwriting commitments of their subsidiaries, through the book running process for the purpose of arriving at the capital market exposure of the solo bank as well as the consolidated bank. The position in this regard would be reviewed at a future date, financing to stockbrokers for margin trading, all exposures to Venture Capital Funds, both registered and unregistered.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Channel Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to an organizational specific code for the type of channel used to obtain financing for example email, phone etc. Channel Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Claim Foreign Currency And Bank Funding Currency Same Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the financial institution is funded in the same currency as that of a claim. This is applicable in case of claims on foreign sovereigns. This is applicable to Basel regulation of India jurisdiction. Claims denominated in domestic currency of the foreign sovereign met out of the resources in the same currency raised in the jurisdiction of that sovereign will attract a risk weight of zero percent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commission Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to any commission that is earned by the bank from a customer or either of customer accounts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commission General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the Sales commission. To be used in conjunction with n_sales_commission. GL Account dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commit To Commit Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Refers to whether the contract commitment is just a commitment made to commit a contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commitment Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total commitment amount of an account. This is applicable in case of commitment contracts which are also known as lock ins and rate locks. It is a lenders promise to hold a certain interest rate and a certain number of terms, usually for a specified time. For a fee, financial institutions sell these commitment contracts. For participation arrangement this column will store reporting bank contribution only.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commitment Fee",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the fee amount charged by the financial institution to extend the facility. This is the fee charged by the financial institution for an unused credit line or undisbursed loan. A commitment fee is generally specified as a fixed percentage of the undisbursed loan amount. The lender charges a commitment fee as compensation for keeping a line of credit open or to guarantee a loan at a specific date in future. The borrower pays the fee in return for the assurance that the lender will supply the loan funds at the specified future date and at the contracted interest rate, regardless of conditions in the financial and credit markets.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commitment Option Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of option linked to commitment. For example, type can be European, American etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commitment Renewal Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which commitment contract is renewed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commitment Term",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the period for which the commitment is sanctioned. This commitment is granted with a pre decided rate of interest and is called as Rate Lock Commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commitment Term Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the unit of the commitment term as in D days, M months, Y year. This should be used in conjunction with commitment term to defined the commitment period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Committed Refund Amount Fee Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether there are any fees for committed refund amount or not. A value Y indicates that fees will be charged on the committed refund amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Common Chart Of Account Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the chart of accounts is a listing of the names of the accounts that a financial institution has identified and made available for recording transactions in its general ledger. A financial institution has the flexibility to define its chart of accounts as per requirement, including adding accounts as needed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Compounding Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to compounding frequency, which is used calculate interest income. Compounded interest is calculated only when the compounding frequency is <less than payment frequency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Compounding Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the unit of compounding frequency, possible values are D, for days, BD, for business days, W, for Weeks, M, for month, y, for Year. Column is applicable for instruments like Equity convertible bond.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Construction Loan Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Construction loan type code. The construction loans can be 1 4 Family, other construction type etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contractual Change Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the last modification date of the contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Correspondent Relationship Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if credit line is provided for corresponded banking purpose.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Country Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the country code associated with the account or instrument or party or location. There are several popular country codes as part of ISO 3166 standard published by the International Organization for Standardization. ISO 3166 defines codes for the names of countries, dependent territories, special areas of geographical interest and their principal subdivisions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Country Code Of Risk",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the ISO country code of the risk. Country of risk refers to the country wherein the counter party does business. Dim Country is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Participation Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier for the type of credit participation. Credit Participation Contract Type Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the current performance status of the account. List of values are Delinquent, Foreclosed, Impaired, Closed, Disposed, Transferred, Bankrupt etc. Credit Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Status Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to date on which the current of Credit Status is updated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Deferred Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to deferred current balance refers to Current un amortized deferred balance representing future income or expense such as premium or discount. Deferred Current Balance holds the discount or premium associated with an instrument. A discount loan or instrument is one with interest deducted from the face value of the loan at its origination. The discount amount is the difference between the loans current market price and its stated par value. The deferred current balance, which represents income, will be amortized over the life of the instrument according to a constant yield calculation. Therefore, as the instrument approaches maturity, the book balance approaches the face value or par balance. For discounted instruments, the deferred current balance is a negative balance. This indicates to the cash flow engine that the balance is income.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Deferred Premium Or Discount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the current Deferred Premium or Discount refers to Current non amortized deferred balance representing future income or expense such as premium or discount. Deferred Current Balance holds the discount or premium associated with an instrument. A discount loan or instrument is one with interest deducted from the face value of the loan at its origination. The discount amount is the difference between the loans current market price and its stated par value. The deferred current balance, which represents income, will be amortized over the life of the instrument according to a constant yield calculation. Therefore, as the instrument approaches maturity, the book balance approaches the face value or par balance. For discounted instruments, the deferred current balance is a negative balance. This indicates to the cash flow engine that the balance is income.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to current annualized gross rate of an account. This rate would be different in case of a consortium funding. When conventionally amortizing a records balance with the Model with Gross Rates option selected, the cash flow engine uses the current gross rate as the customer rate. If the option is not selected, then the cash flow engine uses current net rate as the customer rate for amortization calculation. Also to determine the prepayment rate, the current customer rate must be compared to the market rate. If the Model with Gross Rates option is selected, then the customer rate is represented by the current gross rate. If the Model with Gross Rates option is not selected, the current net rate is used as the current customer rate. When this is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Payment Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the current period payment made. Current Payment is the installment amount received from the customer. Current payment in the case of asset products represents the current periodic payment made to repay the outstanding balance. For standard amortization types, those that are not non patterned and non scheduled, Transfer Pricing Application, remaining term methods, uses the current payment from the detail record for the life of the record until a payment recalculation occurs. This will same as maturity amount in case of repo contracts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source system from where data is extracted. Data can be sourced from multiple sources, this column will Refers to the source code from where the data is extracted for this extraction date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Day Count Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the day count indicator. Expected values are A/360, A/365, A/A, 30/360, 30/360 EUROPEAN, 30/A. Suggested default value are 1=30/360 for amortizing transactions OR 3=Act/Act. for non amortization.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Deferred Costs",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the deferred financing costs or debt issuance costs is an accounting concept meaning costs associated with debt issuing process, such as various fees and commissions paid to investment banks, law firms, auditors, regulators, and so on.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Deferred Fees Unamortized Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the current deferred fees amount, reflecting the unamortized portion. Fees that are amortized through the life of the loan such as Closing Fees or Amendment Fees.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delinquency Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of days the account has remained delinquent in the current delinquency period. The account could have been delinquent a number of time earlier, but Refers to the current delinquency days.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delinquency Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Captures the unique identifier of delinquency status. Indicative values are Charge off, Redeemed, Doubtful, Bad Debt, Sub Standard, Non Performing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discount Margin",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Discount Margin is average expected return earned over a given reference rate, that is additional to given reference rate, for a floating rate security. Column is applicable for instruments like Floating Rate Note. Refers to the margin or spread that must be added to discount rate obtained from interest rate curve to get the final discount rate that is used to calculate present value of an instrument. This is an optional input and is specified as a rate or price, see Discount Rate Margin Type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discount Rate Margin Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Indicates the form in which Discount Margin is given. Indicative Values are RATE, Rate Spread, PRICE, Price of instrument per 100. When it is given as PRICE then engine solves it to obtain a rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discretion To Reprice Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates as per contract, Bank has the discretion to reprice and decide the date from which the rate is applicable.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Draw Notice Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of days of notice that legally needs to be provided to the Bank by the party, obligor, to draw on the loan. Also, the drawdown request would have to be processed and the time required is factored into the notice days.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Drawn Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount drawn till date under the facility given for the account. For instance, a customer draws 100 and then pays back 20 and then draws 50. While the EOP Bal would be 130, 100  20 + 50, the drawn amount would be 150, 100 + 50. A customer can drawn multiple times under the same account or choose to create multiple accounts for each drawdown.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the effective date of the account or contract or interest rate or exchange rate from which it is effective.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Interest Rate Effective Initial Spread Calculation Instruction Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether EIR, Effective Interest Rate, or EIS, Effective Initial Spread Calculation, needs to be calculated by the application. This can also be interpreted as 'New account Flag' as well. The application would compute based on the input. If the flag is Blank and there are no value given as download, then application will look for rates in inception rate table. If found it will be used else it will be calculated by application and flag will be updated as A.\nIf the flag is Y, then application would update the inception rate table with the calculated new EIR or EIS corresponding to latest ACCOUNT START DATE. This value would be picked for the successive RUN.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Interest Rate For Hedge Management",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the effective interest rate of the instrument for Hedge Management application.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Maturity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the effective maturity of an exposure. Typically, it would be longest possible remaining time before the counterparty is scheduled to fulfill its obligation. It is used in RWA calculation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Maturity Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the effective maturity date of the contract. Effective maturity takes into account that certain instruments like bonds have a callable feature which can likely shorten the maturity of these instruments.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Eligible For Intraday Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the particular instrument is eligible for usage as an Intraday liquidity source.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Embedded Options Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the security has an embedded option within it. Embedded option refers to a provision in a security that is an inseparable part of the instrument. An embedded option is a special condition attached to a security, and in particular, a bond that gives the holder or the issuer the right to perform a specified action at some point in the future. An embedded option is part of another security, and as such does not trade by itself. Nevertheless, it can affect the value of the security of which it is a component. A security is not limited to one embedded option, as there may be several embedded options in one security.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Employee Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether an employee of the financial institution has a personal association on this account, either through a direct customer role or a family member relationship.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to end of period balance which includes accrued interest. All the calculations such as interest, prepayment amounts etc. are based on this amount. This is used in all the calculations performed by cash flow engine. In Case of LC Contracts, EOP Balance should be populated when LC Is executed. Till LC is executed, LC amount sanctioned should be hold in Total Commitment Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the end of period book balance. It is the sum of total of End of Period Balance Plus Deferred Balance. This is used while calculating amortization. The book balance is the term financial institutions use to describe the amount of money available before any adjustments have been made for deposits in transit, checks that have not yet been cleared, reserve requirements and interest received from 'float funds' hence is generally greater than end of period balance, Also called as 'gross balance'. It also excludes any deferred balance that is unamortized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Interest Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the end of period interest paid to the customer. The interest is paid on term deposits that have opted for regular interest payments. In some term deposits which fall under the cumulative scheme, no interest is paid before maturity.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Principal Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the outstanding principal balance at the end of the month. Each account will have principal and interest component, this column will capture the outstanding principal component at the end of the month.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Expected Loss Best Estimate Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the best estimate of expected loss. This is applicable to exposures which have already defaulted. This is useful when financial institutions use their own estimates of Loss given default.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure At Default Post Mitigation",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the exposure at default amount post mitigation by all eligible mitigants\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure At Default Pre Mitigation",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the pre mitigation Exposure at default amount of the total exposure, as applicable to the particular jurisdiction. This is generally equal to the sum of Exposure of default pre mitigation for the drawn portion of the exposure and the exposure of default per mitigation for the undrawn portion of the exposure.\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure Defaulted Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether an exposure is treated as defaulted or not. Exposure is considered as defaulted when they are delinquent for 270 days or more. This is an exposure that is under prolonged delinquent state. List of values are Y, N. If the value is updated as Y means the exposure has defaulted and if the value is updated as N means the exposure has not defaulted.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure Held At Fair Value Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is held at fair value. Fair value is applicable to exposures involving less liquid and physical assets. In case of actively traded instruments, the market value is the fair value. This is in the context of Financial Accounting standards board.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Facility Committed Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the facility is committed or not. In committed facilities, the borrowing companies must meet specific requirements set forth by the lending institution in order to receive the stated funds.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Facility Fee Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the fee amount charged by the Financial Institution to the customer to extend the credit facility.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Facility Held For Planned Use Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the facility is held for planned use. This indicates that the credit facility is not in use in currently, but may be used in future. It indicates if the purpose of the credit facility is a specific use like in project finance, lease etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fee Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the fees charged or paid by the Financial Institution in originating or acquiring the given instrument or account. Incase of investments, It Refers to the fee receivable i.e. current fee which has been assessed internally but not yet due to be charged for the account. It is used to calculate the Amortized Cost. If Amortized cost is not sourced in the Investments table, then it is derived from EOP balance + Current Deferred Premium Or Discount  Accrued interest  Fees  Deferred Fees Unamortized Amount. In case of bills, it refers to the fees charged by the financial institution in purchasing the bill and paying the amount to the exporter.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fee General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds fee amount. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fees For Effective Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the consolidated current un amortized, portion of the, fees which is or are applicable for, or are integral part of, Effective Interest Rate computation as per IFRS 9. This value will be used within the Cash Flow Engine.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fiduciary Relationship Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account is held with the bank under a fiduciary capacity. Fiduciary capacity means trustee, executor, administrator, registrar of stocks and bonds, transfer agent, guardian, assignee, receiver, or custodian under a uniform gifts to minors act investment adviser, if the bank receives a fee for its investment advice any capacity in which the bank possesses investment discretion on behalf of another or any other similar capacity that the regulator authorizes. For example deposits that are placed with a bank by a national bank for which the bank is a fiduciary.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forbearance And Renegotiation Status Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the Forbearance or Renegotiation Status Date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forbearance Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to Forbearance Status Code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "General Ledger Account Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique general ledger account code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Guaranteed By Sovereign Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if an account is partially or fully guaranteed by the Sovereign, Government agencies or sponsored agencies. This is derived using Standard Guarantor Type of an account or Standard Issuer type of Mitigant of the Account. List of values are Y and N. This also indicates if the exposure is directly and unconditionally by a sovereign entity or an entity for which zero risk weight is applicable in standardized approach. Claims on BIS, Bank of International Settlement, IMF, International Monetary Fund, ECB, European Central bank, MDB, Multilateral Development Bank, carry zero risk weight. Examples of MDB are The Asian Development Bank, ADB, The African Development Bank, AfDB, The European Investment Bank, EIB, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Guarantor Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the identifier of the Party who guaranteed the program.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Guidance Line Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the remaining guidance line amount approved but not disclosed to the client.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Held By Client Or Proprietary Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the account is held by client or not. If the value is updated as Y which means the security is held by client and if the value is updated as N which means the security is in the proprietary account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holiday Display Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holiday calendar code as per the holiday calendar defined through the UI.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holiday Rolling Convention Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holiday rolling convention code, based on which the date on which cash flow has to happen is decided. This includes  Following business day, Modified following business day, Previous business day, Modified previous business day etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "IFSB Contract Type Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Islamic Financial Services Board classification of the instrument. This is applicable in case of Islamic finance products. Examples, include Murabahah, Musharakah, Sukuk, etc. Ifsb Contract Type Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "ISO Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Industry Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the code that describes the primary business activity of the obligor or the industry to which the party is associated to as per the North American Industry Classification System, NAICS. If the NAICS code is not available, provide either the Standard Industrial Classification, SIC, or Global Industry Classification Standard, GICS. If the obligor is an individual, the industry code should be consistent with the industry in which the commercial purpose of the loan operates.\nIf the business or individual operates in multiple industries, the BHC or IHC should report the industry that best represents the commercial risk of the loan, i.e., the predominant industry.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Initial Fees For IFRS Nine Effective Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the consolidated initial, un amortized, fees which is or are applicable for, or are integral part of, Effective Interest Rate computation as per IFRS 9. This value will be used to compute the Effective Interest rate as of account inception date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of instrument type, which is defined as code identifying the instrument category of the customer account. Instrument Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instruments With Modified Terms And Conditions Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the original terms and conditions of the contract have been modified or not. List of values are Y indicates Yes, N indicates No.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Calculation Method",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the method of computing interest. Expected values are Simple and Compounded.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Income",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the interest income earned from the account by the financial institution for the period. Interest income is calculated as the sum of the interest component of the payments received from customers. This does not include other fees or revenues such as processing revenue, maintenance fee etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Payment Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the coupon frequency of all the coupon bearing instruments. List of values is defined as No Frequency =  1, Once = 0, Annual = 1, Semiannual = 2, Every Fourth Month = 3, Quarterly = 4, Bimonthly = 6, Monthly = 12, Biweekly = 26, Weekly = 52, Daily = 365. Column is applicable for instruments like Equity convertible bond.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Payment Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Payment frequency unit is used in conjunction with Interest payment frequency to define the payment frequency of an account. List of values are D days, M months and Y years.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Payment Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the interest payment type if it is in advance or in arrears. If the value is selected as Arrears than interest payments are paid at the end of the payment period along with the principal payments. If the value is selected as Advance than Interest payments are paid at the beginning of the payment period starting from the origination date. Payments are made on every payment date except for the Maturity date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the interest rate as applicable as on As of Date. This is expected for both, fixed rate as well as floating rate instrument. For floating rate instruments, the rate would be computed at the time of next re pricing date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the interest rate code that identifies the index to which adjustable rate accounts are tied. Transfer Pricing references interest rate code when calculating option costs and uses the relevant interest rate from the defined interest rate code, IRC, together with the margin to determine the reprice rate for the instrument. The value populated in this column for each account record must be synchronized with the actual interest rate code values defined in Transfer Pricing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Margin Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of Margin. Margin can be provided as Rate or Percentage. If provided as Rate then current net rate is Applicable rate from the IRC plus margin. If Percentage, Margin is calculated using IRC and Margin provided as percent. If it is Rate and input is 2 percent, then 2 needs to be provided in spread or margin column. If it is Percent and input is 5 percent of IRC, then 5 needs to be provided in spread or margin column. This column has been added to support Tiered Balance Interest Rates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the type of interest rate paid on this transaction., For instance Fixed Or Floating.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "International Banking Facility Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account or transaction is belongs to an international banking facility. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Principal Payment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to immediate past date on which the principal payment was made to the account. The use of Last Principal Payment Date rather than, Next Principal Payment Date  Principal Payment Frequency, allows for short or extended first period payments. Beyond the first forecasted cash flow, Next Principal Payment Date, the cash flow engine rolls forward by Principal Payment Frequency until Maturity Date. Default to Next Principal Payment Date  Principal Payment Frequency if actual Last Principal Payment Date is not available.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Reprice Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the adjustable instruments last repriced or the date on which the current interest rate changed. For a repo contract this will generally be same as origination date. For an adjustable rate straight term transfer priced record, Transfer Pricing uses the Last reprice date to identify the assignment date, Yield Curve Date. The assignment date of the Interest Rate Code just before, or equal to, the last reprice date of the record is used as the transfer pricing yield curve. For example, if the last reprice date of the record is 15th Jan 2006 and the Historical Rate interest rate code, IRC, is defined at monthly intervals and only at month end, the assignment date would be 31st Dec 2005. The reprice frequency is then matched to the same term on the transfer pricing yield curve, IRC, defined in the Historical Rates in Transfer Pricing. For fixed rate records, the last reprice date and next reprice date are not referenced. Origination date and maturity dates are used instead. This column has been added to support Tiered Balance Interest Rates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Lead Bank Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to identify if the reporting bank is a lead bank in the consortium lending. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Legal Entity Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the entity code of the legal entity to which the account will be attributed in the general ledger.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Lending Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of lending for the contract. The possible values for lending types are Sole, Consortium and Both.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Lien Position",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of underlying note on the loan. This is also known as the lien position. First mortgage is a mortgage in a first lien position on the property that secures the mortgage. A first mortgage has priority over all other liens or class.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Line Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code of the credit line associated with this account. Credit Line dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Line Of Business Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to line of business, LOB, is a functional unit that offers the products to the customer by the financial entity. Example: Corporate Finance, Trade Services, Private Wealth Management, Treasury Services, Retail Banking, Cards services etc. Refers to the unique code of the line of business applicable to the respective product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Negative Amortization Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to total amount of principal increase due to payments, which do not cover the entire interest component. This is used while calculating current payment for floating rate accounts. This column is part of the loan contract that will be drawn against.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Negative Amortization Equalization Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to frequency at which negatively amortizing accounts are fully re amortized. Negatively amortizing accounts are the ones which have defaulted in their payment and hence the outstanding payment is added to their outstanding principal balance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Negative Amortization Equalization Frequency Multiplier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the negative amortization equalization unit like D days, M months or Y year and is used in conjunction with Loan Negative Amortization Equalization Frequency. Essentially used to calculate the period required for a negatively amortized instrument to fully amortize.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Negative Amortization Limit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum negative amortization allowed as a percentage of the original balance. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Next Payment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the next payment is due as per payment schedule. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Next Reprice Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date of next scheduled interest rate change for adjustable rate accounts for Loan Committed. Next reprice date defines the first forecasted repricing event after as of date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Original Payment Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to original payment amount at the date of origination. This is used to compute forecast payment amounts in amortization, payment, patterns. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Payment Decrease Cycle",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum payment decrease allowed during a repricing cycle of an adjustable rate instrument. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Payment Decrease Life",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum payment decrease allowed during life of an adjustable rate instrument. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Payment Increase Cycle",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum payment increase allowed during a repricing cycle on an adjustable rate instrument. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Payment Increase Life",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum payment increase allowed during the life of an adjustable rate instrument. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Rate Decrease Cycle",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum rate decrease allowed during a repricing cycle for an adjustable rate instrument. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Remaining Number Of Payments",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to remaining number of payments to be made from As of Date till Maturity Date. This is used to compute the payment dates on which payment of principal and interest happen. For non term accounts, this is set to 1. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Start Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the start date of the loan contract. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Term",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the loan term. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Term Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the loan term unit in D days, M months or Y year. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Location Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique location code. Location code is defined as the code which will represent the address of the property from zip code onwards like which city, country etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Long Run Weighted Average Loss Given Default",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the long run weighted average loss given default. This is the estimate of the average economic loss rate that is expected to be incurred in the event of default, measured over the long run. If the purchasing bank can estimate either the default weighted average loss rates of pool given default or average PD in a reliable manner, the bank may estimate the other parameter based on an estimate of the expected long run loss rate. The bank may, i, use an appropriate PD estimate to infer the long run default weighted average loss rate given default, or, ii, use a long run default weighted average loss rate given default to infer the appropriate PD.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loss Given Default Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the loss given default value of the account. Loss given default is the expected amount to be lost by the financial institution if the borrower defaults. Institutions such as banks will determine their credit losses through an analysis of the actual loan defaults. While quantifying some losses may be simple, in some situations it may be quite difficult and require the analysis of multiple variables. For example, if Bank X loans USD 1 million to ABC Company and ABC defaults on the note, Bank Xs loss is not necessarily USD 1 million. This is because Bank X may hold substantial assets as collateral, and or may use the courts in an effort to be made whole. When all of these variables are factored in, Bank X may have lost substantially less than the original USD 1 million loan. The process of analyzing all of these variables, as well as all of the other loans in Bank Xs portfolio, is paramount to determining the loss given default. This value is calculated by the system.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loss Given Default Refresh Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which loss given default for the contract was refreshed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Disruption Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether the liquidity facility provided by the sponsor is to be availed in case of market disruptions only. This is used for CCF assignment as per Basel accord para no. 580. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Materiality Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is material or not. Material exposure is an exposure that is substantial in terms of size or risk.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maturity Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the contractual date on which the principal balance is expected to fully amortize and the balance payable would be nil. This is applicable for term loan products but not for revolving credit or overdraft type of account. In case of insurance policy, for some whole life insurance products the maturity date is aligned to maximum attained age and the policy is payable upon the earlier of the maturity date or the death of the insured. In case of Term Life insurance policies the maturity date is determined as policy issue date plus Term of the contract. In case of an annuity it is the date from which the annuitant has chosen to take the payouts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Negative Amortization Equalization Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the negative amortization occurs when the loan installment payment is insufficient to cover the interest portion of the installment, resulting in the residual interest amount getting capitalized to the loan amount. Date on which a negative amortization type account fully re amortizes, regardless of payment caps and floors. The Oracle Transfer Pricing adjustable type cash flow methodologies reference NEG_AMRT_EQ_DATE when calculating the current payment for negative amortization type accounts. NEG_AMRT_EQ_DATE is only relevant for adjustable rate accounts. On the NEG_AMRT_EQ_DATE, the payment for a negatively amortizing record is recalculated. On this date, the CUR_PAYMENT for the record is fully re amortized. NEG_AMRT_EQ_DATE ignores payment decrease or increase limits per period and payment decrease or increase limits for the life of the record. Therefore, after the payment recalculation of a NEG_AMRT_EQ_DATE, the record is no longer negatively amortizing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Negative Amortization Limit Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the maximum negative amortization allowed as a percentage of the original balance. Transfer Pricing applications cash flow methodologies reference NEG_AMRT_LIMIT to determine if the NEG_AMRT_AMT is exceeding its defined limits, if the negative amortization limit is exceeded, the engine recalculates current payment, cur_payment.\n\nWhile calculating a payment event, payment date, if the cash flow engine calculates negative principal runoff, the cash flow engine also checks the negative amortization limit, NEG_AMRT_LIMIT, in order to ensure that the current NEG_AMRT_AMT is not exceeding its limit. NEG_AMRT_LIMIT is defined as a percentage of the original principal balance. For example, NEG_AMRT_LIMIT = 25 means that the negative amortization amount should never exceed 25 percent of the original principal balance, principal balance should never exceed 125 percent of the original balance. The formula for this check is:\n, 1 * calculated, negative, principal runoff + negative amortization balance > NEG_AMRT_LIMIT divided by 100 * ORG_PAR_BAL,\nIf NEG_AMRT_AMT is exceeding this limit, the cash flow engine recalculates the payment amount in order to fully amortize the instrument.\nWhen deriving the recalculated payment amount after exceeding the NEG_AMRT_LIMIT, the cash flow engine also applies payment decrease or increase limits per period, PMT_DECR_CYCLE, PMT_INCR_CYCLE, and payment decrease or increase limits for the life of the record, PMT_DECR_LIFE,\nPMT_INCR_LIFE. Because these fields limit how much the CUR_PAYMENT can be changed, it is possible that the record continues to negatively amortize even after\na NEG_AMRT_LIMIT has been exceeded. If negative amortization does continue, the NEG_AMRT_AMT continues to grow.\nRefers to the maximum loan balance permitted under the negative amortization for the loan. Negative amortization is an increase in the principal balance of a loan caused by a failure to make payments that cover the interest due. The remaining amount of interest owed is added to the principal of the loan.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Net Unamortized Fee",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to net unamortized fee. Typically fees amortized over the life cycle of the Contract. Refers to the few components that are not amortized and are collected as and when required. Origination fees for a given Contract should be offset against related origination costs and the net amount should be deferred.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Net Unamortized Origination Cost",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Net unamortized origination cost in local currency. Direct origination costs for a given Contract should be offset against related commitment fees and the net amount should be deferred.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Next Principal Payment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to Due date of the next scheduled principal payment. Otherwise known as cash flow date or date of runoff. Next Principal Payment Date is used to define the next scheduled, forecasted, payment date. If Remaining number of payments > 1, Next Principal Payment Date < Maturity Date, If Remaining number of payments = 1, Next Principal Payment Date = Maturity Date. In case of conventionally amortizing instruments Next Principal Payment Date is same as Next Interest Payment Date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Offer Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the offer. An offer is defined as an abstract, physical and or monetary benefit attached to a product for a predetermined period of time with a view to increase the sales of a product. Offer dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Organization Unit Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the cost center to which the account belongs to. Organization Unit dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the original account number held by the source system. If there are multiple source systems without unique account numbers, we expect the account number and source system to be concatenated as part of the primary key, while this column will store the original account number as generated by the source system.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Original Commitment Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount committed originally to the account before any revisions which the lender agrees to grant to borrower.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Deferred Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the original non amortized income or expense, such as premiums discounts, fees, charges but it does not includes deferred cost incurred by bank which is not directly associated at account level. Unamortized income or expense are the unrealized income or expense on the account and would begin to accrue after issue of the security. The discounted bonds are sold at a price lower than the par value and would amortize to mature at par. Likewise, the premium bonds are sold at a premium over the par value of the bond as it may be offering a higher coupon rate compared to market. The premium paid is amortized over the period to mature at par value on the maturity date. Commitment contracts charge a commitment fee, which is amortized over a period based on the drawdown from the commitment contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Deferred Premium Or Discount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the original premium or discount which is the original non amortized income or expense, such as premiums or discounts. Unamortized income or expense are the unrealized on the account and would begin to accrue after issue of the security. The discounted bonds sells at a price lower than the par value and would amortize to mature at par. Likewise, the premium bond sells at premium over the par value of the bond as it may be offering a higher coupon rate compared to market. The premium paid amortizes over the period to mature at par value on the maturity date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Gross Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the book balance at the time of origination. Original gross book balance is the sum total of End of Period Balance Plus Deferred Balance, represented as a negative amount to depict the unamortized portion. This is used while calculating amortization. The book balance is the term financial institutions use to describe the amount of money available before any adjustments have been made for deposits in transit, checks that have not yet been cleared, reserve requirements and interest received from 'float funds' hence is generally greater than end of period balance, Also called as 'gross balance'.\nIt also excludes any deferred balance that is unamortized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Maturity Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the original maturity date of the reference issue, typically debt securities. It would be used to derive residual maturity and original maturity of the reference issue. Original maturity date is the contractual date on which the principal balance of an earning asset or debt instrument is due and payable to the holder.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Next Payment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Store the next payment date is the due date of the next scheduled payment. Otherwise known as cash flow date or date of runoff. Original next payment date Refers to the next payment date from the account start date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Principal Payment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the first principal payment date as per the original payment schedule of the loan. The payment schedules fixed by the financial institution may change under certain circumstances like restructuring, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Overlap Group Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to a Unique Code for the Overlap Group.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Owner Occupied Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the property is occupied by the owner or not. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Parent Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the parent account number of the contract or account. For instance, if the asset is an underlying for a repurchase agreement, then the account number of the repo contract is expected in this column. Incase of Borrowings, it can also store the account as parent account which is help by the financial institution in fiduciary capacity. In case of cards, parent account number refers to corporate card master account number. Incase of OD Accounts, it should refer to the parent savings, checking account number or loan account number if the overdraft has arisen due to breach of limits or funds from those respective accounts. It will store loan account number as parent account number even for the cases where the overdraft has arisen in the escrow account for the payment of taxes and or insurance. It should be left NULL, if parent child relationship does not exist.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Participation Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account or credit facility is a part of the syndicate. Syndicated loans are usually large loans made to corporate borrowers. More than one financial institution is involved in a syndicated loan. The main goal of syndicated lending is to spread the risk of a borrower default across multiple lenders, such as banks, or institutional investors like pensions funds and hedge funds. Because syndicated loans tend to be much larger than standard bank loans, the risk of even one borrower defaulting could cripple a single lender. Syndicated loans are also used in the leveraged buyout community to fund large corporate takeovers with primarily debt funding.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Participation Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the percentage of total participation amount to be participated by the entity. This should be populated by reporting entity when they participate in a given contract and do not play role of lead or fronting agent. This should hold the value of less than 100 since other financial institutions are participating in the credit facility as well. This percentage should be the Participation Percent of the reporting entity. NULL value will be considered as 100 percent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Participation Sold Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to percentage contribution of the reporting bank in the total borrowed amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Party Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier for the party. Party is defined as an entity or a person who takes part or is involved in an agreement, lawsuit, or transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Party Interest Rate Discretion Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates the interest rate reset for a contract where the party has the right to establish or reset the interest rate at his sole discretion. List of values are Y, N. A value Y indicates that the interest rate reset is at the discretion of party, and N indicates not at the discretion of the party.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Past Due Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the account was declared past due. The past due date represent the date on which the loan became past due during the current default period, this occurs when the loan is in default status only.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Past Due Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to Indicate whether the exposure is past due or not. If delinquency days are greater than 90 then its past due. If the value is updated as Y means the exposure is past due and if the value is updated as N means the exposure is not past due. List of Values are Y,N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Adjustment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date of next payment adjustment on an adjustable rate instrument, in case of negative amortization type of accounts. This attribute is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment. Date of next payment adjustment for adjustable rate, negative amortization type accounts. Transfer Pricing cash flow methodologies reference Payment Adjust Date when processing and calculating the current payment for negative amortization type accounts. This is only relevant for adjustable rate accounts where account is negatively amortizing. The cash flow engine recalculates negatively amortizing payment amounts on a Payment Adjust Date. Just like a payment recalculation for a Negative Amortization Limit, a payment recalculation on the Payment Adjust Date takes into account the effects of payment decrease or increase limits per period and payment decrease or increase limits for the life of the record. This allows for additional negative amortization to occur even after the Payment Adjust Date has recalculated the payment amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Change Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the frequency at which the payment adjusts. This is used to compute current payment for negatively amortized accounts and is not applicable for fixed term accounts. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Change Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the units D days or M months or Y years of Pmt_chg_freq. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Power Of Attorney Or Signatory Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether this account has power of attorney or signatory authority granted to a person with a US address. . This is required for FATCA purpose. List of values are Y, N. If the value is updated as Y means this account has power of attorney granted to a person with a US address and if the value is updated as N means the power of attorney is not granted to a person with US address or this account does not have any power of attorney.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Principal Drawn Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the principal drawn amount. This definition differs from End Period Balance in the sense that it does not include fees, charges, interest amounts etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Principal Payment Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the principal payment frequency. It is used in conjunction with Principal Payment Frequency Unit to define the payment frequency of an account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Principal Payment Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the unit of the principal payment frequency in terms of D days, W weeks, M months, Y years. It is used in conjunction with principal Payment Frequency to define the payment frequency of an account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Probability Of Default Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the probability of default of an exposure over a period of one year, as required for regulatory capital calculation. This will be used in RWA calculation based on advanced approach. This is expressed in decimal number, For example, 30 percent will be 0.3.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Probability Of Default Refresh Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which said probability of default for the contract was refreshed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Product Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code assigned to each of the Products offered by the Bank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Product Description",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description",
                    "gcd": "Refers to the description of each of the Products offered by the Bank. For e.g. Automobile loans or Wire transfer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Project Finance Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Indicated Project Finance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Property Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the property type code associated with given account. Property Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Provision Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the provision amount set against the account. Provisions are set aside by financial institution to cover against expected future loss. Provision amount on the loan increases as the credit quality deteriorates signifying high likelihood of default and thereby mandating more allocation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Provision Amount Inception Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total provisions made since inception. Generally provisions are set aside by companies to pay for losses may occur in future. Provisions percentage increases as the credit status of the loan decreases, signifying a low likelihood of recovering the loan.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Provision Amount Month Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the provision amount set against the account from the start of the month till date. Provisions are set aside by financial institution to cover against expected future loss. Provision amount on the loan increases as the credit quality deteriorates signifying high likelihood of default and thereby mandating more allocation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Provision General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds provision amount. All asset exposures need to be provisioned for to set off any future losses arising out of these exposures. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Readvanceable Exposure Authorized Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the portion of the revolving credit line that is authorized by the regulator to be readvanced. In certain jurisdictions, regulators have strict rules and policies around what can be readvanced for a revolving line. Therefore, the readvanceable authorized exposure amount can potentially differ from the revolving credit limit. Hence, a separate amount field is provided.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Realized Loss Given Default",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the realized loss given default as of extraction date. The realized loss given default is computed by considering outstanding balance at default and offsetting any mitigates offered. List of values are between 0 and 1.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Recalcitrant Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether this account is considered to be a recalcitrant account. A Recalcitrant account is defined as an account that, 1, fails to comply with reasonable requests for information pursuant to IRS mandated verification and due diligence procedures to identify US Accounts,, 2, fails to provide a name, address and taxpayer identification number or, 3, fails to provide a bank secrecy waiver upon request. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Recourse To General Credit Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Refers to the recourse to general credit flag which identifies the liabilities for which creditors do not have the recourse to the general credit of the holding company. The list of values are Y when the creditor has the rights to seize the assets other than the protection pledged and N when the creditor does not have the rights to seize the assets other than the protection pledged .",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Referral Line Of Business Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Line of Business that is responsible to acquiring the account. Line of business, LOB, is a functional unit that offers the products of the financial entity to the customer. Example: Corporate Finance, Trade Services, Private Wealth Management, Treasury Services, Retail Banking, Cards services etc. This column Refers to the unique code of the line of business applicable to the respective product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Refinance Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the loan account has been refinanced . Refinancing is usually done during a falling interest rate environment where a financial institution originates a loan or exposure by paying off the balance outstanding liability of the customer with another financial institution. The list of values are Y or N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Region Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the geographical grouping of the market based on certain common characteristics like language, ethnicity, country, continent, city and state. The region can vary based on the definition of market. Global market vs local market can have different definition of region.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repayer Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the party who is primarily responsible for repayment or securing obligation of a third party using production payment receipts. Most likely this is expected to be obligor.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repayment Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the type of repayment associated with the account. Indicated values are Conventional Fixed, Balloon, Adjustable Negative Amortizing, Rule of 78s, Level Principal, Conventional Adjustable etc. Conventional Amortization  This AMRT_TYPE_CD conventionally amortizes a record whose cash flows are defined in the PAYMENT_SCHEDULE table. Payment amounts should contain both principal + interest. Level Principal Payment Schedule  This AMRT_TYPE_CD level principal amortizes a record whose cash flows are defined in the PAYMENT_SCHEDULE table. Payment amounts should contain principal only. Negative amortization is applicable when the payment amount is not sufficient to cover the interest component of the loan for the period. Rule of 78 loans have a pre computed schedule.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repricing Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to reprice Frequency is used in conjunction with Repricing Frequency Unit to define the frequency of rate change of an account. Repricing Frequency is used to identify whether records are adjustable or not. If Repricing Frequency> 0, the record is considered adjustable. If Reprice Frequency = 0, the record is fixed rate. It is used to compute the re price dates after the next_reprice_date. REPRICE_FREQ must be either 0 or positive.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repricing Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to reprice frequency unit is used in conjunction with Repricing Frequency to store the unit of frequency of rate change for an account. List of values are D, M and Y for Days, Months and Years respectively. Example  if the rate adjustment is 6 months, the repricing frequency will be 6 and repricing frequency unit will be M.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Retention Offer Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of retention offer type. Retention offer type is referred to as a service or payment or reward outside of a regular services provided to the customer that is offered as an incentive to retain a key customer or account. Retention Offer Type Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Revocability Notice Period",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of days provided as notice to party, obligor, to reduce availability of Credit Line in the case of Revocable credit facility.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Revocable Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Revocable Status. The expected values are irrevocable, conditionally revocable etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Revolving Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account is a term or revolving account. Revolving credit is a type of loan or credit that does not have a fixed number of payments. The revolving limit is similar to a credit limit against which a customer can draw funds for financing. Revolving amount is applicable to products like credit cards, revolving loans or line of credit etc. Term products are those products that have pre scheduled payments or maturity. Examples of term products are term loans, term deposits or Certificate of deposit etc. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sales Commission Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the commission amount paid typically to DSAs for sale of a banking product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sales Representative Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the sales representative associated with the account. A product offering of a bank is usually sold via multiple channels. Sales representatives are usually employed to sell certain types of products like insurance policies, mutual funds etc. DIM_SALES_REPRESENTATIVE is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Secured Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account or contract number is secured with a collateral or not. The collaterals to be considered here will be the collaterals other than margins. In case of deposits, this indicates it is Collateralized or Secured Deposit. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securitization Pool Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Unique identifier of the organization defined codes for a securitization pool. Securitize refers to a pooled group of financial assets that together create a new security, which is then marketed and sold to investors. The value and cash flows of the new security are based off of the underlying value and cash flows of the assets used in the securitization process. Companies will securitize illiquid assets into liquid assets in order to increase their overall liquidity and generate immediate proceeds from their assets.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securitization Program Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Unique Code of the Securitization Program Type. This will be used for identifying the overlapping exposures, wherein exposures will be identified based on them belonging to the same program ID. This will be also used in reporting securitization tranches belonging to the same program.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Seniority Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the exposure seniority in the event of bankruptcy of the counterparty. Seniority refers to the order of repayment in the event of a sale or bankruptcy of the issuer. \nSeniority can refer to either debt or preferred stock. Senior debt must be repaid before subordinated, or junior, debt is repaid. Each security, either debt or equity, that a company issues has a specific seniority or ranking. Bonds that have the same seniority in capital structure of a company are described as being pair passu. Preferred stock is senior to common stock in a sale when preferred shareholders must receive back their preference, typically their original investment amount, before the common shareholders receive anything.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Service Representative Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the service representative who is responsible for servicing the account. Service representatives are employees or contractors designated by the bank to service accounts. They are also commonly called as customer service representatives.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Shared National Credit Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the credit participation is part of Shared National Credit Programme. List of values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Shared National Credit Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Internal Credit ID as reported in the Shared National Credit collection.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Stability Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether repayment made by customer has been stable or not. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Standard Business Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the standard business days for settlement. This is useful to determine if the transaction is a long settlement transaction or not. Long Settlement Transactions are transactions where a counterparty undertakes to deliver a security, a commodity, or a foreign exchange amount against cash, other financial instruments, or commodities, or vice versa, at a settlement or delivery date that is contractually specified as more than the lower of the market standard for this particular instrument and five business days after the date on which the bank enters into the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Start Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the contract becomes effective.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Supervisory Beta Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the supervisory scaling parameter, beta. It is set to a value of 1.4. To be consistent with the Revised Framework for credit risk, the EAD for instruments with Counterparty Credit Risk must be determined conservatively and conditionally on a bad state of the economy. To accomplish such conditioning in a practical, pragmatic, and conservative manner, the Internal Model Method and Standardized Method scale Expected Positive Exposure using multipliers, termed alpha and beta, respectively. Both alpha and beta are set at 1.4, but supervisors have the flexibility to raise either parameter in appropriate situations.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Overdue Fee Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total over due fees levied for an account. It excludes the fees due as of date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Participated Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to total committed amount in case of consortium banking arrangement by all the participated institutions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Tranche Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the tranche identifier. A Tranche is a piece, portion or slice of a deal or structured financing. This indicates which for which securitized tranche the particular mitigant covers.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Treatment Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identification code for a treatment. Treatment is defined which is channel specific instance of an offer. Treatment Refers to the message associated with the offer. Treatment dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unconditionally Cancellable Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates if the exposure or claim is unconditionally cancellable or conditionally cancellable, e.g. cancellable upon certain events, or not cancellable. In certain countries, retail commitments are considered unconditionally cancellable if the terms permit the bank to cancel them to the full extent allowable under consumer protection and related legislation. List of values are Y  Unconditionally Cancellable, C  Conditionally Cancellable and N or NULL  Not Cancellable.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Undrawn Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the undrawn amount till date. In case of borrowings, it is computed as Sanctioned Limit  Drawn Amount. In case of cards, it is computed as Sanctioned Limit  EOP Balance. In case of facility it is derived by subtracting the committed amount if any from the facility amount and also by reducing the total amount exposures from the facility amount. In case of commitment contract it is the difference between the committed amount and the drawn or utilized amount in the loan exposures.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Undrawn General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code specific to the undrawn amount of the account. The undrawn amount is the sanctioned amount less the drawn portion of the account. General Ledger Account Dimension is the equivalent dimension table for this.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unlocked Amount For A Home Equity Line Of Credit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Amount of credit line that has been not locked yet. Home Equity Line of Credit might have a Lock out feature, where there may be a portion that has not been locked yet",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Us Indicia Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Flag indicates if the account has US Indicia. US Indicia indicates presence of any of the following: US Citizenship or lawful or permanent resident, US birth place, US address, Instructions to transfer funds to US Accounts or directions regularly received from a US address etc. List of values are Y, N.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [
                {
                    "dqId": "DQCLREF137",
                    "btLogicalName": "Facility Fee Amount",
                    "dqDesc": "Should Be Greater Than Or Equal To 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQCLREF138",
                    "btLogicalName": "Interest Rate",
                    "dqDesc": "Should Be Greater Than or equal to 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQCLREF139",
                    "btLogicalName": "Commitment Fee",
                    "dqDesc": "Should Be Greater Than Or Equal To 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQCLREF140",
                    "btLogicalName": "Effective Interest Rate For Hedge Management",
                    "dqDesc": "Should be greater than 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQCLREF141",
                    "btLogicalName": "Fees For Effective Interest Rate",
                    "dqDesc": "Should Be Greater Than or equal to 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQCLREF142",
                    "btLogicalName": "Amortization Term",
                    "dqDesc": "Should Be Greater Than Or Equal To 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQCLREF143",
                    "btLogicalName": "Loss Given Default Percentage",
                    "dqDesc": "Should be greater than 0 if not null.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQCLREF22",
                    "btLogicalName": "Drawn Amount",
                    "dqDesc": "Should Be Less Than Or Equal To Commitment Amount.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQCLREF23",
                    "btLogicalName": "End Of Period Principal Balance",
                    "dqDesc": "Should be less than or equal to End Of Period Balance",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV33998",
                    "btLogicalName": "Amortization Term Unit",
                    "dqDesc": "Should have list of values as D,M,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV33999",
                    "btLogicalName": "Automatic Cancellation Of Commitment Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34000",
                    "btLogicalName": "Capital Market Exposure Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34001",
                    "btLogicalName": "Claim Foreign Currency And Bank Funding Currency Same Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34002",
                    "btLogicalName": "Compounding Frequency Unit",
                    "dqDesc": "Should have list of values as D,M,W,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34003",
                    "btLogicalName": "Fiduciary Relationship Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34004",
                    "btLogicalName": "Facility Committed Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34005",
                    "btLogicalName": "Guaranteed By Sovereign Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34006",
                    "btLogicalName": "Instruments With Modified Terms And Conditions Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34007",
                    "btLogicalName": "Lead Bank Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34008",
                    "btLogicalName": "Owner Occupied Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34009",
                    "btLogicalName": "Party Interest Rate Discretion Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34010",
                    "btLogicalName": "Recourse To General Credit Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34011",
                    "btLogicalName": "Secured Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34012",
                    "btLogicalName": "Principal Payment Frequency Unit",
                    "dqDesc": "Should have list of values as D,M,W,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34013",
                    "btLogicalName": "Refinance Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34014",
                    "btLogicalName": "Eligible For Intraday Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34015",
                    "btLogicalName": "Loan Term Unit",
                    "dqDesc": "Should have list of values as D,M,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34016",
                    "btLogicalName": "Embedded Options Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34017",
                    "btLogicalName": "Effective Interest Rate Effective Initial Spread Calculation Instruction Flag",
                    "dqDesc": "Should have list of values as A,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34018",
                    "btLogicalName": "Exposure Held At Fair Value Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34019",
                    "btLogicalName": "Facility Held For Planned Use Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34020",
                    "btLogicalName": "Held By Client Or Proprietary Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34021",
                    "btLogicalName": "Loan Negative Amortization Equalization Frequency Multiplier",
                    "dqDesc": "Should have list of values as D,M,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34022",
                    "btLogicalName": "Market Disruption Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34023",
                    "btLogicalName": "Materiality Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34024",
                    "btLogicalName": "Recalcitrant Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34025",
                    "btLogicalName": "Power Of Attorney Or Signatory Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34026",
                    "btLogicalName": "Repricing Frequency Unit",
                    "dqDesc": "Should have list of values as D,M,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34027",
                    "btLogicalName": "Committed Refund Amount Fee Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34028",
                    "btLogicalName": "Correspondent Relationship Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34029",
                    "btLogicalName": "International Banking Facility Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34030",
                    "btLogicalName": "Unconditionally Cancellable Indicator",
                    "dqDesc": "Should have list of values as C,N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34031",
                    "btLogicalName": "Exposure Defaulted Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34032",
                    "btLogicalName": "Revolving Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34033",
                    "btLogicalName": "Past Due Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34034",
                    "btLogicalName": "Commitment Term Unit",
                    "dqDesc": "Should have list of values as D,M,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34035",
                    "btLogicalName": "Discretion To Reprice Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34036",
                    "btLogicalName": "Interest Payment Frequency Unit",
                    "dqDesc": "Should have list of values as D,M,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34037",
                    "btLogicalName": "Payment Change Frequency Unit",
                    "dqDesc": "Should have list of values as D,M,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34038",
                    "btLogicalName": "Us Indicia Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34039",
                    "btLogicalName": "Participation Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34040",
                    "btLogicalName": "Stability Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34041",
                    "btLogicalName": "Account Under Enforcement Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34042",
                    "btLogicalName": "Available For Sale Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34043",
                    "btLogicalName": "Commit To Commit Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34044",
                    "btLogicalName": "Employee Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQLOV34045",
                    "btLogicalName": "Shared National Credit Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQMNDTR259",
                    "btLogicalName": "Adjustment Effective Date",
                    "dqDesc": "Mandatory when Interest Rate Type equals Other Adjustable",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQMNDTR35",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQMNDTR36",
                    "btLogicalName": "Current Interest Rate",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQMNDTR37",
                    "btLogicalName": "Account Close Date",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQMNDTR38",
                    "btLogicalName": "End Of Period Balance",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQMNDTR39",
                    "btLogicalName": "Effective Date",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40930",
                    "btLogicalName": "Account Close Date",
                    "dqDesc": "Reference Check for Account Close Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40931",
                    "btLogicalName": "Account Close Date",
                    "dqDesc": "Reference Check for Account Close Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40932",
                    "btLogicalName": "Account Status Date",
                    "dqDesc": "Reference Check for Account Status Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40933",
                    "btLogicalName": "Account Status Date",
                    "dqDesc": "Reference Check for Account Status Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40934",
                    "btLogicalName": "Adjustment Effective Date",
                    "dqDesc": "Reference Check for Adjustment Effective Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40935",
                    "btLogicalName": "Adjustment Effective Date",
                    "dqDesc": "Reference Check for Adjustment Effective Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40936",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40937",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40938",
                    "btLogicalName": "Contractual Change Date",
                    "dqDesc": "Reference Check for Contractual Change Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40939",
                    "btLogicalName": "Contractual Change Date",
                    "dqDesc": "Reference Check for Contractual Change Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40940",
                    "btLogicalName": "Credit Status Date",
                    "dqDesc": "Reference Check for Credit Status Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40941",
                    "btLogicalName": "Credit Status Date",
                    "dqDesc": "Reference Check for Credit Status Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40942",
                    "btLogicalName": "Effective Maturity Date",
                    "dqDesc": "Reference Check for Effective Maturity Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40943",
                    "btLogicalName": "Effective Maturity Date",
                    "dqDesc": "Reference Check for Effective Maturity Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40944",
                    "btLogicalName": "Effective Date",
                    "dqDesc": "Reference Check for Effective Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40945",
                    "btLogicalName": "Effective Date",
                    "dqDesc": "Reference Check for Effective Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40946",
                    "btLogicalName": "Forbearance And Renegotiation Status Date",
                    "dqDesc": "Reference Check for Forbearance And Renegotiation Status Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40947",
                    "btLogicalName": "Forbearance And Renegotiation Status Date",
                    "dqDesc": "Reference Check for Forbearance And Renegotiation Status Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40948",
                    "btLogicalName": "Last Principal Payment Date",
                    "dqDesc": "Reference Check for Last Principal Payment Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40949",
                    "btLogicalName": "Last Principal Payment Date",
                    "dqDesc": "Reference Check for Last Principal Payment Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40950",
                    "btLogicalName": "Last Reprice Date",
                    "dqDesc": "Reference Check for Last Reprice Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40951",
                    "btLogicalName": "Last Reprice Date",
                    "dqDesc": "Reference Check for Last Reprice Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40952",
                    "btLogicalName": "Negative Amortization Equalization Date",
                    "dqDesc": "Reference Check for Negative Amortization Equalization Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40953",
                    "btLogicalName": "Negative Amortization Equalization Date",
                    "dqDesc": "Reference Check for Negative Amortization Equalization Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40954",
                    "btLogicalName": "Payment Adjustment Date",
                    "dqDesc": "Reference Check for Payment Adjustment Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40955",
                    "btLogicalName": "Payment Adjustment Date",
                    "dqDesc": "Reference Check for Payment Adjustment Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40956",
                    "btLogicalName": "Maturity Date",
                    "dqDesc": "Reference Check for Maturity Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40957",
                    "btLogicalName": "Maturity Date",
                    "dqDesc": "Reference Check for Maturity Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40958",
                    "btLogicalName": "Next Principal Payment Date",
                    "dqDesc": "Reference Check for Next Principal Payment Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40959",
                    "btLogicalName": "Next Principal Payment Date",
                    "dqDesc": "Reference Check for Next Principal Payment Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40960",
                    "btLogicalName": "Original Maturity Date",
                    "dqDesc": "Reference Check for Original Maturity Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40961",
                    "btLogicalName": "Original Maturity Date",
                    "dqDesc": "Reference Check for Original Maturity Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40962",
                    "btLogicalName": "Original Next Payment Date",
                    "dqDesc": "Reference Check for Original Next Payment Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40963",
                    "btLogicalName": "Original Next Payment Date",
                    "dqDesc": "Reference Check for Original Next Payment Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40964",
                    "btLogicalName": "Original Principal Payment Date",
                    "dqDesc": "Reference Check for Original Principal Payment Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40965",
                    "btLogicalName": "Original Principal Payment Date",
                    "dqDesc": "Reference Check for Original Principal Payment Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40966",
                    "btLogicalName": "Past Due Date",
                    "dqDesc": "Reference Check for Past Due Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40967",
                    "btLogicalName": "Past Due Date",
                    "dqDesc": "Reference Check for Past Due Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40968",
                    "btLogicalName": "Start Date",
                    "dqDesc": "Reference Check for Start Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40969",
                    "btLogicalName": "Start Date",
                    "dqDesc": "Reference Check for Start Date in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40970",
                    "btLogicalName": "Account Classification Code",
                    "dqDesc": "Reference Check for Account Classification Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40971",
                    "btLogicalName": "Account Manager Code",
                    "dqDesc": "Reference Check for Account Manager Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40972",
                    "btLogicalName": "Account Purpose Code",
                    "dqDesc": "Reference Check for Account Purpose Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40973",
                    "btLogicalName": "Account Type",
                    "dqDesc": "Reference Check for Account Type in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40974",
                    "btLogicalName": "Account Status Code",
                    "dqDesc": "Reference Check for Account Status Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40975",
                    "btLogicalName": "Accounting Standard Code",
                    "dqDesc": "Reference Check for Accounting Standard Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40976",
                    "btLogicalName": "Adjustment Type",
                    "dqDesc": "Reference Check for Adjustment Type in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40977",
                    "btLogicalName": "Application Number",
                    "dqDesc": "Reference Check for Application Number in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40978",
                    "btLogicalName": "Attrition Reason Code",
                    "dqDesc": "Reference Check for Attrition Reason Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40979",
                    "btLogicalName": "Bank Base Role Identifier",
                    "dqDesc": "Reference Check for Bank Base Role Identifier in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40980",
                    "btLogicalName": "Bank Code",
                    "dqDesc": "Reference Check for Bank Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40981",
                    "btLogicalName": "Behavior Type",
                    "dqDesc": "Reference Check for Behavior Type in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40982",
                    "btLogicalName": "Benchmark Index Currency Code",
                    "dqDesc": "Reference Check for Benchmark Index Currency Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40983",
                    "btLogicalName": "Branch Code",
                    "dqDesc": "Reference Check for Branch Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40984",
                    "btLogicalName": "Business Unit Code",
                    "dqDesc": "Reference Check for Business Unit Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40985",
                    "btLogicalName": "Campaign Identifier",
                    "dqDesc": "Reference Check for Campaign Identifier in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40986",
                    "btLogicalName": "Channel Code",
                    "dqDesc": "Reference Check for Channel Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40987",
                    "btLogicalName": "ISO Currency Code",
                    "dqDesc": "Reference Check for ISO Currency Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40988",
                    "btLogicalName": "Commission General Ledger Code",
                    "dqDesc": "Reference Check for Commission General Ledger Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40989",
                    "btLogicalName": "Common Chart Of Account Code",
                    "dqDesc": "Reference Check for Common Chart Of Account Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40990",
                    "btLogicalName": "Construction Loan Type",
                    "dqDesc": "Reference Check for Construction Loan Type in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40991",
                    "btLogicalName": "Account Or Contract Number",
                    "dqDesc": "Reference Check for Account Or Contract Number in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40992",
                    "btLogicalName": "Country Code",
                    "dqDesc": "Reference Check for Country Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40993",
                    "btLogicalName": "Country Code Of Risk",
                    "dqDesc": "Reference Check for Country Code Of Risk in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40994",
                    "btLogicalName": "Credit Participation Type",
                    "dqDesc": "Reference Check for Credit Participation Type in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40995",
                    "btLogicalName": "Credit Status Code",
                    "dqDesc": "Reference Check for Credit Status Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40996",
                    "btLogicalName": "Data Source Code",
                    "dqDesc": "Reference Check for Data Source Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40997",
                    "btLogicalName": "Day Count Indicator",
                    "dqDesc": "Reference Check for Day Count Indicator in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40998",
                    "btLogicalName": "Delinquency Status Code",
                    "dqDesc": "Reference Check for Delinquency Status Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF40999",
                    "btLogicalName": "Fee General Ledger Code",
                    "dqDesc": "Reference Check for Fee General Ledger Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41000",
                    "btLogicalName": "Forbearance Status Code",
                    "dqDesc": "Reference Check for Forbearance Status Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41001",
                    "btLogicalName": "General Ledger Account Code",
                    "dqDesc": "Reference Check for General Ledger Account Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41002",
                    "btLogicalName": "Guarantor Identifier",
                    "dqDesc": "Reference Check for Guarantor Identifier in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41003",
                    "btLogicalName": "Holiday Rolling Convention Code",
                    "dqDesc": "Reference Check for Holiday Rolling Convention Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41004",
                    "btLogicalName": "Industry Code",
                    "dqDesc": "Reference Check for Industry Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41005",
                    "btLogicalName": "Instrument Type",
                    "dqDesc": "Reference Check for Instrument Type in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41006",
                    "btLogicalName": "Interest Calculation Method",
                    "dqDesc": "Reference Check for Interest Calculation Method in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41007",
                    "btLogicalName": "Interest Payment Type",
                    "dqDesc": "Reference Check for Interest Payment Type in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41008",
                    "btLogicalName": "Interest Rate Code",
                    "dqDesc": "Reference Check for Interest Rate Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41009",
                    "btLogicalName": "Interest Rate Type",
                    "dqDesc": "Reference Check for Interest Rate Type in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41010",
                    "btLogicalName": "Legal Entity Code",
                    "dqDesc": "Reference Check for Legal Entity Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41011",
                    "btLogicalName": "Lien Position",
                    "dqDesc": "Reference Check for Lien Position in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41012",
                    "btLogicalName": "Line Code",
                    "dqDesc": "Reference Check for Line Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41013",
                    "btLogicalName": "Line Of Business Code",
                    "dqDesc": "Reference Check for Line Of Business Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41014",
                    "btLogicalName": "Location Code",
                    "dqDesc": "Reference Check for Location Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41015",
                    "btLogicalName": "Offer Code",
                    "dqDesc": "Reference Check for Offer Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41016",
                    "btLogicalName": "Organization Unit Code",
                    "dqDesc": "Reference Check for Organization Unit Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41017",
                    "btLogicalName": "Original Account Number",
                    "dqDesc": "Reference Check for Original Account Number in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41018",
                    "btLogicalName": "Parent Account Number",
                    "dqDesc": "Reference Check for Parent Account Number in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41019",
                    "btLogicalName": "Party Identifier",
                    "dqDesc": "Reference Check for Party Identifier in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41020",
                    "btLogicalName": "Product Code",
                    "dqDesc": "Reference Check for Product Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41021",
                    "btLogicalName": "Property Type",
                    "dqDesc": "Reference Check for Property Type in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41022",
                    "btLogicalName": "Provision General Ledger Code",
                    "dqDesc": "Reference Check for Provision General Ledger Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41023",
                    "btLogicalName": "Referral Line Of Business Code",
                    "dqDesc": "Reference Check for Referral Line Of Business Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41024",
                    "btLogicalName": "Region Code",
                    "dqDesc": "Reference Check for Region Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41025",
                    "btLogicalName": "Repayer Identifier",
                    "dqDesc": "Reference Check for Repayer Identifier in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41026",
                    "btLogicalName": "Repayment Type",
                    "dqDesc": "Reference Check for Repayment Type in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41027",
                    "btLogicalName": "Retention Offer Type",
                    "dqDesc": "Reference Check for Retention Offer Type in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41028",
                    "btLogicalName": "Revocable Status Code",
                    "dqDesc": "Reference Check for Revocable Status Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41029",
                    "btLogicalName": "Sales Representative Identifier",
                    "dqDesc": "Reference Check for Sales Representative Identifier in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41030",
                    "btLogicalName": "Securitization Pool Identifier",
                    "dqDesc": "Reference Check for Securitization Pool Identifier in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41031",
                    "btLogicalName": "Securitization Program Identifier",
                    "dqDesc": "Reference Check for Securitization Program Identifier in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41032",
                    "btLogicalName": "Seniority Code",
                    "dqDesc": "Reference Check for Seniority Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41033",
                    "btLogicalName": "Service Representative Identifier",
                    "dqDesc": "Reference Check for Service Representative Identifier in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41034",
                    "btLogicalName": "Shared National Credit Identifier",
                    "dqDesc": "Reference Check for Shared National Credit Identifier in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41035",
                    "btLogicalName": "Tranche Identifier",
                    "dqDesc": "Reference Check for Tranche Identifier in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41036",
                    "btLogicalName": "Treatment Code",
                    "dqDesc": "Reference Check for Treatment Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                },
                {
                    "dqId": "DQREF41037",
                    "btLogicalName": "Undrawn General Ledger Code",
                    "dqDesc": "Reference Check for Undrawn General Ledger Code in Stage Commitment Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:32.0",
                    "modifiedDate": "2024-11-04 04:39:36.0"
                }
            ],
            "useCases": [
                {
                    "ucId": "ALM",
                    "ucName": "Asset Liability Management"
                },
                {
                    "ucId": "LLFP",
                    "ucName": "Oracle Loan Loss Forecasting and Provisioning"
                },
                {
                    "ucId": "LRM",
                    "ucName": "Liquidity Risk Management"
                },
                {
                    "ucId": "BASEL",
                    "ucName": "Regulatory Capital Adequency"
                },
                {
                    "ucId": "BSP",
                    "ucName": "Balance Sheet Planning"
                },
                {
                    "ucId": "CIRCA",
                    "ucName": "Customer Analytics"
                },
                {
                    "ucId": "FTP",
                    "ucName": "Funds Transfer Pricing"
                },
                {
                    "ucId": "PFT",
                    "ucName": "Profitability Management"
                }
            ]
        }
    ]
}