{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "As Of Date",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Card Lending Type",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique reference to the credit card type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Card Lending Type Description",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description",
                    "gcd": "Refers to the credit card type description. Credit Card Lending Type Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Card Lending Type Numeric Identifier",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "SurrogateKey_Long",
                    "gcd": "Refers to the equivalent numeric identifier of the Credit Card Lending Type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Card Lending Type Regulatory Display Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the display codes to be used in regulatory report submissions for Credit Card Lending Type. The values seeded are 1. Consumer Bank Card  Regular general purpose credit cards that can be used at a wide variety of merchants, including any who accept MasterCard, Visa, American Express or Discover credit cards. Include affinity and co brand cards in this category, and student cards if applicable. This product type also includes private label or propriety credit cards, which are tied to the retailer issuing the card and can only be used in that stores of retailer. Include oil and gas cards in this loan type, and student cards if applicable. 2. Consumer Charge Card  Consumer credit cards for which the balance is repaid in full in each billing cycle. 3. Non Consumer Card  Include small business credit card accounts where the loan is underwritten with the sole proprietor or primary business owner as applicant. Also report Corporate Card Employer sponsored credit cards for use by employees of company. 4. Non Consumer Charge Card – Small business credit card or corporate credit card for which the balance is repaid in full in each billing cycle.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source system from where data is extracted. Data can be sourced from multiple sources, this column will Refers to the source code from where the data is extracted for this extraction date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Dimension Value Closed Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the given dimension value record has been disabled or expired. The list of values includes Y- Indicates that the dimension value has been disabled, N- Indicates that the dimension value is not disabled and is still active.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Seeded Record Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "It Indicates if dimension record is seeded by product or not. The SCD component would not overwrite the record if it is set to 'Y'.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [],
            "useCases": []
        }
    ]
}