{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "Account Close Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the account is closed. Account can be an active or closed, this column will remain blank till account is active. Accounts can be closed upon maturity, transfer or death of a customer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Or Contract Number",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of the account or contract held by the customer. Account number is defined as numbers, letters or alphanumeric code assigned to every significant customer, supplier and lender for ease of reference in accounting records of the financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Settlement Delinquency Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to settlement amount past due balance. This is applicable for any payment settlement involved for said account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the status of the account. List of values can be Active, Inactive, in foreclosure, Re negotiated, Dispute, Frozen, Past Due, Closed etc. Account Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Sub Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Account Sub Type Code that is sub classified as per the banking source system for their internal operational purpose.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Account Type Code that is classified as per the banking source system for their internal operational purpose. \nIn case of ALM FTP applications, Account type are fixed set of values.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accounting Standard Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the accounting standard or the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. E.g. GAAP, IFRS etc. Generally Accepted Accounting Principles, GAAP. GAAP are the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. The Generally Accepted Accounting Principles exist to ensure that accountants are using the same or almost the same standards so that comparison of financial statements between or within a company is easy and accurate. They also promote transparency in accounting. However, GAAP provides broad guidelines, there is room for companies to follow an approach within a guideline.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accrual Resets On",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to when the accrued interest is reset to zero, it identifies the end of the period for the purpose of calculating accrued interest. \nFor END DATE, the interest accrues until the day before the end of the accrual period. On that day, the interest equals one days interest less than the full payment. Then on the accrual end date, the accrued interest resets to zero, whether or not the payment has been made. When END DATE is chosen, the clean price is not necessarily a smooth function of time.\n\nFor PAYMENT DATE, if the payment is part of the dirty price on the value date, then the accrued interest will include the full amount of that payment, and possibly more, on the value date. If the payment on the value date is not part of the dirty price, then the accrued interest on the value date will not include the payment. If there is a payment lag, the accrued interest on the payment date may be larger than the payment amount because there will also be an accrued amount over the current accrual period.\n\nPossible values are  END DATE, Accrued interest for the period resets to zero on the accrual end date, and PAYMENT DATE, Default, accrued interest for the period resets to zero when the payment is no longer included in the dirty price.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accural Start Lag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to accrual Start lag is the lag period between fixing date and accrual start date of instrument like Commodity Swaption, total return swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accural Start Lag Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Indicates the unit for Accrual Start lag, possible values are D, for days, BD, for business days, W, for Weeks, M, for month, y, for Year. OR Alternatively user can also provide A, for Annual, SA, for Semiannual, Q, for Quarterly, M, for Monthly.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Acquisition Channel Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the channel through which customer was acquired.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjusted Loss Given Default Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the Adjusted LGD for an exposure and mainly used for Internal Model Method to arrive at RWA. This is expressed in decimal number, For example, 30 percent will be 0.3.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjustment Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier for adjustment type dimension at an account. Examples can be CONTRA,NEW etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Agency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the agency code that describes the type of the Issuing Agency . List of values are NON  Non Agency, FNMA_  Fannie Mae, FNMA_GNMA  Fannie Mae or Ginnie Mae, FRED_75  Freddie Mac 75, FRED_GOLD  Freddie Mac Gold, FRED_GNMA  Freddie Mac or Ginnie Mae, GNMA_  Ginnie Mae, NONAGENCY_SUBPRIME  Non Agency Subprime, NONAGENCY_PRIME  Non Agency Prime, NONAGENCY_OTHER  Non Agency Other.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Agreement Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the mitigant or collateral value covers the entire end of period balance and not the partial amount. End of period balance includes Principal + accrued interest, All the calculations such as interest, prepayment amounts etc. are based on end of period balance amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amount Due In Next Twelve Months",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Amount Due In Next 12 Months.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "As Of Date",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Banks Own Estimate Of Credit Conversion Factor Percent",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the Credit Conversion Factor percent estimate by the bank. This is applicable only to the off balance amount or products and not to the bills contracts. Using this weight as factor, Risk weighted Assets are calculated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Benchmark Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code of the benchmark code associated with the floating rate instrument. The floating rate loans have a benchmark interest rate such as London Inter bank Offer Rate ,LIBOR,, Euro Interbank Offered Rate ,EURIBOR, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Benchmark Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the unique code associated with the benchmark currency. Benchmark currency is the currency associated with a benchmark such as LIBOR. Currency Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Book Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to if the contract is related to the banking book or trading book. Usually contracts like loans and leases are on the banking book. However, instruments like mortgage backed securities can be held on the trading book of the financial institution. If the value is updated as T then exposure or contract belongs to trading book and if the value is updated as B then it belongs to banking book.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Branch Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the branch code. A branch, banking center or financial center is a retail location where a financial institution offers a wide array of face to face and automated services to its customers. This column Refers to the unique branch code assigned by the financial institution. A branch may specialize to offer certain type of products to customers. Branch needs approval from the regulators.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Brokerage Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicate if the account is maintained for brokerage purpose.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Segment Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique key identifying the business segment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Unit Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the business unit code as defined by the organization. A business unit is generally a broader definition and represents all the units in an organization. Business Unit dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Buy Or Sell Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates if the contract holder is the buyer or seller of the contract. This is applicable in case of derivative contracts like futures, forwards, options etc. A Buyer of a futures contract is said to be long while the seller is said to be short. In case of repo transactions, the party doing the reverse repo is referred to as the buyer. The seller of securities sells to the party with an agreement to buy back at a later date. List of Values are B, Buy, and S, Sell.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Capital Charge Exclusion Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the exposure will be excluded from the capital calculations.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Central Counterparty Acceptance Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if central counterparty expects only cash as Variation margin.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Central Counterparty Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the central counterparty code which clears the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cleared Transaction Bank Role Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of the cleared transaction role of the reporting bank. Cleared Transaction Bank Role dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cleared Transaction Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag Identifies if the transaction is cleared through central counterparty. Transactions included are, 1, between the clearing member and clearing member client and, 2, clearing member and central counterparty.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Clearing Member Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the identifier Refers to the code of the Clearing member through which the CCP clears the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Complementary Identification Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Complementary Identification Code. CIC Code is EIOPA Code used to classify securities. First two Positions of the CIC code are 'ISO 3166 1 alpha 2 country code or XL, for not listed, or XT, for not exchange tradable,', Position 3 and 4 are specified in Standard Product Type dimension table.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Quantity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the contract quantity associated with the contract. One contract of a derivative like forwards can have multiple quantity associated with it.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Unwinding Trigger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code identifying the type of event that causes unwinding of the contract. Possible options are:, B,bankruptcy of the underlying or reference entity,F,adverse fall in value of the underlying reference asset,, R,adverse change in credit rating of the underlying assets or entity,, O,other events.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Unwinding Trigger Loss Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if notional loss is arising out of unwinding of trigger then end user is expected to populate this indicator as Y.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Counterparty Rating",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code representing the Counter Party Rating of the Instrument in this record.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Country Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the country code associated with the account or instrument or party or location. There are several popular country codes as part of ISO 3166 standard published by the International Organization for Standardization. ISO 3166 defines codes for the names of countries, dependent territories, special areas of geographical interest and their principal subdivisions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Country Code Of Risk",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the ISO country code of the risk. Country of risk refers to the country wherein the counter party does business. Dim Country is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Default Swap Recovery Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the recovery rate of the credit default swap contract, bond. It denotes the percentage of notional that is expected to be recovered in case the reference entity, ex. issuer of bond, defaults. It must be expressed in decimal form. Example  if recovery rate is 40 Percent then 0.40 is expected here.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Derivative Settlement Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of settlement for credit derivative products. List of values are CSH  Cash, PHY Physical, FIX etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the current performance status of the account. List of values are Delinquent, Foreclosed, Impaired, Closed, Disposed, Transferred, Bankrupt etc. Credit Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Write Off Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount written off once the loan or receivable has turned bad. This is done when no recovery is possible and the due date of repayment has elapsed a while ago. The write off amount is for the current period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Daily Receipt Payment Cash Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Indicates if the instrument is subject to daily receipt and payment of cash variation. This is applicable in case of margin accounts and contracts with margin requirements. Margin requirements are common in case of exchange traded derivatives that are marked to market on a daily basis.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source system from where data is extracted. Data can be sourced from multiple sources, this column will Refers to the source code from where the data is extracted for this extraction date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Day Count Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the day count indicator. Expected values are A/360, A/365, A/A, 30/360, 30/360 EUROPEAN, 30/A. Suggested default value are 1=30/360 for amortizing transactions OR 3=Act/Act. for non amortization.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Deal Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to unique identifier of the different legs of a same deal. For example In cleared transaction contracts where the one transaction is between clearing member and client i.e. Leg 1 and the other between clearing member and the CCP i.e. Leg 2. Leg 1 and Leg 2 are expected to have the same information D1 as deal id.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Debt Seniority Level Name",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to type of debt which is the underlying of a credit default swap or survival probabilities. It represents the seniority level of the debts and possible values can be JRSUBUT2, Junior Subordinated or Upper Tier 2 Debt, Banks, PREFT1, Preference Shares, or Tier 1 Capital, Banks, SECDOM, Secured Debt, Corporate or Financial, or Domestic Currency Sovereign Debt, Government, SNRFOR, Senior Unsecured Debt, Corporate or Financial, Foreign Currency Sovereign Debt, Government, SUBLT2, Subordinated or Lower Tier 2 Debt, Banks, or others as per market convention. Column is applicable for instruments like Equity convertible bond.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Debt Value Adjustments",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to DVA which is all unrealized gains and losses that have resulted from changes in the fair value of liabilities that are due to changes in own credit risk of the bank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Default Correlation",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the default correlation between the obligors in a Credit Default Obligation. The correlation factors determines the relative likelihood of default among the different obligors of a Credit Default Obligations, CDO.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Defaulted Position",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the defaulted position of the exposure, covered by the credit derivative. For example, 1st to default Credit Derivative, 2nd to default credit derivative.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delinquency Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Captures the unique identifier of delinquency status. Indicative values are Charge off, Redeemed, Doubtful, Bad Debt, Sub Standard, Non Performing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delivery Versus Payment Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if it is a DvP, Delivery Versus Payment, or RvP, Receive Versus Payment, trade or not. Delivery versus payment, DVP, is a settlement system that stipulates that cash payment must be made prior to or simultaneously with the delivery of the security. Delivery versus payment is from the perspective of buyer and from the perspective of seller, this system is called receive versus payment, RVP. For DvP transactions, if the payments have not yet taken place five business days after the settlement date, firms must calculate a capital charge by multiplying the positive current exposure of the transaction by the appropriate factor, according to a Table given by Basel. List of values are Y, N. Y indicates it is a DVP.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Dilution Risk Mitigant Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicate whether the mitigant is for dilution risk or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discount Day Count Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Business day counter for discounting. The possible values are Actual/360, Actual/365, Fixed, Actual/Actual, Business/252, Thirty/360.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Double Default Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure has a double default. Double default is explained as a case where both the obligor and the guarantor defaults. The CRM treatment is different for exposures which comes under the double default category.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Earliest Date Of Unpaid Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Earliest date when the overdue amount become unpaid. This date is used to calculate the days past due and based on days past due, bank can arrive at accrual status of the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the effective date of the account or contract or interest rate or exchange rate from which it is effective.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Exposure Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the effective expected exposure amount at a specific date is the maximum expected exposure that occurs at that date or any prior date. Alternatively, it may be defined for a specific date as the greater of the expected exposure at that date, or the effective exposure at the previous date. In effect, the Effective Expected Exposure is the Expected Exposure that is constrained to be non decreasing over time.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Maturity Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the effective maturity date of the contract. Effective maturity takes into account that certain instruments like bonds have a callable feature which can likely shorten the maturity of these instruments.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Notional Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the effective notional amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Eligible Mutual Fund Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the equity is part of mutual fund or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Eligible Non Main Index Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the contract is part of an eligible non main index.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Embedded Option Type Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates as S if the embedded option is separated form host contract and as N if it is non separated. List of Values are S and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Embedded Options Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the security has an embedded option within it. Embedded option refers to a provision in a security that is an inseparable part of the instrument. An embedded option is a special condition attached to a security, and in particular, a bond that gives the holder or the issuer the right to perform a specified action at some point in the future. An embedded option is part of another security, and as such does not trade by itself. Nevertheless, it can affect the value of the security of which it is a component. A security is not limited to one embedded option, as there may be several embedded options in one security.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Month Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the last payment of the instrument is on month end or not. List of values are Y, N. Alternatively it indicate the end of a calendar month.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to end of period balance which includes accrued interest. All the calculations such as interest, prepayment amounts etc. are based on this amount. This is used in all the calculations performed by cash flow engine. In Case of LC Contracts, EOP Balance should be populated when LC Is executed. Till LC is executed, LC amount sanctioned should be hold in Total Commitment Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the end of period book balance. It is the sum of total of End of Period Balance Plus Deferred Balance. This is used while calculating amortization. The book balance is the term financial institutions use to describe the amount of money available before any adjustments have been made for deposits in transit, checks that have not yet been cleared, reserve requirements and interest received from 'float funds' hence is generally greater than end of period balance, Also called as 'gross balance'. It also excludes any deferred balance that is unamortized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Execution Date Payment Included In Dirty Price Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the payment on the VALUE DATE, captured as effective date, is included in the dirty price for the purpose of calculating accrued interest. Possible values are Y, Includes Value Date, and N, Excludes Value Date. Column is applicable for instruments like Cap Floor. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Expected Loss Best Estimate Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the best estimate of expected loss. This is applicable to exposures which have already defaulted. This is useful when financial institutions use their own estimates of Loss given default.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure At Default Post Mitigation",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the exposure at default amount post mitigation by all eligible mitigants\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure At Default Pre Mitigation",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the pre mitigation Exposure at default amount of the total exposure, as applicable to the particular jurisdiction. This is generally equal to the sum of Exposure of default pre mitigation for the drawn portion of the exposure and the exposure of default per mitigation for the undrawn portion of the exposure.\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "External Customer Branch International Banking Facility Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the Non related Customer branch is an International Banking Facility,IBF, or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Failed Business Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of business days delayed after the agreed settlement date. This is applicable for failed trades. There are different guidelines for capital treatment of failed trades. European standards are dictated at directive level and permit a 5 business day grace period after settlement date on delivery versus payment, DvP, transactions before any charges are imposed at which point they are subject to charges on the exposure. These increase to 100 percent after 46 days. Settlement date is not defined or subject to specific limitations. For non DvP transactions, the charge starts immediately, with a one day grace period for cross border transactions, at a flat eight percent risk weighting of the exposure to the counterparty. US banking regulators take a balance sheet approach, under which a standard risk weight, usually 100 percent but in some cases 20 percent, is applied to the full notional amount of trades that have failed to settle without a grace period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Failed Trade Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the trade is a failed trade. Failed trades are trades that have occurred but not have settled. There are different guidelines for capital treatment of failed trades. European standards are dictated at directive level and permit a 5 business day grace period after settlement date on delivery versus payment, DvP, transactions before any charges are imposed at which point they are subject to charges on the exposure. These increase to 100 percent after 46 days. Settlement date is not defined or subject to specific limitations. For non DvP transactions, the charge starts immediately, with a one day grace period for cross border transactions, at a flat eight percent risk weighting of the exposure to the counterparty. US banking regulators take a balance sheet approach, under which a standard risk weight, usually 100 percent but in some cases 20 percent, is applied to the full notional amount of trades that have failed to settle without a grace period. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fair Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to fair value of an asset. Fair Value is a rational and unbiased estimate of the potential market price of and asset. The Financial Accounting Standards Board, FASB, issued 'Statement of Financial Accounting Standards No. 157: Fair Value Measurements, FAS 157,' in September 2006 to provide guidance about how entities should determine fair value estimations for financial reporting purposes.\n\nFair value is however measured based on the guidelines FASB 13 which has 3 levels.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fiduciary Parent Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the parent fiduciary account number of the account. In the case of fiduciary asset like retiral plans, the bank will store the retiral benefit specific plans, as the parent number of the account, and the retiral benefit higher level as the parent fiduciary account ID. This will be the ultimate parent number of the fiduciary assets. Providing this information indicates that this asset has been invested by the parent fiduciary account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fiduciary Relationship Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account is held with the bank under a fiduciary capacity. Fiduciary capacity means trustee, executor, administrator, registrar of stocks and bonds, transfer agent, guardian, assignee, receiver, or custodian under a uniform gifts to minors act investment adviser, if the bank receives a fee for its investment advice any capacity in which the bank possesses investment discretion on behalf of another or any other similar capacity that the regulator authorizes. For example deposits that are placed with a bank by a national bank for which the bank is a fiduciary.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Financial Market Quote Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to financial market Quote type code. Market data for given financial quote type will be used for calculation. Possible inputs: MID, BID, ASK or LST. Instrument Used:CommodityForward.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Floating Rate Spread",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "The column stores the spread or margin that is added, in case of asset it will be a positive spread and for liability it will be a negative spread, to the benchmark floating rate for all adjustable rate instruments, this is the rate that is offered to the customer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Front Stub Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if instrument is having irregular time period at the beginning, Front, or end, Back, of the contract. List of Values are Y and N. Select Y for First irregular Payment, include front, or N Last irregular Payment, not including front, of contract. If there are no irregular payment leave column blank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fund Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code identifying the fund. Fund dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fund Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code identifying the fund type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "General Ledger Account Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique general ledger account code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Guarantor Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the identifier of the Party who guaranteed the program.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Hedge Portfolio Set Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique hedge portfolio set code or Hedge identification number, hedge ID, under which this account is covered.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Held By Client Or Proprietary Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the account is held by client or not. If the value is updated as Y which means the security is held by client and if the value is updated as N which means the security is in the proprietary account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holding Period For Haircut",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the holding period in days to arrive at the base volatility haircut of an exposure. The standard supervisory haircuts, are based on an assumed 10 business day minimum holding period for derivatives and eligible margin loans.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holding Period In Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the holding period in days to arrive at the base volatility haircut of an exposure. The standard supervisory haircuts, are based on an assumed 10 business day minimum holding period for derivatives and eligible margin loans.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holding Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holding intent of the account. Holding Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holiday Rolling Convention Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holiday rolling convention code, based on which the date on which cash flow has to happen is decided. This includes  Following business day, Modified following business day, Previous business day, Modified previous business day etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "IFSB Contract Type Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Islamic Financial Services Board classification of the instrument. This is applicable in case of Islamic finance products. Examples, include Murabahah, Musharakah, Sukuk, etc. Ifsb Contract Type Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "ISO Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Illiquid Derivatives Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the derivative is easily liquid table or easily replaceable or an exotic derivative. List of values are Y  It is not easily replaceable or easily liquid table, N  It is easily replaceable or easily liquid table. It is required for regulatory capital processing. Based on this flag and other parameters supervisory haircut is adjusted on the basis of a holding period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Incurred Credit Value Adjustment Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Incurred CVA Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Indemnification Asset Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to indemnification amount of the asset arising from loss sharing agreement. Indemnificationis the part of an agreement that provides for one party to bear the monetary costs, either directly or by reimbursement, for losses incurred by a second party.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to a unique Code representing a particular Instrument. This code can be ISIN Code, CUSIP, SEDOL etc. Instrument Contract dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Description",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the description of the Instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Net Present Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the end of the day Net Present value of the instrument. This will be a download in case of exchange traded instruments and will be priced using Quantlib pricing Engines in case of OTC instruments. Price at which this trade was executed, expressed in issuing currency. Value is to be expressed in the issuing currency of the associated security. Also indicates the price of the instrument on its primary market.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of instrument type, which is defined as code identifying the instrument category of the customer account. Instrument Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the interest rate code that identifies the index to which adjustable rate accounts are tied. Transfer Pricing references interest rate code when calculating option costs and uses the relevant interest rate from the defined interest rate code, IRC, together with the margin to determine the reprice rate for the instrument. The value populated in this column for each account record must be synchronized with the actual interest rate code values defined in Transfer Pricing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code Tenor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Stored the underlying IR index tenor used in instrument. Incase of Fx Forward Instrument this is used as IR index tenor for term currency.\nInstrument Used:AmortizingFRN.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code Tenor Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unit of underlying IR index tenor, possible values are D, for days, BD, for business days, W, for Weeks, M, for month, y, for Year, Q, for Quarter.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Internal Customer Branch Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the code for the internal branch which is an customer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Internal Customer Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the customer is an internal customer. This identifies if the contract is between one of the financial institutions subsidiaries. This is used in capital consolidation. The List of values are Y, N or NULL.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "International Banking Facility Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account or transaction is belongs to an international banking facility. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Issue Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Date on which the account was originated or issued by the originating institution. For accounts originated by the current institution, ISSUE DATE is equal to ORIGINATION DATE. For accounts acquired through acquisition of another institution, or purchase of a pool of accounts, ISSUE DATE less than ORIGINATION DATE. If ORIGINATION DATE from the original institution is not available, ISSUE DATE is equal to ORIGINATION DATE. ISSUE DATE less than or equal to ORIGINATION DATE, ISSUE DATE cannot be greater than ORIGINATION DATE.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Issuer Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the issuer code for the financial instruments. Issuer is defined as a legal entity that develops, registers and sells securities or financial instruments. Issuers may be domestic or foreign governments, corporations or investment trusts. Issuers are legally responsible for the obligations of the issue and for reporting financial conditions, material developments and any other operational activities as required by the regulations of their jurisdictions. The most common types of financial instruments issued are common and preferred stocks, bonds, notes, debentures, negotiable instruments, bills and derivatives.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Latest Record Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag identifies the latest records for a particular combination of primary keys. List of values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Legal Entity Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the entity code of the legal entity to which the account will be attributed in the general ledger.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Line Of Business Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to line of business, LOB, is a functional unit that offers the products to the customer by the financial entity. Example: Corporate Finance, Trade Services, Private Wealth Management, Treasury Services, Retail Banking, Cards services etc. Refers to the unique code of the line of business applicable to the respective product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Load Identifier",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Numeric",
                    "gcd": "Refers to the load run identifier. Load run identifier enables user to load multiple versions intraday or post back dated adjustment entries to the table. Refers to the Load run identifier of the equivalent record in product processor that needs to be adjusted. Default value of  1 indicates that the latest load run is being adjusted.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Long Run Weighted Average Loss Given Default",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the long run weighted average loss given default. This is the estimate of the average economic loss rate that is expected to be incurred in the event of default, measured over the long run. If the purchasing bank can estimate either the default weighted average loss rates of pool given default or average PD in a reliable manner, the bank may estimate the other parameter based on an estimate of the expected long run loss rate. The bank may, i, use an appropriate PD estimate to infer the long run default weighted average loss rate given default, or, ii, use a long run default weighted average loss rate given default to infer the appropriate PD.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Long Stub Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if instrument is having irregular payment in the beginning or end of the contract, then this attribute states if that irregular payment tenor is shorter or longer than regular payment tenor. If Longer then value will be Y if shorter then value will be N. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loss Given Default Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the loss given default value of the account. Loss given default is the expected amount to be lost by the financial institution if the borrower defaults. Institutions such as banks will determine their credit losses through an analysis of the actual loan defaults. While quantifying some losses may be simple, in some situations it may be quite difficult and require the analysis of multiple variables. For example, if Bank X loans USD 1 million to ABC Company and ABC defaults on the note, Bank Xs loss is not necessarily USD 1 million. This is because Bank X may hold substantial assets as collateral, and or may use the courts in an effort to be made whole. When all of these variables are factored in, Bank X may have lost substantially less than the original USD 1 million loan. The process of analyzing all of these variables, as well as all of the other loans in Bank Xs portfolio, is paramount to determining the loss given default. This value is calculated by the system.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loss Given Default Refresh Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which loss given default for the contract was refreshed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loss Share Agreement Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique reference to the loss sharing agreement that particular OREO, Other Real Estate Owned, asset is subjected to.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margin Agreement Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of the document signed by an individual for opening a margin account, in which the customer agrees to certain regulations and allows the brokerage to have a lien on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margined Transaction Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag identifies whether the derivative transaction is Margined or Unmargined. This will be populated as Y if the transaction has a margin associated with it irrespective of any other collateral. This will be used in SA CCR approach for OTC derivatives. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mark To Market Value In Natural Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Mark to Market value is a measure of the fair value of accounts that can change over time, such as assets and liabilities. Mark to market aims to provide a realistic appraisal of current financial situation of an institution or company. Mark to market value is the change in current market value as against the last traded value.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Marked Pay Obligations By Variable Interest Entity Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates these investments are earmarked for Variable Interest Entity obligation settlement. List of values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Exchange Name",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the name of the primary exchange where this security is listed or traded. An instrument can trade on multiple exchanges and market centers. Refers to the primary exchange where the instrument trades. Refers to the values like BSE, SICOM etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Risk Capital Category Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the market risk or capital category assigned to Credit Derivative based on existing regulatory capital reporting guidelines. List of Values are 'M' positions covered under the Market Risk Rule, 'G' positions recognized as a guarantee for regulatory capital purposes, not covered under the Market Risk Rule, 'U' for other positions not covered under the Market Risk Rule.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the market value of the instrument as on the As of Date. Market value of the asset is the price that would be received to sell an asset in an transaction between market participants on the given day. It is often the quoted market price which is available as part of market data and used to determine the market value of the asset.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Value Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the captures the date on which the market price is evaluated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Materiality Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is material or not. Material exposure is an exposure that is substantial in terms of size or risk.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maturity Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the contractual date on which the principal balance is expected to fully amortize and the balance payable would be nil. This is applicable for term loan products but not for revolving credit or overdraft type of account. In case of insurance policy, for some whole life insurance products the maturity date is aligned to maximum attained age and the policy is payable upon the earlier of the maturity date or the death of the insured. In case of Term Life insurance policies the maturity date is determined as policy issue date plus Term of the contract. In case of an annuity it is the date from which the annuitant has chosen to take the payouts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maximum Potential Loss",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Maximum Potential loss is defined as the value of the largest loss that could result from a disaster, assuming the normal functioning of passive protective features, i.e. firewalls, nonflammable materials, etc., and proper functioning of most, perhaps not all, active suppression systems, i.e. sprinklers. This loss estimate is always less than, or in rare cases, equal to, the Maximum Foreseeable Loss, which assumes the failure of all active protective features. Underwriting decisions can be influenced by PML evaluations, and the amount of reinsurance ceded on a risk can be predicated on the PML valuation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Minimum Holding Period",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the Minimum Holding period in days for an exposure which is used to calculate the volatility haircut.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mitigant Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the mitigant type of the mitigant. E.g.. Commercial Real Estate, Land, Building etc. for Collateral category of Mitigants.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Nettability Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether the exposure is nettable against any other nettable exposures of the same customer. This is valid only for OTC derivatives and Repos. If the value is updated as Y means the exposure is nettable against any other nettable exposure and if the value is updated as N means the exposure is not nettable against any other exposure.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Netting Agreement Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the netting agreement code on which the contract is made. A netting agreement is an arrangement between two parties   known as counterparties   that governs the treatment of certain offsetting transactions or contracts. Two transactions offset each other if a gain in one results in a loss in the other. In other words, the transactions hedge each other. This allows for net settlement of all contracts governed by this netting agreement, with a single counterparty, through a single payment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Non Deposit Taking Systemically Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is a claim on Non deposit taking systemically important non banking finance company, NBFC. They are known as Non Bank Systemically Important Financial Institutions in other countries. In India, NBFCs whose asset size is of Rs.100 crore, INR 1 billion, or more as per last audited balance sheet are considered as systemically important NBFCs. The rationale for such classification is that the activities of such NBFCs will have a bearing on the financial stability in the country.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notional Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the notional amount of the exposure or instrument. This will be the amount, post adjustment for any regulatory capital calculation purpose. If there are any adjustments to the accounting exposure amount due to netting, or any other regulatory capital related computations, the same will be updated. For futures and options corresponds to contract size multiplied by the number of contracts and for swaps and forwards corresponds to the contract amount. This is applicable to off balance sheet instruments such as swaps.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notional Maximum Loss Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the maximum value of notional loss arising due to early termination or unwinding of the contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notional Reset Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Indicates whether the notional of swap must get reset or not with change in price of underlying equity. Expected values are: 0, No reset, and 1, Reset. List of Values are 0 and 1.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Nth To Default Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates the Nth to default flag for SCP credit derivatives. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Number Of Underlying Contract",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the total number of the underlying contract of a Swap contract. E.g. If Future contract is CME Crude petrol and standard size of one contract is 500 Barrels. The total bought quantity is 100 future contracts. Then this new column will hold the value of 100 and Contract quantity will hold 50000.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Operational Relationship Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the balance amount of the account can be added to the high quality liquid assets. High Quality Liquid Assets are used in the calculation of liquidity coverage ratio.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Organization Unit Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the cost center to which the account belongs to. Organization Unit dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the original account number held by the source system. If there are multiple source systems without unique account numbers, we expect the account number and source system to be concatenated as part of the primary key, while this column will store the original account number as generated by the source system.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Original Gross Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the book balance at the time of origination. Original gross book balance is the sum total of End of Period Balance Plus Deferred Balance, represented as a negative amount to depict the unamortized portion. This is used while calculating amortization. The book balance is the term financial institutions use to describe the amount of money available before any adjustments have been made for deposits in transit, checks that have not yet been cleared, reserve requirements and interest received from 'float funds' hence is generally greater than end of period balance, Also called as 'gross balance'.\nIt also excludes any deferred balance that is unamortized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Over The Counter Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to Indicate whether a derivative exposure is traded on an exchange or over the counter. List of values are Y, N. If the value is updated as Y means the exposure is traded over the counter and if the value is updated as N means the exposure is traded in an exchange.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Overlap Group Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to a Unique Code for the Overlap Group.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Overnight Maturity Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates the one day transactions are those that are made on one business day and maturing on the next business day or made on Friday to mature on Monday or made on the last business day prior to a holiday. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Parent Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the parent account number of the contract or account. For instance, if the asset is an underlying for a repurchase agreement, then the account number of the repo contract is expected in this column. Incase of Borrowings, it can also store the account as parent account which is help by the financial institution in fiduciary capacity. In case of cards, parent account number refers to corporate card master account number. Incase of OD Accounts, it should refer to the parent savings, checking account number or loan account number if the overdraft has arisen due to breach of limits or funds from those respective accounts. It will store loan account number as parent account number even for the cases where the overdraft has arisen in the escrow account for the payment of taxes and or insurance. It should be left NULL, if parent child relationship does not exist.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Parent Exposure Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the parent exposure. In Credit Default Swaps, this is the Credit Default Swap ID that has multiple reference obligations identified by underlying exposures identifier.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Party Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier for the party. Party is defined as an entity or a person who takes part or is involved in an agreement, lawsuit, or transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Payment frequency is used in conjunction with PAYMENT FREQUENCY UNIT to define the payment frequency of an account. Using this, the Next Payment Dates are calculated. For a repo since there is only one payment at maturity, this column can be defaulted to number of days between Maturity and Original date. \nTransfer Pricing Application cash flow methodologies reference PAYMENT FREQ for calculating and processing payments and prepayments. The engine forecasts future next payment dates by incrementing NEXT PAYMENT DATE forward by PAYMENT FREQUENCY. PAYMENT FREQUENCY is referenced by the cash flow transfer pricing methodologies when deriving discounted cash flows. PAYMENT FREQUENCY > 0 in all cases. PAYMENT FREQUENCY = 0 can cause incorrect calculations to occur. Note that PAYMENT FREQUENCY = 1 and PAYMENT FREQUENCY MULT = D requires the cash flow engine to perform cash flow calculations for every day of the modeling horizon.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Payment frequency unit is used in conjunction with PAYMENT FREQUENCY to define the payment frequency of an account. Expected values are D Day, M Month and Y Year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Lag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Payment lag is period between accrual end date and date on which actual payment occurs for instrument. Column is applicable for instruments like Cap Floor. Incase of coupon payment, it is the period between coupon date and date on which actual payment occurs. This is used in conjunction with Payment Lag Unit.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Lag Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unit of payment lag of instrument, possible values are D, for days, BD, for business days, W, for Weeks, M, for month, y, for Year. Column is applicable for instruments like Cap Floor. This should be used in conjunction with Payment Lag.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Netting Agreement Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether under ISDA you are permitted to net payment under one single transaction. If you have to net payments across different contracts then it has to be an add on agreement. Hence, need a payment netting agreement flag in addition to master agreement code. List of values are Y, N. If the flag is Y then netting is permitted.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Portfolio Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of a portfolio. The term portfolio refers to any collection of financial assets such as stocks, bonds, cards and cash equivalents, as well as their mutual, exchange traded and closed fund counterparts. Portfolios may be held by individual investors and or managed by financial professionals, hedge funds, banks and other financial institutions. It is a generally accepted principle that a portfolio is designed according to the risk tolerance, time frame and investment objectives of the investor.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Power Of Attorney Or Signatory Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether this account has power of attorney or signatory authority granted to a person with a US address. . This is required for FATCA purpose. List of values are Y, N. If the value is updated as Y means this account has power of attorney granted to a person with a US address and if the value is updated as N means the power of attorney is not granted to a person with US address or this account does not have any power of attorney.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Premium Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the premium amount paid by the Financial Institution for the option contract. Generally, this is computed as the premium percent multiply with Notional balance covered under the option contract.\nIn case of CDs, the buyer of the CDS generally makes a series of payments, the CDS fee or spread, to the seller and, in exchange, receives a payoff if the loan defaults. Refers to the premium paid.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Premium Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the premium frequency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Premium Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the unit of premium frequency. List of values are M  Monthly, Q Quarterly, H  Half Yearly, Y Yearly, D  Daily.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Premium Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the premium rate applicable for credit protection in case of credit default swaps. A credit default swap is an agreement that the protection seller of the CDS will compensate the protection buyer in case of default/bankruptcy of the reference entity or loan. The protection buyer makes a series of payments to the protection seller. These series of payment are similar to that of an insurance and are termed as premium.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Prime Brokerage Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account is associated with prime brokerage services. Prime brokerage is the generic name for a bundled package of services offered by investment banks and securities firms to hedge funds and other professional investors. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Probability Of Default Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the probability of default of an exposure over a period of one year, as required for regulatory capital calculation. This will be used in RWA calculation based on advanced approach. This is expressed in decimal number, For example, 30 percent will be 0.3.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Probability Of Default Refresh Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which said probability of default for the contract was refreshed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Product Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code assigned to each of the Products offered by the Bank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Protection Buy Sell Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates the protection is bought or sold. List of values are B and S. B for protection buyer and S for protection seller.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Provision Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the provision amount set against the account. Provisions are set aside by financial institution to cover against expected future loss. Provision amount on the loan increases as the credit quality deteriorates signifying high likelihood of default and thereby mandating more allocation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Provision General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds provision amount. All asset exposures need to be provisioned for to set off any future losses arising out of these exposures. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Qualifying Instrument Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the instrument deemed to be of comparable investment quality by the reporting bank, and the issuer has securities listed on a recognized stock exchange or not. List of values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Qualifying Reference Obligation Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is a qualifying reference obligation or not. This is applicable to credit derivatives on the trading book of the financial institution. Add on factors are used to determine potential future exposure in case credit risk of the trading book. The add on factors are different for qualifying reference obligation and non qualifying reference obligation. Add on is an amount for potential future credit exposure over the remaining life of the contract calculated by applying an add on factor to the notional principal amount of the derivative. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rating Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code representing the rating of the Instrument or the exposure.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Realized Loss Given Default",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the realized loss given default as of extraction date. The realized loss given default is computed by considering outstanding balance at default and offsetting any mitigates offered. List of values are between 0 and 1.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Recalcitrant Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether this account is considered to be a recalcitrant account. A Recalcitrant account is defined as an account that, 1, fails to comply with reasonable requests for information pursuant to IRS mandated verification and due diligence procedures to identify US Accounts,, 2, fails to provide a name, address and taxpayer identification number or, 3, fails to provide a bank secrecy waiver upon request. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Reference Entity Party Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the code of the entity securitizing the underlying reference asset of the credit derivative.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Referral Line Of Business Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Line of Business that is responsible to acquiring the account. Line of business, LOB, is a functional unit that offers the products of the financial entity to the customer. Example: Corporate Finance, Trade Services, Private Wealth Management, Treasury Services, Retail Banking, Cards services etc. This column Refers to the unique code of the line of business applicable to the respective product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Region Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the geographical grouping of the market based on certain common characteristics like language, ethnicity, country, continent, city and state. The region can vary based on the definition of market. Global market vs local market can have different definition of region.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Regular Way Traded Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the securities settlement contractually occurs within the period of time, after the trade date, generally established by regulations or conventions in the marketplace or exchange in which the transaction is being executed. It is a type of trade that is settled through the regular settlement cycle required for the particular investment being traded. The settlement cycle is the time that the regulations of the securities market allows for the buyer to complete payment and for the seller to deliver the goods being purchased. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remaining Tenor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the remaining tenor of the account. Tenor is the term to maturity. The remaining tenor is computed as Maturity Date  As Of Date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remaining Tenor Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Remaining term unit is used in conjunction with remaining term to determine the remaining term of an account as on processing date. List of values are D Day, M Month and Y Year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remargin Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the reimagining frequency of an exposure in days. This is used in calculating the volatility haircut. Reimagining frequency is the frequency at which the exposure is marked to market. For some transactions, depending on the nature and frequency of the revaluation and reimagining provisions, different holding periods are appropriate. The framework for collateral haircuts distinguishes between repo style transactions, i.e. repo or reverse repos and securities lending or borrowing, other capital market driven transactions, i.e. OTC derivatives transactions and margin lending, and secured lending. In capital market driven transactions and repo style transactions, the documentation contains reimagining clauses, in secured lending transactions, it generally does not. When the frequency of reimagining or revaluation is longer than the minimum, the minimum haircut numbers will be scaled up depending on the actual number of business days between reimagining or revaluation. Currently this attribute is only consumed by Basel application.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Resecuritization Coverage Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the credit derivative is providing protection to re securitized exposure. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Restructured Coverage Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to identify if restructuring of the underlying obligation covered as credit event or not. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Restructuring Clause",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of restructuring clause as per ISDA definition. Restructuring clause defines the credit event that triggers a default. This is applicable to credit default swap or survival probabilities. Expected values are XR, Ex Restructuring, CR, Cum Restructuring or Old Restructuring, MR, Modified Restructuring, or MM, Mod Mod Restructuring. Used for instruments like Equity convertible bond, Amortizing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Revaluation Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the frequency at which the reference exposure is revalued to reflect its fair value in days. This is used in calculating the volatility haircut.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Risk Weight",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the risk weight assigned to an exposures. In case of the tranche, it will be allocated risk weight based on the rating assigned to the tranche.\nPre mitigation risk weight for the exposure or the mitigant, depending on whether it is an eligible mitigant or an uncovered mitigant, as applicable for the corresponding asset class. This risk weight is generally calculated based on the effective rating of the mitigant or exposure. Risk weight is applied based on Asset class and Rating combinations.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Risk Weight By Discretion Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the risk weight for the exposure is given by the financial institution itself. This required for Standardized approach. Subject to national discretion, claims on domestic PSEs may also be treated as claims on the sovereigns in whose jurisdictions the PSEs are established. Where this discretion is exercised, other national supervisors may allow their banks to risk weight claims on such PSEs in the same manner. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Run Identifier",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the run identifier for a set of Records participating in the particular Run with the Run Execution identifier. This is a combination of Run Main Identifier and Run Execution Identifier.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Secured Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account or contract number is secured with a collateral or not. The collaterals to be considered here will be the collaterals other than margins. In case of deposits, this indicates it is Collateralized or Secured Deposit. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securities Guarantor Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to unique code of the guarantor for the securities. List of values are Central Government  CGG, State Government  SGG and Others  OTH.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securitization Coverage Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the credit derivative is providing protection to securitized exposure. List of values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securitization Pool Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Unique identifier of the organization defined codes for a securitization pool. Securitize refers to a pooled group of financial assets that together create a new security, which is then marketed and sold to investors. The value and cash flows of the new security are based off of the underlying value and cash flows of the assets used in the securitization process. Companies will securitize illiquid assets into liquid assets in order to increase their overall liquidity and generate immediate proceeds from their assets.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securitization Tranche Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the securitization tranche identifier, for the particular securitization exposure.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Senior Collateral Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the collateral is a senior collateral or not. This helps in determining eligibility of a collateral to act as a mitigant for exposure. List of values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date at which a security transaction must be paid by the buyer and the securities delivered by the seller. Stocks and bonds have a settlement date of three business days subsequent to the trade date . Listed options and government securities must be settled by the next business day. This is different from contract settlement date. A contract can have multiple settlements in different settlement types.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of days required for settlement after the transaction is performed. Usually the number of business days is captured here. In case of T Plus 2 settlement, it would store a value of 2.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Delinquency Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to past due days settlement amount is due for.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the settlement mechanisms used for secured and foreign exchange products. Expected values for secured tables are T  TRIPARTY, B  BILATERAL and O OTHER. Expected values for foreign exchange tables are C CLS,B  BILATERAL and O  OTHER.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Short Position Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag Indicates whether the derivative position is short or long. Short position is defined as the sale of a borrowed security, commodity or currency with the expectation that the asset will fall in value. Long position is defined as the buying of a security such as a stock, commodity or currency, with the expectation that the asset will rise in value. List of Values are Y and N. If the value is updated as Y means the derivative position is short position and if the value is updated as N means the derivative position is long position.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Solvency Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates Whether General Market Risk is required, Y indicates only general market risk, N indicates only specific market risk and NULL indicates both general market risk and specific market risk. he list of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Specific Wrong Way Risk Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if any of the individual transactions conducted under the agreement with the given counterparty legal entity is considered a wrong way risk position. Possible options are Specific, General, and None. The BHC should use its internal BAU risk management process to determine whether an given transaction with the specific counterparty legal entity is a wrong way risk position, and if so whether it constitutes specific WWR or not. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Squared Off Position Trading Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the transaction has the respective opposite position in trading book. When a dealer is in a square position, the positions are perfectly hedged. If the dealer is not in a square position, then he or she is taking either a long or a short position. A square position is in the middle, neither net long nor net short. If the value is updated as Y means the transaction has the respective opposite position in trading book and if the value is updated as N means there is no opposite position available in trading book. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Strike Rate Or Price",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the strike price or strike rate. In case of options, this stores the strike price. Strike price is the price at which an option to buy or to sell can be exercised. This is predetermined at the time of entering into the contract. In case of forward rate agreements, Refers to the forward rate of interest for the contract period as agreed between the parties. This column is also applicable to instruments like bullet swaps, equity total return swap, equity variance swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sub Netting Agreement Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code of Sub Netting Agreement. Sub Netting happens within broader netting agreement covering either geography, markets, into, fx etc..",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Tenor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the tenor for which exchange rate is being provided. This is applicable for forward exchange rates. For example, If three month forward rate is being given then this attribute will store 3 and tenor unit will be M. In case of spot and overnight rates this must be filled as 0. Tenor or maturity of the instrument like swap, FRA, Starting Tenor. In case of swaption this represents option tenor. This attribute is read together with Tenor Unit. This is required only for Single name credit default swap and credit index swaps. Also Refers to contractual term at origination date. Maturity Date is equal to Origination Date plus Origination Term.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Tenor Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the unit in which tenor of instrument is given. This attribute must be read together with Tenor. Expected values are ON  Overnight, TN  Tomorrow next, SN  Spot next, D  calendar days, BD  business days, W  weeks, M  months, Y  years. When unit is ON, TN, SN or Date then Tenor will be null. This is required only for Single name credit default swap and credit index swaps.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Trading Desk Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the trading desk that has entered into a trade. Banks has various trading desks specializing for specific products, like Interest Rate Products, Equity, Commodities, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Trigger Value Unit Of Measurement",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the trigger value unit. The trigger is a threshold percent or amount that results in an event like unwinding of the contract. List of values for Trigger Unit are Absolute and Percentage.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Unique identifier of an underlying of derivative product. In case of an instrument underlying, underlying code will be same as instrument code and in case of contract underlying, for products like swaption, underlying code will be unique generated code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Instrument Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the instrument code of the underlying of the derivative. In case of convertible bonds, the code of the equity instrument is stored, in case of basket options, multiple codes separated by # are to be stored. Instrument Contract dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Instrument Type Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the underlying or reference instrument type code of the asset. In the case of derivatives, Refers to the information about the instrument type of reference asset on which this derivative contract has been entered into. For example, a call option on a bond will have the underlying instrument type as Bond. Instrument Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Type Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the underlying type of the derivatives, which are reference asset for the funds. The underlying type indicates whether the derivative is bought on equity, debt etc. This information will be obtained from the mandate or the prospectus of the account or instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Undrawn Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the undrawn amount till date. In case of borrowings, it is computed as Sanctioned Limit  Drawn Amount. In case of cards, it is computed as Sanctioned Limit  EOP Balance. In case of facility it is derived by subtracting the committed amount if any from the facility amount and also by reducing the total amount exposures from the facility amount. In case of commitment contract it is the difference between the committed amount and the drawn or utilized amount in the loan exposures.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Undrawn General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code specific to the undrawn amount of the account. The undrawn amount is the sanctioned amount less the drawn portion of the account. General Ledger Account Dimension is the equivalent dimension table for this.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unit Or Index Linked Funds Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Flag indicates if the portfolio is unit linked or index linked portfolio. List of values Y  Unit or Index Linked, N  Not unit or index linked.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unpaid Premium Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the unpaid premium amount. This is applicable in case of credit default swaps where a premium is paid by the protection buyer to the protection seller. This is helpful in calculation of Potential Future Exposure, PFE, of the protection seller. PFE of the protection provider of a credit derivative is capped at the net present value of the amount of unpaid premiums.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unpaid Premium General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds unpaid premium amount. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unrealized Gain Or Loss",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the unrealized gain or loss on exposure. Profit and Losses are classified into realized and unrealized profit or loss. Realized gain refers to the gain realized by selling or buying a security. Unrealized gain or loss refers to notional gain or loss which is not yet realized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unrealized General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Contains the GL code corresponding to the ledger account that holds unrealized amount. Unrealized gains and losses are simply those amounts that are the result of what a position is worth versus what you paid for it. The net off of \nthe profit or loss should be treated within this GL. If the entry is in \ncredit side of the gl it would be unrealized profit and an entry in debit \nside would represent unrealized loss. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Us Indicia Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Flag indicates if the account has US Indicia. US Indicia indicates presence of any of the following: US Citizenship or lawful or permanent resident, US birth place, US address, Instructions to transfer funds to US Accounts or directions regularly received from a US address etc. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Value Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the value date of the contract. Value Date is a securities industry term describing the date on which a trade, bonds, equities, foreign exchange, commodities, etc., settles. That is, the actual day on which transfer of cash or assets is completed, or the settlement amount is calculated. \nIn case of FX swap instrument Refers to the settlement date for spot or near leg. Also considered as the date on which the contract becomes effective.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Value Of The Credit Derivative",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the value of the Credit Derivative.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Write Off General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds write off amount. The write off impacts the Profit and Loss account of the enterprise. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [
                {
                    "dqId": "DQCLREF149",
                    "btLogicalName": "Loss Given Default Percentage",
                    "dqDesc": "Should be greater than 0 if not null.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQCLREF150",
                    "btLogicalName": "Mark To Market Value In Natural Currency",
                    "dqDesc": "Should be greater than 0",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQCLREF151",
                    "btLogicalName": "End Of Period Book Balance",
                    "dqDesc": "Should be greater than or equal to 0",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQCLREF152",
                    "btLogicalName": "Notional Amount",
                    "dqDesc": "Should have values greater than 0",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQCLREF153",
                    "btLogicalName": "Instrument Net Present Value",
                    "dqDesc": "Should have values greater than 0",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQCLREF154",
                    "btLogicalName": "Contract Quantity",
                    "dqDesc": "should have values greater than 0",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQCLREF155",
                    "btLogicalName": "Market Value",
                    "dqDesc": "Should be greater than 0",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQCLREF26",
                    "btLogicalName": "Account Close Date",
                    "dqDesc": "Should be greater than Issue Date",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQCLREF27",
                    "btLogicalName": "Earliest Date Of Unpaid Amount",
                    "dqDesc": "Should be greater than Issue Date",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQCLREF28",
                    "btLogicalName": "Effective Maturity Date",
                    "dqDesc": "Should be greater than Value Date",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV04",
                    "btLogicalName": "Book Type",
                    "dqDesc": "Should have list of values as TRADING or BANKING",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33195",
                    "btLogicalName": "Agreement Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33196",
                    "btLogicalName": "Capital Charge Exclusion Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33197",
                    "btLogicalName": "Contract Unwinding Trigger Loss Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33198",
                    "btLogicalName": "Eligible Non Main Index Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33199",
                    "btLogicalName": "Failed Trade Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33200",
                    "btLogicalName": "Held By Client Or Proprietary Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33201",
                    "btLogicalName": "Illiquid Derivatives Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33202",
                    "btLogicalName": "Non Deposit Taking Systemically Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33203",
                    "btLogicalName": "Power Of Attorney Or Signatory Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33204",
                    "btLogicalName": "Execution Date Payment Included In Dirty Price Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33205",
                    "btLogicalName": "Payment Netting Agreement Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33206",
                    "btLogicalName": "Remaining Tenor Unit",
                    "dqDesc": "Should have list of values as D,M,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33207",
                    "btLogicalName": "Senior Collateral Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33208",
                    "btLogicalName": "Central Counterparty Acceptance Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33209",
                    "btLogicalName": "Dilution Risk Mitigant Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33210",
                    "btLogicalName": "Nettability Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33211",
                    "btLogicalName": "Operational Relationship Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33212",
                    "btLogicalName": "Overnight Maturity Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33213",
                    "btLogicalName": "Short Position Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33214",
                    "btLogicalName": "Unit Or Index Linked Funds Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33215",
                    "btLogicalName": "Delivery Versus Payment Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33216",
                    "btLogicalName": "Eligible Mutual Fund Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33217",
                    "btLogicalName": "Embedded Option Type Indicator",
                    "dqDesc": "Should have list of values as N,S",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33218",
                    "btLogicalName": "Tenor Unit",
                    "dqDesc": "Should have list of values as D,M,W,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33219",
                    "btLogicalName": "Double Default Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33220",
                    "btLogicalName": "End Of Month Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33221",
                    "btLogicalName": "Over The Counter Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33222",
                    "btLogicalName": "Restructured Coverage Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33223",
                    "btLogicalName": "Materiality Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33224",
                    "btLogicalName": "Regular Way Traded Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33225",
                    "btLogicalName": "Securitization Coverage Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33226",
                    "btLogicalName": "Buy Or Sell Indicator",
                    "dqDesc": "Should have list of values as B,S",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33227",
                    "btLogicalName": "Cleared Transaction Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33228",
                    "btLogicalName": "Fiduciary Relationship Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33229",
                    "btLogicalName": "External Customer Branch International Banking Facility Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33230",
                    "btLogicalName": "International Banking Facility Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33231",
                    "btLogicalName": "Marked Pay Obligations By Variable Interest Entity Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33232",
                    "btLogicalName": "Market Risk Capital Category Indicator",
                    "dqDesc": "Should have list of values as G,M,U",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33233",
                    "btLogicalName": "Premium Frequency Unit",
                    "dqDesc": "Should have list of values as D,H,M,Q,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33234",
                    "btLogicalName": "Prime Brokerage Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33235",
                    "btLogicalName": "Resecuritization Coverage Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33236",
                    "btLogicalName": "Solvency Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33237",
                    "btLogicalName": "Squared Off Position Trading Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33238",
                    "btLogicalName": "Brokerage Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33239",
                    "btLogicalName": "Internal Customer Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33240",
                    "btLogicalName": "Margined Transaction Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33241",
                    "btLogicalName": "Nth To Default Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33242",
                    "btLogicalName": "Us Indicia Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33243",
                    "btLogicalName": "Front Stub Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33244",
                    "btLogicalName": "Protection Buy Sell Indicator",
                    "dqDesc": "Should have list of values as B,S",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33245",
                    "btLogicalName": "Qualifying Instrument Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33246",
                    "btLogicalName": "Risk Weight By Discretion Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33247",
                    "btLogicalName": "Specific Wrong Way Risk Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33248",
                    "btLogicalName": "Long Stub Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33249",
                    "btLogicalName": "Recalcitrant Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33250",
                    "btLogicalName": "Secured Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33251",
                    "btLogicalName": "Embedded Options Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQLOV33252",
                    "btLogicalName": "Qualifying Reference Obligation Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQMNDTR46",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQMNDTR47",
                    "btLogicalName": "Account Or Contract Number",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQMNDTR48",
                    "btLogicalName": "Effective Date",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQMNDTR49",
                    "btLogicalName": "End Of Period Balance",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39252",
                    "btLogicalName": "Account Close Date",
                    "dqDesc": "Reference Check for Account Close Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39253",
                    "btLogicalName": "Account Close Date",
                    "dqDesc": "Reference Check for Account Close Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39254",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39255",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39256",
                    "btLogicalName": "Earliest Date Of Unpaid Amount",
                    "dqDesc": "Reference Check for Earliest Date Of Unpaid Amount in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39257",
                    "btLogicalName": "Earliest Date Of Unpaid Amount",
                    "dqDesc": "Reference Check for Earliest Date Of Unpaid Amount in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39258",
                    "btLogicalName": "Effective Maturity Date",
                    "dqDesc": "Reference Check for Effective Maturity Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39259",
                    "btLogicalName": "Effective Maturity Date",
                    "dqDesc": "Reference Check for Effective Maturity Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39260",
                    "btLogicalName": "Effective Date",
                    "dqDesc": "Reference Check for Effective Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39261",
                    "btLogicalName": "Effective Date",
                    "dqDesc": "Reference Check for Effective Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39262",
                    "btLogicalName": "Issue Date",
                    "dqDesc": "Reference Check for Issue Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39263",
                    "btLogicalName": "Issue Date",
                    "dqDesc": "Reference Check for Issue Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39264",
                    "btLogicalName": "Maturity Date",
                    "dqDesc": "Reference Check for Maturity Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39265",
                    "btLogicalName": "Maturity Date",
                    "dqDesc": "Reference Check for Maturity Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39266",
                    "btLogicalName": "Market Value Date",
                    "dqDesc": "Reference Check for Market Value Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39267",
                    "btLogicalName": "Market Value Date",
                    "dqDesc": "Reference Check for Market Value Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39268",
                    "btLogicalName": "Settlement Date",
                    "dqDesc": "Reference Check for Settlement Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39269",
                    "btLogicalName": "Settlement Date",
                    "dqDesc": "Reference Check for Settlement Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39270",
                    "btLogicalName": "Value Date",
                    "dqDesc": "Reference Check for Value Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39271",
                    "btLogicalName": "Value Date",
                    "dqDesc": "Reference Check for Value Date in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39272",
                    "btLogicalName": "Risk Weight",
                    "dqDesc": "Reference Check for Risk Weight in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39273",
                    "btLogicalName": "Account Or Contract Number",
                    "dqDesc": "Reference Check for Account Or Contract Number in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39274",
                    "btLogicalName": "Account Type",
                    "dqDesc": "Reference Check for Account Type in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39275",
                    "btLogicalName": "Account Status Code",
                    "dqDesc": "Reference Check for Account Status Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39276",
                    "btLogicalName": "Accounting Standard Code",
                    "dqDesc": "Reference Check for Accounting Standard Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39277",
                    "btLogicalName": "Adjustment Type",
                    "dqDesc": "Reference Check for Adjustment Type in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39278",
                    "btLogicalName": "Agency Code",
                    "dqDesc": "Reference Check for Agency Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39279",
                    "btLogicalName": "Benchmark Currency Code",
                    "dqDesc": "Reference Check for Benchmark Currency Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39280",
                    "btLogicalName": "Benchmark Code",
                    "dqDesc": "Reference Check for Benchmark Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39281",
                    "btLogicalName": "Book Type",
                    "dqDesc": "Reference Check for Book Type in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39282",
                    "btLogicalName": "Branch Code",
                    "dqDesc": "Reference Check for Branch Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39283",
                    "btLogicalName": "Business Segment Code",
                    "dqDesc": "Reference Check for Business Segment Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39284",
                    "btLogicalName": "Business Unit Code",
                    "dqDesc": "Reference Check for Business Unit Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39285",
                    "btLogicalName": "ISO Currency Code",
                    "dqDesc": "Reference Check for ISO Currency Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39286",
                    "btLogicalName": "Central Counterparty Code",
                    "dqDesc": "Reference Check for Central Counterparty Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39287",
                    "btLogicalName": "Acquisition Channel Code",
                    "dqDesc": "Reference Check for Acquisition Channel Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39288",
                    "btLogicalName": "Cleared Transaction Bank Role Code",
                    "dqDesc": "Reference Check for Cleared Transaction Bank Role Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39289",
                    "btLogicalName": "Clearing Member Code",
                    "dqDesc": "Reference Check for Clearing Member Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39290",
                    "btLogicalName": "Contract Unwinding Trigger Code",
                    "dqDesc": "Reference Check for Contract Unwinding Trigger Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39291",
                    "btLogicalName": "Counterparty Rating",
                    "dqDesc": "Reference Check for Counterparty Rating in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39292",
                    "btLogicalName": "Country Code",
                    "dqDesc": "Reference Check for Country Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39293",
                    "btLogicalName": "Country Code Of Risk",
                    "dqDesc": "Reference Check for Country Code Of Risk in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39294",
                    "btLogicalName": "Credit Status Code",
                    "dqDesc": "Reference Check for Credit Status Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39295",
                    "btLogicalName": "Data Source Code",
                    "dqDesc": "Reference Check for Data Source Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39296",
                    "btLogicalName": "Day Count Indicator",
                    "dqDesc": "Reference Check for Day Count Indicator in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39297",
                    "btLogicalName": "Deal Identifier",
                    "dqDesc": "Reference Check for Deal Identifier in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39298",
                    "btLogicalName": "Delinquency Status Code",
                    "dqDesc": "Reference Check for Delinquency Status Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39299",
                    "btLogicalName": "Financial Market Quote Type",
                    "dqDesc": "Reference Check for Financial Market Quote Type in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39300",
                    "btLogicalName": "Fund Code",
                    "dqDesc": "Reference Check for Fund Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39301",
                    "btLogicalName": "Fund Type",
                    "dqDesc": "Reference Check for Fund Type in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39302",
                    "btLogicalName": "General Ledger Account Code",
                    "dqDesc": "Reference Check for General Ledger Account Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39303",
                    "btLogicalName": "Guarantor Identifier",
                    "dqDesc": "Reference Check for Guarantor Identifier in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39304",
                    "btLogicalName": "Hedge Portfolio Set Code",
                    "dqDesc": "Reference Check for Hedge Portfolio Set Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39305",
                    "btLogicalName": "Holding Type",
                    "dqDesc": "Reference Check for Holding Type in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39306",
                    "btLogicalName": "Holiday Rolling Convention Code",
                    "dqDesc": "Reference Check for Holiday Rolling Convention Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39307",
                    "btLogicalName": "Instrument Code",
                    "dqDesc": "Reference Check for Instrument Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39308",
                    "btLogicalName": "Instrument Type",
                    "dqDesc": "Reference Check for Instrument Type in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39309",
                    "btLogicalName": "Internal Customer Branch Code",
                    "dqDesc": "Reference Check for Internal Customer Branch Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39310",
                    "btLogicalName": "Interest Rate Code",
                    "dqDesc": "Reference Check for Interest Rate Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39311",
                    "btLogicalName": "Issuer Identifier",
                    "dqDesc": "Reference Check for Issuer Identifier in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39312",
                    "btLogicalName": "Issuer Identifier",
                    "dqDesc": "Reference Check for Issuer Identifier in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39313",
                    "btLogicalName": "Legal Entity Code",
                    "dqDesc": "Reference Check for Legal Entity Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39314",
                    "btLogicalName": "Line Of Business Code",
                    "dqDesc": "Reference Check for Line Of Business Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39315",
                    "btLogicalName": "Loss Share Agreement Code",
                    "dqDesc": "Reference Check for Loss Share Agreement Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39316",
                    "btLogicalName": "Mitigant Type",
                    "dqDesc": "Reference Check for Mitigant Type in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39317",
                    "btLogicalName": "Netting Agreement Code",
                    "dqDesc": "Reference Check for Netting Agreement Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39318",
                    "btLogicalName": "Organization Unit Code",
                    "dqDesc": "Reference Check for Organization Unit Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39319",
                    "btLogicalName": "Original Account Number",
                    "dqDesc": "Reference Check for Original Account Number in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39320",
                    "btLogicalName": "Parent Account Number",
                    "dqDesc": "Reference Check for Parent Account Number in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39321",
                    "btLogicalName": "Fiduciary Parent Account Number",
                    "dqDesc": "Reference Check for Fiduciary Parent Account Number in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39322",
                    "btLogicalName": "Party Identifier",
                    "dqDesc": "Reference Check for Party Identifier in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39323",
                    "btLogicalName": "Portfolio Code",
                    "dqDesc": "Reference Check for Portfolio Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39324",
                    "btLogicalName": "Product Code",
                    "dqDesc": "Reference Check for Product Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39325",
                    "btLogicalName": "Provision General Ledger Code",
                    "dqDesc": "Reference Check for Provision General Ledger Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39326",
                    "btLogicalName": "Rating Code",
                    "dqDesc": "Reference Check for Rating Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39327",
                    "btLogicalName": "Reference Entity Party Identifier",
                    "dqDesc": "Reference Check for Reference Entity Party Identifier in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39328",
                    "btLogicalName": "Referral Line Of Business Code",
                    "dqDesc": "Reference Check for Referral Line Of Business Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39329",
                    "btLogicalName": "Region Code",
                    "dqDesc": "Reference Check for Region Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39330",
                    "btLogicalName": "Securitization Pool Identifier",
                    "dqDesc": "Reference Check for Securitization Pool Identifier in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39331",
                    "btLogicalName": "Securities Guarantor Identifier",
                    "dqDesc": "Reference Check for Securities Guarantor Identifier in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39332",
                    "btLogicalName": "Settlement Type",
                    "dqDesc": "Reference Check for Settlement Type in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39333",
                    "btLogicalName": "Trading Desk Identifier",
                    "dqDesc": "Reference Check for Trading Desk Identifier in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39334",
                    "btLogicalName": "Underlying Code",
                    "dqDesc": "Reference Check for Underlying Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39335",
                    "btLogicalName": "Underlying Instrument Type Code",
                    "dqDesc": "Reference Check for Underlying Instrument Type Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39336",
                    "btLogicalName": "Underlying Instrument Code",
                    "dqDesc": "Reference Check for Underlying Instrument Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39337",
                    "btLogicalName": "Underlying Type Code",
                    "dqDesc": "Reference Check for Underlying Type Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39338",
                    "btLogicalName": "Undrawn General Ledger Code",
                    "dqDesc": "Reference Check for Undrawn General Ledger Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39339",
                    "btLogicalName": "Unpaid Premium General Ledger Code",
                    "dqDesc": "Reference Check for Unpaid Premium General Ledger Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39340",
                    "btLogicalName": "Unrealized General Ledger Code",
                    "dqDesc": "Reference Check for Unrealized General Ledger Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                },
                {
                    "dqId": "DQREF39341",
                    "btLogicalName": "Write Off General Ledger Code",
                    "dqDesc": "Reference Check for Write Off General Ledger Code in Stage Credit Derivatives",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:06.0",
                    "modifiedDate": "2024-11-04 04:39:00.0"
                }
            ],
            "useCases": [
                {
                    "ucId": "LRM",
                    "ucName": "Liquidity Risk Management"
                },
                {
                    "ucId": "BASEL",
                    "ucName": "Regulatory Capital Adequency"
                },
                {
                    "ucId": "BSP",
                    "ucName": "Balance Sheet Planning"
                }
            ]
        }
    ]
}