{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "Account Or Contract Number",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of the account or contract held by the customer. Account number is defined as numbers, letters or alphanumeric code assigned to every significant customer, supplier and lender for ease of reference in accounting records of the financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Settlement Delinquency Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to settlement amount past due balance. This is applicable for any payment settlement involved for said account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accreting Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to such accreting frequency. This is applicable only for Accreting Swap. In an accreting swap, the principal gets accreted, increased, at a predetermined frequency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accreting Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to units of Accreting Frequency. List of values are D, W, M, Y etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accreting Indicator Payable Leg Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates accreting is there or not for payable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accreting Indicator Receivable Leg Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates accreting is there or not for receivable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accretion Value Fixed",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to such amount by which principal gets accreted. This is applicable only for Accreting Swap. In an accreting swap, the principal gets accreted, increased, at a predetermined frequency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accretion Value Percent Notional Principal",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the percentage that needs to be applied on notional principal to compute accretion. This is applicable only for Accreting Swap. In an accreting swap, the principal gets accreted, increased, at a predetermined frequency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accrual Resets On",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to when the accrued interest is reset to zero, it identifies the end of the period for the purpose of calculating accrued interest. \nFor END DATE, the interest accrues until the day before the end of the accrual period. On that day, the interest equals one days interest less than the full payment. Then on the accrual end date, the accrued interest resets to zero, whether or not the payment has been made. When END DATE is chosen, the clean price is not necessarily a smooth function of time.\n\nFor PAYMENT DATE, if the payment is part of the dirty price on the value date, then the accrued interest will include the full amount of that payment, and possibly more, on the value date. If the payment on the value date is not part of the dirty price, then the accrued interest on the value date will not include the payment. If there is a payment lag, the accrued interest on the payment date may be larger than the payment amount because there will also be an accrued amount over the current accrual period.\n\nPossible values are  END DATE, Accrued interest for the period resets to zero on the accrual end date, and PAYMENT DATE, Default, accrued interest for the period resets to zero when the payment is no longer included in the dirty price.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accrued Transfer Amount For Pay Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the accrued transfer amount computed for the period between last payment date of interest and As of date. This is used to determine EAD, exposure at default.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accrued Transfer Amount For Receive Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Accrued Transfer Amount computed for the period Last Payment Date of Interest and As of Date and is used for determining Exposure At Default.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accural Start Lag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to accrual Start lag is the lag period between fixing date and accrual start date of instrument like Commodity Swaption, total return swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accural Start Lag Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Indicates the unit for Accrual Start lag, possible values are D, for days, BD, for business days, W, for Weeks, M, for month, y, for Year. OR Alternatively user can also provide A, for Annual, SA, for Semiannual, Q, for Quarterly, M, for Monthly.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjusted Expected Loss Given Default Percent",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the adjusted expected loss given default applicable to the guarantee and credit derivative contracts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag Indicates amortization is there or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Payable Leg Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates amortization is there or not for payable leg. Amortization is defined as an exchange of cash flows, one of which pays a fixed rate of interest and one of which pays a floating rate of interest, and both of which are based on a notional principal amount that decreases. In an amortizing swap, the notional principal decreases periodically because it is tied to an underlying financial instrument with a declining, amortizing, principal balance, such as a mortgage.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Receivable Leg Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates amortization is there or not for receivable leg. Amortization is defined as an exchange of cash flows, one of which pays a fixed rate of interest and one of which pays a floating rate of interest, and both of which are based on a notional principal amount that decreases. In an amortizing swap, the notional principal decreases periodically because it is tied to an underlying financial instrument with a declining, amortizing, principal balance, such as a mortgage.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Term For Second Instrument",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the term over which the payment is amortized receivable.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Term Payable",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the term over which the instrument record needs to be amortized for the pay leg. It should be greater than or equal to Origination Term.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Term Payable Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the unit of the amortization term of the pay leg. List of values are D, M, Y etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Term Receivable",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the term over which the instrument record needs to be amortized for the receive leg. It should be greater than or equal to Origination Term.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Term Receivable Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the unit of the amortization term of the receive leg. List of values can be D, M, Y.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Term Unit For Second Instrument",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refer to the amortization term unit is used in conjunction with amortization term, AMRT_TERM, to define the term over which the payment is amortized. List of values are D Days, M months and Y years.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortizing Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the amortizing frequency which is used in conjunction with amortizing frequency unit. Amortization is the gradual repayment of a debt over a period of time, such as monthly payments on a mortgage loan or credit card balance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortizing Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the amortizing frequency unit as D, M, Y, which is used in conjunction with amortizing frequency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amount Recovered Post Default",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Amount Recovered Post Default.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Approved By Central Government Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates the exposure is in 'Investments in other approved securities guaranteed by Central Government' or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Approved By State Government Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the exposure is in 'Investments in other approved securities guaranteed by state Government' or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "As Of Date",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the average balance computed for a chosen period. There are different ways to compute average balance. A simple method would be, Opening balance + Closing Balance, divided by 2. A complex method would be find out for how many days the balance was with the Financial Institution and then compute the average balance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Daily Collateral Required",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the average daily collateral required for an account. This is required to monitor customer exposure and margin calls on a daily basis.\nThis would assist in benchmarking the margin money required from the customer based on trading pattern.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Notional Principle Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Average Notional Principle Payable Leg. In a swap contract, there is no cash flow for principal component, cash flow occurs only for the interest component. However, the amount of principal is decided in advance because the interest needs to be computed on it. Hence, it is called as notional principal. Refers to the average notional principal amount for payable leg, outflow. For interest rate swaps, the notional principal for receivable and payable leg is the same.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Notional Principle Receive Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Average Notional Principle Receive Leg. In a swap contract, there is no cash flow for principal component, cash flow occurs only for the interest component. However, the amount of principal is decided in advance because the interest needs to be computed on it. Hence, it is called as notional principal. Refers to the average notional principal amount for receivable leg, inflow. For interest rate swaps, the notional principal for receivable and payable leg is the same.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Peak Intra Day Collateral Used",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the average of the peak intra day collateral used. This is relevant in case of money market contracts such as Repurchase agreements which involve the use of collateral.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to Arithmetic or Geometric, case sensitive, which is Averaging Type used for pricing Asian option.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bank Asset Class Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the asset class of the underlying asset as defined by the Bank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bank Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code or identifier of the financial institution which owns the transaction, assigned by the central bank. Bank identifier can be one of the following identifier or code: BIC Code, Bank Identifier Codes, ABA Code, Routing transfer number, IFSC Code, Indian Financial System Code, BCHH etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Barrier Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to Barrier is an predetermined amount in Barrier options where options either come alive or die when barriers is reached. This Barrier Amount is store here.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Barrier Applicable Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the template contains a barrier.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Barrier Direction",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Knock in and knock out barriers come in two forms up barriers and down barriers. The barrier direction, up or down, defines the position of the barrier level relative to the FX spot rate at the beginning of the barrier window. For an up barrier, the barrier level is usually above the FX spot rate, and the spot has to move up for the barrier event to occur. For a down barrier, the barrier level is usually below the spot, and the spot has to move down for the barrier to be hit. When the FX spot rate is beyond the barrier level at the beginning of the barrier window, even if the rate never actually crosses the barrier level throughout the windows lifetime, the barrier is still considered to have been hit.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Barrier End Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to Barrier end date. Barrier is a predetermined amount in Barrier options where options either come alive or die when barrier is reached.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Barrier Start Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the window during which the option can be knocked in or knocked out. If not supplied, defaults to the valuation date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Barrier Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the various barrier types available in barrier option. List of values are NA, Knock In and Knock Out, Up and In, Down and In, Up and Out, Down and Out and Double Barrier Options. Corresponding dimension is Barrier Type Dimension.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Base Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the base currency with respect to which the start and end exchange rates are specified.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Basket Correlation",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the correlation of the underlying asset in the basket option.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Basket Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Basket type of the basket option. Possible values are MIN or MAX, case sensitive.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Binary Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to Binary Rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bonus Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the usage bonus amount of the account. Amount of bonus applicable in case of bonus forward. If at expiry, the market rate is at or above the Protected Rate, you are obliged to buy currency at the Protected Rate. However if the market is below the Protected Rate, you can receive a “Bonus Rate” unless the market trades at or below a pre agreed “Limit Rate”.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bonus Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the currency code in which bonus is specified. It is applicable to bonus forward. ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bonus Forward Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the contract is a bonus forward or regular forward. A Bonus Forward allows you to buy or sell foreign currency at an agreed “Protected Rate” of exchange, but with the potential to buy currency at an enhanced “Bonus Rate” if the market moves against you.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Book Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the contract was booked. The booked date can be different from start date of the contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bought Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the bought amount for an account. Typically, in FX contract, an amount is bought in one currency and sold in another currency at a predetermined exchange rate. Hence this is the bought amount specified in the bought currency rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bought Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the unique identifier of the bought currency code. Typically, in FX contract, an amount is bought in one currency and sold in another currency at a predetermined exchange rate. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Brokerage Firm Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the brokerage firm involves in the investment contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Buy Base Currency Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether base currency is at buy position, Positive payout for buy position if FX is greater than or equal to Strike, or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Buy Price Or Purchase Price",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the purchase price or buy price of the money market contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cancelled Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if contract is cancelled or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cap Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum rate of interest agreed in the contract. An interest is payable if the prevailing rate of the interest greater than Cap rate. Hence, it is different from rate cap life.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Central Counterparty Acceptance Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if central counterparty expects only cash as Variation margin.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Collateral Applicable Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether collateral is applicable for the master agreement or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commission Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the commission amount is received.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commission Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the commission rate applicable for the contract. This is the rate applied on the total contract amount or availed amount based on agreement to compute the total commission amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Component Of Major Index Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Refers to if the instrument is part of a major index or not. Indices are composed of securities that are well reputed, the increase and decrease of price of these securities which are weighted decides the movement of the index itself.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Compound Frequency Pay",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the compounding frequency of the interest rate payment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Compound Frequency Pay Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the compounding frequency unit is used in conjunction with compounding frequency to determine the compounding frequency of the pay leg of the contract. List of values are D, M, Y.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Compound Frequency Receive",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the frequency of compounding for the receive leg. This is used in conjunction with the compounding frequency unit.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Compound Frequency Receive Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the compounding frequency unit is used in conjunction with compounding frequency to determine the compounding frequency of the receive leg of the contract. List of values are D, M, Y.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Currency Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the unique code of the contract currency for payable leg. In case of FX swap instrument Refers to the sold currency code for spot or near leg i.e. Sell or funding currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Currency Receive Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the unique code of the contract currency for receivable leg. In case of FX swap instrument Refers to the bought currency code for spot or near leg i.e. Spot leg  Buy or borrowed currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the start date of the foreign exchange contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Multiplier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Contract multiplier is a standardized number for the futures instrument being traded, that can represent an amount in the case of index futures and number of securities in terms of equity futures for each contract. It represents the amount of asset that has to be delivered under one contract. It is also called as a lot size in some markets.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Origination Price",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the price at which the futures contract was trading at the time of origination.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Start Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the contract begins.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Term",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the duration of the futures contract and is stored as term point. For example if term point is 3 month then 3 will be stored here. Usually, the term of the futures contract is monthly and quarterly.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Term Multiplier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the unit of the contract term in D Days, M Months, Q Quarter or Y Years. This should be used in conjunction with Contract Term to define the term of the contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Unwinding Trigger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code identifying the type of event that causes unwinding of the contract. Possible options are:, B,bankruptcy of the underlying or reference entity,F,adverse fall in value of the underlying reference asset,, R,adverse change in credit rating of the underlying assets or entity,, O,other events.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Unwinding Trigger Loss Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if notional loss is arising out of unwinding of trigger then end user is expected to populate this indicator as Y.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Conversion Factor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the conversion factor is provided by the exchange as a daily value for the underlying instrument, which is used to calculate the cheapest to Deliver set of instruments.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Corporate Agreement Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the corporate agreement.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Counter Party Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the account number of the counterparty of the financial institution. This is applicable in case of OTC trades and inter bank transactions. In case of over the counter derivative contracts, counterparties are individuals or corporations who are on the other side of the trade. Inter bank transactions are transactions between financial institution and provide liquidity to the banking system.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Counterparty Reference Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to counterparty code of the bank in the SFT transactions. The customer reference code represents the end customer of the repo transaction. This counterparty code references the counterparty to the bank, in the case of tri party SFT transactions. In the tri party SFT transactions, one party acts as the client, one party acts as the agent, and the other party acts as the dealer. This counterparty code will refer identified of the dealer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Curve Stripped From Certificates Of Deposits Or Bonds",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Indicates whether credit curve should be stripped from CDS or Bonds, allowed values are BONDS, CDS.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Support Annex Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the ISDA, International Swaps and Derivatives Association, has an associated CSA, Credit Support Annex.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Support Annex Threshold Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the credit support annex threshold amount. Indicates the amount of the threshold, over which the counterparty is required to post collateral.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Currency Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Long",
                    "gcd": "Refers to the prevailing currency rate between two currencies in which the account is entered into.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Forward Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the current forward rate on as of date of a forward contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Interest Rate Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the current nominal interest rate on instrument owed to or paid by the financial institution for the payable leg of the contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Interest Rate Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the current nominal interest rate on instrument owed to or paid by the financial institution for the receivable leg of the contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Mark To Market Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Mark to Market value of the position. In case, the contract is freely tradable, then this price is available freely else this is computed using industry standard valuation technique.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Payment Amount Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the periodic principal and interest payment associated with gross balance of the payable leg. Principal portion only for level principal amortization type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Payment Amount Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the periodic principal and interest payment associated with gross balance of the receivable leg. Principal portion only for level principal amortization type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Day Count Indicator For Second Instrument",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the basis on which the interest accrual is calculated. E.g.: 30/360, Actual/360, Actual/Actual, business/252 etc., Receivable.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Day Count Indicator Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the day count indicator such as A/360, A/365, A/A, 30/360, 30/360 EUROPEAN, 30/A etc. for payable leg. Also used for measuring time when calculating volatility or interpolating volatility. Column is applicable for instruments like European swaption.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Day Count Indicator Receive Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the day count indicator such as A/360, A/365, A/A, 30/360, 30/360 EUROPEAN, 30/A etc. for receivable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Debt Value Adjustments",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to DVA which is all unrealized gains and losses that have resulted from changes in the fair value of liabilities that are due to changes in own credit risk of the bank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discount Percentage On Bond Transactions",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to discount percentage of the account on bond transactions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discount Percentage On Stock Transactions",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to discount percentage of the account on stock transactions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discounting Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the discount rate which is used to arrive at present value of future cash flows. This is the discount rate of the bought currency on the deal date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Diversified Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the Index is well diversified.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Downgrade Impact Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the downgrade Impact amount. This is the amount that will be posted as collateral for liabilities if legal entities rating goes below the stated rating, this stated rating is called as downgrade trigger.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Downgrade Trigger Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the trigger identifier for each account. A trigger is the set of condition in a accounts agreement that initiates a specific action in the event of a change in a firms credit rating. For example, a downgrade in a firms credit rating may set off posting additional collateral.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Interest Rate For Hedge Management Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the Effective Interest Rate of the instrument for Hedge Management application for payable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Interest Rate For Hedge Management Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the Effective Interest Rate of the instrument for Hedge Management application for receivable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the effective rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Month Adjustment For Pay Leg Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether to apply end of month, EOM, rules to payment leg. This is applied in computing coupon dates. If coupon date is on a non EOM date then it is shifted to last day of month. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Month Adjustment For Receive Leg Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether to apply end of month, EOM, rules to receivable leg. This is applied in computing coupon dates. If coupon date is on a non EOM date then it is shifted to last day of month.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Equity Credit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the equity credit for the account. This is calculated as the product of allocated equity and the equity credit rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Equity Investment Fund Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the position is for an equity investment fund.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Equity Traded Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether the instrument is publicly traded or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exchange Of Principal Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether or not principal flows will be exchanged at maturity of the contract. Exchange of principal is used for indicating whether the principal flows would be exchanged at maturity.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exchange Rate End",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Long",
                    "gcd": "Refers to the exchange rate used between two currencies used in currency swap. This column will store the exchange rate used at the end of the currency swap contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exchange Rate Start",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Long",
                    "gcd": "Refers to the exchange rate used between two currencies used in currency swap. This column will store the exchange rate used at the start of the currency swap contract. In case of FX swap instrument it represent spot or near exchange rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Executing Broker Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the broker who is involved in the account. Broker is an individual or firm that charges a fee or commission for executing buy and sell orders submitted by an investor.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exercise Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the frequency at which an instrument, option, can be exercised. Based on the timing of exercise, options are classified into 3 types, i, American  this can be exercised at any time till expiry of an option., ii, European  this can be exercised only on the last day when an option expires., iii, Bermudan  this can be exercised at some specified times till expiry of an option. Hence, this field is applicable for Bermudan type of options.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exercise Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the units, D days or M months or Y years or W weeks, of Exercise Frequency. This should be used in conjunction with Exercise Frequency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Expected Loss Given Default Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the expected loss given default.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure Amount In Natural Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of the exposures. This will be the amount, post adjustment for any regulatory capital calculation purpose. If there are any adjustments to the accounting exposure amount due to netting, or any other regulatory capital related computations, the same will be updated. This will be the End of period balance for the on balance sheet exposures, and the adjusted notional balance for the derivatives.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure Category Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Reserve Bank of India category code associated with the account or contract. List of values are Held to Maturity, HTM, Available for Sale, AFS, and Held for trading, HFS.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure End Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date till which the exposure is applicable.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "First Exchange Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date of first exchange.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fixed Discount Rate Margin",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the Contractual Fixed discount rate spread. Discount margin is the return earned in addition to the index underlying the floating rate security.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fixing Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of historical fixings of FX index. Expected values are SPOT, FORWARD. Default value used during instrument valuation is SPOT.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Floating Discount Rate Margin",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the Contractual Floating discount rate spread. Discount margin is the return earned in addition to the index underlying the floating rate security.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Floating Rate Spread Payable",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the spread over the benchmark rate for a payable leg. This would get some value only when the payable leg has floating interest rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Floating Rate Spread Receivable",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the spread over the benchmark rate receivable. This is applicable when the receive leg has a floating rate benchmark such as LIBOR associated with it.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Floor Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the floor rate of the collar and Floor instrument type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forward Premium",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the forward premium charged or paid by the Financial Institution for an account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forward Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the forward rate on contract date of a forward contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forward Rate Agreement Interest Reference Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Forward Rate Agreement interest reference rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forward Rate Agreement Months To Start",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to number of separated months for which forward rate of a forward rate agreement are available. This is useful to find the month for which a FRA quote corresponds.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forward Rate Agreement Quotes",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to number of separated forward rates for which forward rates of a forward rate agreement was available. This is used in conjunction with FRA months to start column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forward Rate Agreement Roll Over Duration",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of days after which a forward rate agreement is about to start. This is also known as FRA Roll over duration.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forward Rate Agreement Term Months",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the tenor of the forward rate agreement represented in months.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Front Stub For Pay Leg Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if Pay leg is having irregular time period at the beginning, Front, or end, Back, of the contract. List of values are Y, N. Select Y for First irregular Payment or N Last irregular Payment of contract. If there are no irregular payment leave column blank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Front Stub For Receive Leg Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if Receive leg is having irregular time period at the beginning, Front, or end, Back, of the contract. List of values are Y, N. Select Y for First irregular Payment or N Last irregular Payment of contract. If there are no irregular payment leave column blank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fund Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the fund of which the investment is part of.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Future Subtype",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the futures sub type. Possible sub types are 1  Bond or Note Futures, 2  Eurodollar or Treasury Bill Futures.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Futures Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of futures contracts like Interest Rate, Currency, Commodity, Stock or Index.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Government Paper Same Currency Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag Indicates whether government paper is denominated in domestic currency of issuer and funded by Financial Institution in same currency or not. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Gross Margin Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to contractual spread above or below pricing index of payable leg. This is applicable for floating rate accounts, which are typically funded by a consortium. The current net rate = Applicable rate from the IRC + margin. This is used along with Current Gross Rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "High Strike Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the high strike. It is applicable to FX Pivot Instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holiday Rolling Convention For Adjusting Accrual Dates For Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to Roll date convention for adjusting payable leg accrual dates when it falls on a non business date. If roll date convention for adjusting payment date and adjusting accrual dates is same then leave this column blank.\nThe holiday rolling convention code, based on which the date on which cash flow has to happen is decided. This includes  Following business day, Modified following business day, Previous business day, Modified previous business day etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holiday Rolling Convention For Adjusting Accrual Dates For Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to Roll date convention for adjusting receive leg accrual dates when it falls on a non business date. If roll date convention for adjusting payment date and adjusting accrual dates is same then leave this column blank.\nThe holiday rolling convention code, based on which the date on which cash flow has to happen is decided. This includes  Following business day, Modified following business day, Previous business day, Modified previous business day etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Illiquid Derivatives Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the derivative is easily liquid table or easily replaceable or an exotic derivative. List of values are Y  It is not easily replaceable or easily liquid table, N  It is easily replaceable or easily liquid table. It is required for regulatory capital processing. Based on this flag and other parameters supervisory haircut is adjusted on the basis of a holding period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Implied Volatility",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to Implied volatility. Implied Volatility is estimated volatility of instrument. Column is applicable for instruments like Commodity European Option.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "In Or Out Or At The Money Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the indicator to know if option is in the money, I, out the money, O, or at the money, A. These are terms associated with derivative options.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Include Last Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if instrument is having irregular time period at the beginning, Front, or end, Back, of the contract. Select Y for Include last or N for not including last . List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Indemnity Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates that the bank provides an indemnity to the SFT transactions. Generally, the indemnity or guarantee is provided on the exposure amount of the SFT transactions post considering the collateral amount. This indemnity will be provided only when the bank acts as an agent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Inflation Index Lag Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the how the INDEX LAG is used when computing a fixing for index computations. Possible inputs  Daily Index Reference, DIR, Monthly Index Reference, MIR, and Quarterly Index Reference, QIR.\n\nInflation linked instruments cash flows are linked very closely to inflation, but, value of the inflation index is not yet known for the cash flow date and a lagged index value is taken. Lagged index value is derived using reference index value which in turn can be calculated using a linear interpolation of the index values. This reference number is calculated using either Daily, Monthly or Quarterly index values. Column is applicable for instruments like Inflation Linked Bond.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Inflation Seasonality Flavor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to inflation seasonality represents a seasonal variation in inflation. Flavor depicts the way in which seasonality is expressed. Expected values are:, 1, Default: Seasonality is specified with twelve values, which may be positive or negative, one for each month of the year. Each value represents a seasonal variation in inflation for the given month. The idea is that these changes are meant to represent relative deviations from the regular inflation pattern within a year, but should not reflect any cumulative or absolute inflation, and, 2, Kerkhof: Seasonality values should add up to zero, so that there is no yearly drift. Unlike the default approach, which considers seasonality to be monthly quotes, approach of Kerkhof sees them as yearly quotes.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Initial Index Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the initial index value. With instrument like Inflation Zero Coupon Swap, Inflation Linked Bond, etc. the performance of the instrument is linked to the movement of an underlying index. In order to measure this performance value of the underlying index is recorded at the start of the investment term. This recording is called the initial index value. Column is applicable for instruments like Inflation Linked Bond.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Accrued Payable Leg General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds accrued interest amount on payable side. Accrual of interest is required to report as on date due should the customer choose to close the account prematurely. The accrued interest is liquidated on the installment payment date until to the account. If the installment is received the interest is accounted as received, if delinquent the interest is capitalized to the principal  with the increase in principal the interest will start to accrue on the increased principal. If the account is in default, prolonged delinquent, the interest accrual is suspended on the account. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Accrued Rate For Pay Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Accrued Interest computed for the period Last Payment Date of Interest and As of Date and is used for determining Exposure At Default.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Accrued Rate For Receive Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Accrued Interest computed for the period between Last Payment Date of Interest and As of Date for the receivable leg, if such leg is interest rate receiving leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Accrued Receivable Leg General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds accrued interest amount on receivable side. Accrual of interest is required to report as on date due should the customer choose to close the account prematurely. The accrued interest is liquidated on the installment payment date until to the account. If the installment is received the interest is accounted as received, if delinquent the interest is capitalized to the principal  with the increase in principal the interest will start to accrue on the increased principal. If the account is in default, prolonged delinquent, the interest accrual is suspended on the account. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Calculation Method Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the interest calculation method for payable leg. List of values for interest calculation type or method are Simple and Compound.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Calculation Method Receive Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the interest calculation method for receivable leg. List of values for interest calculation type or method are Simple and Compound.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Calculation Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the Interest calculation type. It determines cash flow of interest rate cap, floor and collar. Expected values are  DEFLT, Default, NAVG, Numeric Average, GAVG, Geometric Average, RCAL, Range Calculation, BRAN, Binary Range.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Dividend Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which dividends are paid in the case of equity option.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Dividend Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the frequency of dividend payments to the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Dividend Option Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to an organization defined code for how interest accrued on the account should be paid, for example cheque or direct deposit.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Method Pay",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the method of computing interest payable. Expected values are Simple and Compounding.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Method Receive",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the method of computing interest receivable. Expected values are Simple and Compounding.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Payable Leg General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds interest amount on payable side. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code For Second Instrument",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the interest rate code or index to which second instruments associated with.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the benchmark index associated with a pay leg of a Swap contract. Interest rate code identifies the index to which adjustable rate accounts are tied.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the benchmark index associated with a receive leg of a Swap contract. Interest rate code identifies the index to which adjustable rate accounts are tied.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code Tenor For Base Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the underlying IR index tenor used in instrument for base currency. Instrument Used: Fx Forward. This should be used in the conjunction with Interest Rate Code Tenor Unit For Base Currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code Tenor Unit For Base Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unit of underlying IR index tenor for base currency, possible values are D, for days, BD, for business days, W, for Weeks, M, for month, Q, for Quarter, Y, for Year. This should be used in the conjunction with Interest Rate Code Tenor For Base Currency. Instrument Used: Fx American, Fx Forward.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Day Count Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Business day convention for Benchmark Index. The possible values are Actual/360, Actual/365 ,Fixed,, Actual/Actual, Business/252, Thirty/360.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Designated Maturity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the benchmarks designated maturity in days. For instance, LIBOR 3Ms designated maturity will be stored as 90.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Maturity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the maturity of the underlying of the interest forward or future.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Name For Base Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the interest rate code that identifies the index to which other currency, base currency, is associated with. Instrument Used: Fx Forward.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Option Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the interest rate option type. Applicable to Zero Coupon Inflation Indexed Options and Year on Year Options. Expected values are CAP or FLOOR or COLLAR.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Tenor For Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the payment legs underlying IR index tenor used in swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Tenor For Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the receivable legs underlying IR index tenor used in swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Tenor Unit For Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unit of underlying IR index tenor of payment leg, possible values are D, for days, BD, for business days, W, for Weeks, M, for month, y, for Year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Tenor Unit For Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unit of underlying IR index tenor of receivable leg, possible values are D, for days, BD, for business days, W, for Weeks, M, for month, y, for Year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Type Received",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the interest rate type viz. fixed or floating that is agreed to be received in a Swap contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Yield",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the yield of the underlying of the interest rate forward or future.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Receivable Leg General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds interest amount on receivable side. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Type For Second Instrument",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the repricing method and repricing characteristics of the record. E.g.: Fixed, Administered Rate, Floating Rate, Adjustable etc. Receivable.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Inverse Price Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates stating whether or not to permit reverse entry of rate, i.e., units of base currency, Other currency, that can be bought with 1 unit of term currency, ccy Code. Instrument Used: Fx Forward. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Issuer Domestic Currency Rating Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the domestic currency rating of the issuer of securities. It has become common practice for rating agencies to assign a domestic currency rating to the debt of sovereign nationals in addition to a foreign currency one. Often the domestic rating is higher, reflecting the presumed greater ability and willingness of sovereigns to service debt denominated in their own currency. However, the gap between the two ratings is neither omnipresent nor uniform.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Issuer Foreign Currency Rating Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the foreign currency rating identifier for the issuer of the issue or exposure.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Issuer Name",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description",
                    "gcd": "Refers to the name of the instrument issuer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Down In Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to such knock down in price. Knock down in option is an option that begins to function as a normal option only when the prevailing price goes below the predetermined price, which is pre decided at the time of entering into option contract, is reached.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Down Out Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to such knock down out price. Knock down out option is an option that ceases to function as a normal option only when the prevailing price exceeds the predetermined price, which is pre decided at the time of entering into option contract, is reached.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock In Barrier Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the knock in barrier applicable in case of dual target FX forwards.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock In Observation Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the frequency of observation for Knock In. This is applicable when knock in is Bermudan only. This is used to generate schedule from trade date to expiry date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock In Observation Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unit in which frequency of observation for Knock In is specified. This is used to generate schedule from trade date to expiry date. Expected values are: D, Days, M, Months, Y, Years.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock In Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to type of the knock in. Applicable to FX forward contracts like dual target and pivot, the Knock in parameter determines whether the notional is levered when the payout is negative. Four variations are supported: \nEuropean, Discrete,: The knock in feature will be effective on each fixing and will be reset thereafter.\nBermudan: The knock in feature will be effective on a number of specified observation dates. \nNever: The knock in feature will never be in effect. The notional will not be levered at any time.\nAlways: The knock in feature will always be effective. The notional will be levered once the payout is negative.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Out Barrier Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the knock out barrier applicable in case of dual target FX forwards.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Out Bonus Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Amount of knock out bonus applicable in case of bonus forward. This is required only when knock out bonus type is Fixed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Out Bonus Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of knock out bonus which is applicable to forward contract. Expected values are: Fixed, Rebate as a fixed amount, or Forward, Rebate as buy or sell Notional at knock out Strike.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Out Observation Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the frequency of observation for Knock Outs. This is applicable when knock Out is Bermudan only. This is used to generate schedule from trade date to expiry date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Out Observation Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unit in which frequency of observation for Knock Outs is specified. This is used to generate schedule from trade date to expiry date. Expected values are: D, Days, M, Months, Y, Years.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Out Strike Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the strike used for knock out Bonus Settlement. It is applicable to dual target FX forwards.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Out Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Store the type of knock out. Applicable to FX forward contracts like dual target and pivot, Knock out is an additional early termination feature. If the underlying rate crosses the barrier in the agreed upon direction, the deal will be terminated. Four types of Knock outs are available:\nEuropean, Discrete,: The knock out feature is effective on and reset after each fixing date. If the knock out occurs, there is no settlement on a particular fixing date. However, the deal is still in effect after that date.\nEuropean, At Once,: The knock out feature is effective on each fixing date. If the knock out occurs, there is no settlement on any subsequent date.\nBermudan: The knock out feature is effective on specified dates.\nNever: The knock out feature is never in effect.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Up In",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to knock up in option is an option that begins to function as a normal option only when the prevailing price exceeds the predetermined price, which is pre decided at the time of entering into option contract, is reached. Refers to such knock up in price.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Up Out",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to knock up out option is an option that ceases to function as a normal option only when the prevailing price goes below the predetermined price, which is pre decided at the time of entering into option contract, is reached. Refers to such knock up out price.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knocked In Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether AKI, knock in, event has occurred or not. A knock in is a latent option contract that begins to function as a normal option, 'knocks in', only once a certain price level is reached before expiration. Y indicates AKI has occurred while N indicates that it has not occurred. This is applicable in case of dual target fx forwards. List of values and Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knocked Out Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether AKO, knock out, event has occurred or not. A knock out is an option with a built in mechanism to expire worthless if a specified price level is exceeded. Y indicates AKO has occurred while N indicates that it has not occurred. This is applicable in case of dual target fx forwards. List of values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Coupon Payment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the immediate past date on which the coupon was paid for the underlying bond.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Exercise Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the last exercise date for instruments Exercise dates: Dates on which potion can be Exercised. Column is applicable for instruments like callable bond, FX options, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Payment Date Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the immediate past date on which the payment was made to the account for payable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Payment Date Receive Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the immediate past date on which the payment was made to the account for receivable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Payout Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Last Payout parameter determines the amount of cash payment if the target is exceeded. There are three choices for Last Payout:\nFull: The last payout is computed as usual: which implies that the total payout may be larger than the predefined target.\nCapped: The last payout is capped by the target. \nRebate: The last payout is the rebate amount. In particular, zero rebate amount means no settlement once the target is breached.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Principal Payment Date Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the immediate past date on which the principal payment was made to the account for payable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Principal Payment Date Receive Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the immediate past date on which the principal payment was made to the account for receive leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Reprice Date Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the adjustable instruments last repriced for payable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Reprice Date Receive Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the adjustable instruments last repriced for receivable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Revaluation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the last revaluation occurred.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Revaluation Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the last revaluation rate for the contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Latest Record Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag identifies the latest records for a particular combination of primary keys. List of values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Lead Bank Party Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the identifier of the lead bank of the borrower.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Leverage Ratio",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to leverage ratio calculated as Leverage Ratio= Total Liabilities divided by Total Assets.\nRefers to the multiplier or leverage number of FX forward trades like dual target and pivot. This is used for deal structuring in case of fx forwards and user can solve for the PV of the final product while changing this number.\nLeverage allows a client to trade without putting up the full amount. For example, 50:1 leverage, means USD 2 of equity is required to purchase an order worth, 2 multiply with 50, USD 100. for the given example this column will store 50.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Liquidation Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the estimated number of days required for the liquidation of the investment. Illiquid instruments would have higher number of days specified here.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Liquidity Class Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to unique identifier of liquidity class code. Liquidity is defined as the degree to which an asset or security can be bought or sold in the market without affecting the price of the asset. Liquidity is characterized by a high level of trading activity. Assets that can be easily bought or sold are known as liquid assets. Expected values are Qualified Liquidity, Most Liquid, Readily Marketable, Qualified Thin Market, Not Qualified, Not Qualified  Readily Marketable, Not Qualified  Thin Marketable, Not Marketable and Other.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Listed In Recognized Exchange Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag that indicates if underlying Instrument is listed on the recognized exchange or not. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Load Identifier",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Numeric",
                    "gcd": "Refers to the load run identifier. Load run identifier enables user to load multiple versions intraday or post back dated adjustment entries to the table. Refers to the Load run identifier of the equivalent record in product processor that needs to be adjusted. Default value of  1 indicates that the latest load run is being adjusted.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Long Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the contract position is long. Long position is defined as the buying of a security such as a stock, commodity or currency, with the expectation that the asset will rise in value.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Long Stub For Pay Leg Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates If Pay Leg have irregular payment in the beginning or end of the contract, then this attribute states if that irregular payment tenor is shorter or longer than regular payment tenor. If Longer then value will be 'Y' if shorter then value will be 'N'.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Long Stub For Receive Leg Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates If Receive Leg have irregular payment in the beginning or end of the contract, then this attribute states if that irregular payment tenor is shorter or longer than regular payment tenor. If Longer then value will be 'Y' if shorter then value will be 'N'.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Lookback Min Max",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the minimum or maximum value of the underlying spot instrument at the fixing dates as specified in the instrument schedule table. For Fixed Look back Options Refers to Highest Price of Underlying Asset over the life of option in case of CALL and Lowest in case of PUT which will be used as spot. For Floating Look back Options Refers to Lowest Price of Underlying Asset over the life of option in case of CALL and Highest in case of PUT which will be used as Strike.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loss Cap Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the ISO currency code in which Loss Cap is specified. ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loss Given Default Pre CRM",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to loss percentage, without considering mitigation effect, if an exposure is defaulted over a period of one year. It will be used in RWA calculation based on advanced approach. This is expressed in decimal number, For example, 30 percent will be 0.3.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Low Knock In Barrier Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Low knock in barrier applicable in case of FX Pivot.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Low Knock In Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Low Knock In Type. Applicable to FX forward contracts like dual target and pivot, Knock out is an additional early termination feature. If the underlying rate crosses the barrier in the agreed upon direction, the deal will be terminated. Four types of Knock outs are available:\nEuropean, Discrete,: The knock out feature is effective on and reset after each fixing date. If the knock out occurs, there is no settlement on a particular fixing date. However, the deal is still in effect after that date.\nEuropean, At Once,: The knock out feature is effective on each fixing date. If the knock out occurs, there is no settlement on any subsequent date.\nBermudan: The knock out feature is effective on specified dates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Low Knock Out Barrier Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the knock out barrier applicable in case of FX Pivot.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Low Knock Out Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Low Knock Out Type. Applicable to FX forward contracts like dual target and pivot, Knock out is an additional early termination feature. If the underlying rate crosses the barrier in the agreed upon direction, the deal will be terminated. Four types of Knock outs are available:\nEuropean, Discrete,: The knock out feature is effective on and reset after each fixing date. If the knock out occurs, there is no settlement on a particular fixing date. However, the deal is still in effect after that date.\nEuropean, At Once,: The knock out feature is effective on each fixing date. If the knock out occurs, there is no settlement on any subsequent date.\nBermudan: The knock out feature is effective on specified dates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Low Strike Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the low strike amount. It is applicable to FX Pivot Instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Management Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the management fees charges to the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margin Agreement Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of the document signed by an individual for opening a margin account, in which the customer agrees to certain regulations and allows the brokerage to have a lien on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margin Approved By Supervisor Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the Margin Approach for capital computation is approved by supervisor for Exchange traded futures and options and OTC forwards and options. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margin For Second Instrument",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the margin which is the contractual spread that is added to the pricing index and results in the financial institutions retention, net, rate, for adjustable rate accounts. It is used as current net rate = Applicable rate from the Interest Rate Curve + margin.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margin Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the contractual spread above or below pricing index for a receive leg. This is applicable for floating rate accounts. The current net rate = Applicable rate from the IRC Plus margin.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margined Transaction Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag identifies whether the derivative transaction is Margined or Unmargined. This will be populated as Y if the transaction has a margin associated with it irrespective of any other collateral. This will be used in SA CCR approach for OTC derivatives. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mark To Market Settlement Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the MTM value of the settlement amount upon last revaluation. The current value of a swap is called the mark to market value. This is what the swap is worth using current market interest rates. For banks daily valuation is important. It provides profit and loss figures, shows whether hedging is effective and provides information for collateral support. And should you need to cancel or break a swap before it has matured the valuation will provide the basis of the cost you pay or the benefit you receive.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mark To Market Value In Reporting Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Mark to Market Value of the Account in Reporting Currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Making And Liquidity Providing",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Indicates whether to be announced product by the reporting entity is part of a market making or liquidity providing. For reporting purpose we need to include such type of to be announced contract for reporting Line in FR2052a  I.O.3 TBA Sales and O.O.3 TBA Purchases.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Price",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the most recent price at which an instrument has traded. It can be the bid or ask price that buyers and sellers were able to agree on. Generally this information is available with market data but in cases of OTC instruments like floating rate notes it may not be available with market data. Hence needed here. Column is applicable for instruments like Floating Rate Note. In case of bonds and stocks, Refers to the market price. In case of mutual funds, Refers to the net asset value, NAV.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the pre determined rate to be used at settlement. Applicable for FRAs.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Rate Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the market type Indicates whether this is an onshore or offshore, ND, swap in the case that such separation exists in the fixed leg currency market. This term can be left empty, the acceptable values are: Empty, i.e. column left blank where default used will ONSHORE, ND, ONSHORE.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Value Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the captures the date on which the market price is evaluated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Value Per Unit In Local Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the per unit market value of the asset or investment in local currency. This is applicable in case of mutual funds, futures and options, bonds etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Value Per Unit Reporting Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the per unit market value of the asset or investment in reporting currency. This is applicable in case of mutual funds, futures and options, bonds etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Versus Book Balance Ratio",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the Market versus Book Balance Ratio.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Master Agreement Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the master agreement code. This is applicable for collateral based over the counter derivative contracts. The most common type of master agreement code for Swaps is the ISDA master agreement.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Master Agreement Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of master agreement the derivative contract subscribes to. LOVs = ISDA, Inter Bank Market Financial Derivative Master Agreement.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maximum Accreting Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Maximum Accreting Balance. The maximum balance based on which cash flow processing has to happen. The same field is being used by various products or derivatives with different meaning.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maximum Potential Loss",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Maximum Potential loss is defined as the value of the largest loss that could result from a disaster, assuming the normal functioning of passive protective features, i.e. firewalls, nonflammable materials, etc., and proper functioning of most, perhaps not all, active suppression systems, i.e. sprinklers. This loss estimate is always less than, or in rare cases, equal to, the Maximum Foreseeable Loss, which assumes the failure of all active protective features. Underwriting decisions can be influenced by PML evaluations, and the amount of reinsurance ceded on a risk can be predicated on the PML valuation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maximum Price Increase In One Year Over Thirty Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the maximum price increase of the security over a thirty day window during the last one year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maximum Thirty Days Cumulative Collateral Amount Over Twenty Four Months",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the maximum cumulative value of collateral provided for derivatives. Maximum Cumulative value of collateral in this column refers to Maximum of 30 Days cumulative collateral amount over period of 24 Month. Value is in natural currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Minimum Amortizing Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Minimum Amortizing Balance. The minimum balance based on which cash flow processing has to happen. The same field is being used by various products or derivatives with different meaning.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mitigant Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the ISO code of the currency in which the collateral or mitigant is denominated. In case of physical assets, this will store the home currency. In case of financial assets such as stocks, bonds etc., this stores the currency in which the asset is denominated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mitigant Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the value of mitigant or collateral linked to account or contract. Value of an instrument is easy to determine if the instrument trades on a well recognized exchange. In case the collateral does not trade on an exchange, appropriate valuation or appraisal methods may be employed to arrive at an estimated market value. It is used as an indication of the amount that could be fetched if the collateral is sold in open market as on As of Date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Next Accretion Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the notional principal on the swap contract will be increased, called Accretion. Accretion is a principle where the notional principal is increased annually by an agreed amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Next Payment Date Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the next payment is due as per payment schedule for payable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Next Payment Date Receive Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the next payment is due as per payment schedule for receivable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Next Principal Payment Date Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the next principal payment is due as per payment schedule for payable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Next Principal Payment Date Receive",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the next principal payment is due as per payment schedule for receive leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Next Reprice Date Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the Date of next scheduled interest rate change for adjustable rate accounts for payable leg. Next reprice date defines the first forecasted repricing event after the calendar period date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Next Reprice Date Receive Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the Date of next scheduled interest rate change for adjustable rate accounts for receivable leg. Next reprice date defines the first forecasted repricing event after the calendar period date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Nominal Value Of Security",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the nominal value or dollar value of a security stated by the issuer. For stocks, it is the original cost of the stock shown on the certificate. For bonds, it is the amount paid to the holder at maturity. Also known as par value or simply PAR.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Non Credit Loss Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the non credit loss, like trading losses, loss due to exchange rate volatility etc., for an account in the current period. Non credit losses are losses arising due to any reason other than defaults or non payments.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notional Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the notional amount of the exposure or instrument. This will be the amount, post adjustment for any regulatory capital calculation purpose. If there are any adjustments to the accounting exposure amount due to netting, or any other regulatory capital related computations, the same will be updated. For futures and options corresponds to contract size multiplied by the number of contracts and for swaps and forwards corresponds to the contract amount. This is applicable to off balance sheet instruments such as swaps.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notional Amount Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the ISO currency code of the notional amount. The value expected is a valid ISO 4217 currency code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notional Maximum Loss Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the maximum value of notional loss arising due to early termination or unwinding of the contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notional Principal Pay Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Notional Principal for Pay Leg. In a swap contract, there is no cash flow for principal component, cash flow occurs only for the interest component. However, the amount of principal is decided in advance because the interest needs to be computed on it. Hence, it is called as notional principal. Refers to the notional principal amount for payable leg, inflow. For interest rate swaps, the notional principal for receivable and payable leg is the same. For Interest Cross CCY Swaps, an exchange of principal can take place.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notional Principal Receive Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Notional Principal for receive Leg. In a swap contract, there is no cash flow for principal component, cash flow occurs only for the interest component. However, the amount of principal is decided in advance because the interest needs to be computed on it. Hence, it is called as notional principal. Refers to the notional principal amount for receivable leg, inflow. For Interest Cross CCY Swaps, an exchange of principal can take place.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notional Reset Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Indicates whether the notional of swap must get reset or not with change in price of underlying equity. Expected values are: 0, No reset, and 1, Reset. List of Values are 0 and 1.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Number Of Contracts",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of contracts purchased on the exchange.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Number Of Securities",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric_Long",
                    "gcd": "Refers to the Number of units repurchased.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Numeric Contract",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the numeric contract identifier.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Option Adjusted Spread Shift Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the parameter that helps in instrument pricing. This gives user an option of where to apply OAS,Option Adjusted Spread. Expected values are FULL, default, to apply OAS on both stock dynamics and yield curve, or DISCOUNTING to apply OAS only for discounting.\nOAS  The option adjusted spread, OAS, is spread between fixed income security rate and the risk free rate of return, adjusted for embedded option. OAS helps valuing embedded options against general market volatility.\nColumn is applicable for instruments like Equity convertible bond.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Option Exercise Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to identify if the option has been exercised. If the value is updated as Y means option is exercised and if the value is updated as N means the option is not exercised.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Option Expiry Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which option expires. It is the last day that an options contract valid.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Option Mark To Market Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the MTM value of the option in local currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Option Premium Amount Local Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the premium amount paid by the Financial Institution for the option contract represented in local currency. Generally, this is computed as the premium percent multiply with Notional balance covered under the option contract. Currently this attribute is only consumed by ALM application.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Option Purchaser Or Writer Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Indicates whether the Financial Institution role is option purchaser or writer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Option Rebate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Option Rebate which is for a barrier option that offers a predetermined rebate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Notional Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the original notional amount of the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Notional Principle Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Original Notional Principle of the Payable Leg. In a swap contract, there is no cash flow for principal component, cash flow occurs only for the interest component. However, the amount of principal is decided in advance because the interest needs to be computed on it. Hence, it is called as notional principal. Refers to the original notional principal amount for payable leg, outflow. For interest rate swaps, the notional principal for receivable and payable leg is the same.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Notional Principle Receive Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Original Notional Principle of the Receive Leg. In a swap contract, there is no cash flow for principal component, cash flow occurs only for the interest component. However, the amount of principal is decided in advance because the interest needs to be computed on it. Hence, it is called as notional principal. Refers to the original notional principal amount for receivable leg, inflow. For interest rate swaps, the notional principal for receivable and payable leg is the same.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Payment Amount Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Original payment amount for payable leg side of the contract. In case of FX swap instrument Refers to the sell or funding amount for near or spot leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Payment Amount Receive Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Original payment amount for receivable leg side of the contract. In case of FX swap instrument Refers to the buy or borrowed amount for near or spot leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Principal Payment Date Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the first principal payment date as per the original payment schedule of the payable leg. The payment schedules fixed by the financial institution may change under certain circumstances like restructuring, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Principal Payment Date Receive Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the first principal payment date as per the original payment schedule of the receive leg. The payment schedules fixed by the financial institution may change under certain circumstances like restructuring, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Other Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the other currency involved in the option contract, for currency options.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Other Party Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the counterparty Financial Institution of the importer or exporter. This refers to the other party code, here would indicate the broker for the FX contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Over The Counter Derivative First Priority Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to Indicate if the exposure is an over the counter derivative contract and has a first priority claim on the cash flows from the underlying exposures.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Over Under Collateralized Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount over or under the collateral margin level for the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Past Realized Volatility",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the realized volatility. It is sometimes referred to as the historical volatility, this term usually used in the context of derivatives. While the implied volatility refers to the markets assessment of future volatility, the realized volatility measures what actually happened in the past. Column is applicable for instruments like equity variance swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Pay Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the ISO currency code for the pay leg of an account or contract. It is mainly applicable for Swap and FX related contracts, e.g. FX Spots, FX Forwards, FX Futures.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Pay Later Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the frequency associated with a pay later swap contract. In a Pay Later swap, the last tranche of interest is payable after the expiry date of a swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Pay Later Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the frequency unit associated with a pay later swap contract. In a Pay Later swap, the last tranche of interest is payable after the expiry date of a swap. List of values are D Days, M Months, Y Years.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Pay Upfront Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if there is an upfront payment like premium or other fee. List of Values are Y, N. Y when there is upfront payment and N when it is not there.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payable Lower Range Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the value for lower range of payable leg. This is applicable only for Binary Range Swap. Binary Range Swap, interest cash flow happens only if the prevailing interest rate is in the in range of interest rates specified at the time of contract. If the prevailing rate of interest is outside this range, then no cash flow takes place. The floating interest rate can be applied to either Receivable leg or Payable leg. Depending upon that, the range of values would exist only for a type of leg at a time.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payable Upper Range Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the value for upper range of payable leg. This is applicable only for Binary Range Swap. Binary Range Swap, interest cash flow happens only if the prevailing interest rate is in the in range of interest rates specified at the time of contract. If the prevailing rate of interest is outside this range, then no cash flow takes place. The floating interest rate can be applied to either Receivable leg or Payable leg. Depending upon that, the range of values would exist only for a type of leg at a time.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Frequency For Second Instrument",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the frequency of 2nd payments. Using this, the Next Payment Dates are calculated. At present, the CFE expects the Interest Payment and Principal Payment frequency as the same.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Frequency Pay Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the payment frequency for the pay leg of the contract. This is use in conjunction with Payment Frequency Pay Leg Unit.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Frequency Payable Leg Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the frequency unit of the pay leg. List of values are D Days, M Months and Y Years. This is use in conjunction with Payment Frequency Pay Leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Frequency Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the payment frequency for the receive leg of the contract. This is use in conjunction with Payment Frequency Receive Leg Unit.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Frequency Receivable Leg Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the frequency unit of the receive leg. List of values are D Days, M Months and Y Years. This is use in conjunction with Payment Frequency Receive Leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Lag For Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the period between accrual end date and date on which actual payment occurs for pay leg of underlying swap of swaption. This is used in conjunction with Payment Lag For Pay Leg Unit.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Lag For Payable Leg Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unit of period between coupon and payment dates associated with payable leg. Possible values are D, for days, BD, for Business Days. W, for Weeks, M, for month, Y, for Year. This should be used in conjunction with Payment Lag For Pay Leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Lag For Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the period between accrual end date and date on which actual payment occurs for receive leg of underlying swap of swaption. This is used in conjunction with Payment Lag For Receive Leg Unit.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Lag For Receivable Leg Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unit of period between coupon and payment dates associated with receivable leg. Possible values are D, for days, BD, for Business Days. W, for Weeks, M, for month, Y, for Year. This should be used in conjunction with Payment Lag For Receive Leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Netting Agreement Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether under ISDA you are permitted to net payment under one single transaction. If you have to net payments across different contracts then it has to be an add on agreement. Hence, need a payment netting agreement flag in addition to master agreement code. List of values are Y, N. If the flag is Y then netting is permitted.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payoff Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Payoff amount of the derivative. The profit, or loss, from the sale of an item after the costs of selling it and any accounting losses have been subtracted. This term is commonly used in describing real estate and investment transactions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payoff General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds pay off amount. An amount realized is the gain or loss resulting from a sale of an asset. The amount realized encompasses all forms of compensation, including cash, the value of any property received as payment and any liabilities that the purchaser assumes as a result of the transaction. The net off of the profit or loss should be treated within this GL. If the entry is in credit side of the gl it would be realized profit and an entry in debit side would represent realized loss. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payout Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the fixed cash amount paid on settlement date if option is in the money.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payout Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the payout ISO currency code. Currency in which payout is made. It must be same as either base ccy1 or term ccy currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payout Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the header describes the timing of payout as soon as the barrier is hit generally applicable to One touch and no touch options. Possible input values: At Hit and At Maturity. Default is set to At Maturity.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Pending Collateral Delivery Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the collateral amount pending to be delivered. This is an additional amount which is required to be extended as part of the contract due to certain market conditions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Pending Collateral Delivery Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the pending collateral has to be delivered.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Physical Holding Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates the if the bank is physically holding the said investment. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Pivot Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the pivot amount. The pivot points are defined as the level at which the market direction changes for the day. Pivots point is set by using high, low and closing price of the previous day. General definition of pivot point is Pivot Point =, High + Close + Low, divided by 3. It is applicable to pivot instrument like FX Dual Target Pivot Instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Portfolio Liquid Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the overall portfolio is liquid and well diversified or not. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Premium Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the premium amount paid by the Financial Institution for the option contract. Generally, this is computed as the premium percent multiply with Notional balance covered under the option contract.\nIn case of CDs, the buyer of the CDS generally makes a series of payments, the CDS fee or spread, to the seller and, in exchange, receives a payoff if the loan defaults. Refers to the premium paid.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Premium General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds premium amount. An option premium is the income received by an investor who sells or writes an option contract to another party. An option premium may also refer to the current price of any specific option contract that has yet to expire. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Premium Payment Lag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the period between premium payment date and date on which actual premium occurs for instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Premium Payment Lag Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the unit of premium payment lag of instrument, possible values are D, for days, B, for business days, W, for Weeks, M, for month, Y, for Year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Premium Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to premium payment type, the Analytic PREMIUM TYPE overrides the Instrument PREMIUM TYPE, FORWARD  Actual premium exchanged on the option expiry date, SPOT  Default, actual premium exchanged on the valuation date. Column is applicable for instruments like European swaption.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Price Index Lag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the Lag from a monitoring date to the reference inflation month. This should be used in combustion with Price Index Lag Unit. Column is applicable for instruments like Inflation Linked Bond, Zero Coupon Inflation Swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Price Index Lag Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Unit of period between Lag from a monitoring date to the reference inflation month. Possible values are D, for days, BD, for Business Days. W, for Weeks, M, for month, Y, for Year. This should be used in combustion with Price Index Lag.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Principal Payment Frequency Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the frequency of principal payments of payable leg. Using this, the future principal payment dates are calculated. It is used in conjunction with Principal Payment Frequency Payable Leg Unit.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Principal Payment Frequency Payable Leg Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the principal payment frequency unit of the payable leg. List of values are D Days, M Months and Y Years. It is used in conjunction with Principal Payment Frequency Payable Leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Principal Payment Frequency Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the frequency of principal payments of receivable leg. Using this, the future principal payment dates are calculated. It is used in conjunction with Principal Payment Frequency Receivable Leg Unit.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Principal Payment Frequency Receivable Leg Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the principal payment frequency unit of the receive leg. List of values are D Days, M Months and Y Years. It is used in conjunction with Principal Payment Frequency Receivable Leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Publicly Traded Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Refers to the flag to identify if the instrument is publicly traded. Publicly traded means a company which has issued securities through an offering, and which are now traded on the open market. List of Values are Y, N. If the value is Y then it is publicly traded and N if its not publicly traded.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Quanto Exchange Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Long",
                    "gcd": "Refers to the agreed exchange rate in case of Quantity Adjusting or quanta options.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Quote Method Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates the method of quotation of foreign currency. Expected values are D Direct and I Indirect. A direct quote is expressed as 1 foreign currency = X local currency and indirect as 1 local currency = X foreign currency. EG: GBP 1 = USD 1.2 Direct, 45 INR = USD 1 Indirect Quote.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Quoted Option Adjusted Spread",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the OAS quoted in the market. OAS: The option adjusted spread, OAS, is spread between fixed income security rate and the risk free rate of return, adjusted for embedded option. OAS helps valuing embedded options against general market volatility.\nColumn is applicable for instruments like Equity convertible bond.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Quoted Yield To Maturity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to convertible bonds YTM quoted in the market. This is used to calculate Price from YTM. Yield to maturity, YTM, is the total return of bond if the bond is held until maturity date. Column is applicable for instruments like Equity convertible bond.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Calculation Rule For Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the rate calculation rule for payable leg, Whether underlying index rate date schedule coincides with accrual dates of the leg, USE ACCRUAL DATES, theoretical approach, or follows its own conventions, USE RATE DATES, market approach. Instrument Used  Vanilla Swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Calculation Rule For Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Rate calculation rule for receivable leg, Whether underlying index rate date schedule coincides with accrual dates of the leg, USE ACCRUAL DATES, theoretical approach, or follows its own conventions, USE RATE DATES, market approach. Instrument Used  Vanilla Swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Cap Life Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the rate cap life for Payable leg. Rate cap life refers to maximum interest rate allowed during life of an adjustable rate instrument. If Forecast Rate Plus Margin > Rate Cap Life, then the rate specified in Rate Cap Life is used.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Cap Life Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the rate cap life for Receive leg. Rate cap life refers to maximum interest rate allowed during life of an adjustable rate instrument. If Forecast Rate Plus Margin > Rate Cap Life, then the rate specified in Rate Cap Life is used.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Change Minimum Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the minimum change in repricing index necessary for a change in the interest rate for payable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Change Minimum Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the minimum change in repricing index necessary for a change in the interest rate for receivable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Change Round Factor Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the factor to which the rate change on an adjustable instrument is rounded for payable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Change Round Factor Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the factor to which the rate change on an adjustable instrument is rounded for receivable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Decrease Cycle Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the Maximum amount rate can decrease during the repricing cycle of an adjustable rate instrument for payable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Decrease Cycle Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the Maximum amount rate can decrease during the repricing cycle of an adjustable rate instrument for receivable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Decrease Year Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum interest rate decrease allowed during a year for an adjustable rate instrument for payable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Decrease Year Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum interest rate decrease allowed during a year for an adjustable rate instrument for receivable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Floor Life Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the Rate floor life for payable leg. Rate floor life refers to Minimum interest rate allowed during the life of an adjustable rate instrument. If Forecast Rate Plus Margin < Rate Floor Life, then the rate specified in Rate Floor Life is used.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Floor Life Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the Rate floor life for receivable leg. Rate floor life refers to Minimum interest rate allowed during the life of an adjustable rate instrument. If Forecast Rate Plus Margin < Rate Floor Life, then the rate specified in Rate Floor Life is used.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Increase Cycle Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum interest rate increase allowed during the cycle on an adjustable rate instrument for payable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Increase Cycle Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum interest rate increase allowed during the cycle on an adjustable rate instrument for receivable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Increase Year Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum interest rate increase allowed during a year for an adjustable rate instrument for payable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Increase Year Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum interest rate increase allowed during a year for an adjustable rate instrument for receivable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Set Lag For Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the lag days to the next reprice date for payable leg. This determines the date the interest by an adjustable rate instrument should refer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Set Lag Payable Leg Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the Rate set lag unit for the payable leg. values are D  Days, M  Month and Y  Years, this is used in conjunction with Rate Set Lag column for payable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Set Lag Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the lag days to the next reprice date for receivable leg. This determines the date the interest by an adjustable rate instrument should refer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Set Lag Receivable Leg Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the Rate set lag unit for the receivable leg. values are D  Days, M  Month and Y  Years, this is used in conjunction with Rate Set Lag column for receivable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rebate Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of rebate given in case of FX forward contracts such as dual target and pivot. This is required when Last payout type is given as rebate. Also refers to or the total amount of rebate that is allowed on the total collection amount of the documentary collection contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rebate Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the ISO currency code in which rebate is specified. ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Receivable Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the ISO currency code for the receive leg of an account or contract. It is mainly applicable for Swap and FX related contracts, e.g. FX Spots, FX Forwards, FX Futures.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Receivable Leg Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the receivable leg amount which is used in cross currency swap contract. This column will store the receivable leg currency amount which is used in cross currency swap. This is commonly used in FX, SWAP type of contracts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Receivable Lower Range Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the value for lower range of receivable leg of Binary Range Swap. Binary Range Swap, interest cash flow happens only if the prevailing interest rate is in the in range of interest rates specified at the time of contract. If the prevailing rate of interest is outside this range, then no cash flow takes place. The floating interest rate can be applied to either Receivable leg or Payable leg. Depending upon that, the range of values would exist only for a type of leg at a time.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Receivable Upper Range Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the value for upper range of receivable leg of Binary Range Swap. Binary Range Swap, interest cash flow happens only if the prevailing interest rate is in the in range of interest rates specified at the time of contract. If the prevailing rate of interest is outside this range, then no cash flow takes place. The floating interest rate can be applied to either Receivable leg or Payable leg. Depending upon that, the range of values would exist only for a type of leg at a time.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Count",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of records aggregated to the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Reference Entity Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to reference entity of a credit derivative. It is one of the underlying parties involved in a credit derivative contract. The reference entity bears the credit risk of the contract, and can be a corporation, government or other legal entity that issues or guarantee debt of any kind. If a credit event such as a default occurs and the reference entity is unable to satisfy the conditions of the bond, the buyer of the credit default swaps receives payment from the seller.\nThis is applicable for instruments like Equity convertible bond.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remaining Number Of Payments Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of payments left to be made on the instrument from the As of Date to the maturity date for payable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remaining Number Of Payments Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the remaining number of payments to be made from As of Date till Maturity Date for receivable leg. This is used to compute the payment dates on which payment of principal and interest happen. For non term accounts, this is set to 1.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repo Customer Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates whether the bank acts as an agent in the interest of the customer, or in the interest of the counterparty in the case of a tri party repo transaction. C represents that the bank acts in the interest of the customer, and P represents that the bank acts in the interest of the counterparty List of Values are C and P.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repo Limit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the limit in terms of percent that can be used to cover the liquidity gap. This is applicable in case of developing counterbalancing strategies to manage the liquidity gap. A counterbalancing strategy or a contingency funding plan refers to certain measures undertaken by banks to minimize or nullify the gaps identified under the Business As Usual and Stress conditions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Reset Frequency For Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the reset frequency for payable leg. If underlying index rate tenor is less than Payment frequency of the leg then the rate is compounded to the Payment frequency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Reset Frequency For Payable Leg Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the reset frequency unit for payable leg. If underlying index rate tenor is less than Payment frequency of the leg then the rate is compounded to the Payment frequency. Possible values are D, for days, BD, for Business Days. W, for Weeks, M, for month, Y, for Year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Reset Frequency For Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the reset frequency for receivable leg. If underlying index rate tenor is less than Payment frequency of the leg then the rate is compounded to the Payment frequency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Reset Frequency For Receivable Leg Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the reset frequency unit for receivable leg. If underlying index rate tenor is less than Payment frequency of the leg then the rate is compounded to the Payment frequency. Possible values are D, for days, BD, for Business Days. W, for Weeks, M, for month, Y, for Year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Return On Equity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the return on equity which is calculated as Net Income divided by Total Equity.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Revaluation Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the frequency unit at which an exposure is revalued. This column should be used in conjunction with Revaluation Frequency. List of values are D days, W weeks, M Months, Y Years.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Revaluation Rate Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the rate type for revaluation which will be applicable for the contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Right To Setoff",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates that the securities purchased under agreements to resell that have been offset, where the right of setoff exists, by securities sold under agreements to repurchase. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rollover Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount rolled over in a repo contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Run Identifier",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the run identifier for a set of Records participating in the particular Run with the Run Execution identifier. This is a combination of Run Main Identifier and Run Execution Identifier.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sale Limit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the limit in terms of percentage of the account that can be sold to cover the liquidity gap. This is applicable in case of developing counterbalancing strategies to manage the liquidity gap. A counterbalancing strategy or a contingency funding plan refers to certain measures undertaken by banks to minimize or nullify the gaps identified under the Business As Usual and Stress conditions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sale Price",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Price at which the account or instrument is sold.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securitization Pool Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Unique Id for the Securitization pool type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Security Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the underlying instrument. This is applicable in case of repurchase agreements which have a security or instrument linked.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount to be settled for the FRA contract as a result of the differential between contract and market rates in local currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Country Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the ISO code of the country where the trade or transaction is expected to settle. There are several popular country codes as part of ISO 3166 standard published by the International Organization for Standardization. ISO 3166 defines codes for the names of countries, dependent territories, special areas of geographical interest and their principal subdivisions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the currency in which the trade is to settle. The value in this field must be a valid ISO 4217 currency code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Delinquency Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to past due days settlement amount is due for.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Lag For Underlying Asset",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to settlement Lag for the underlying asset.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Lag Tenor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the settlement lag between the Valuation date and the underlying, underlying can be commodity, FX, inflation index etc., spot date. If difference is of 2 business day then, this column will hold 2 as value and Instrument Used as Fx Pivot.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Lag Tenor Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the settlement lag between the Valuation date and the underlings, underlying can be commodity, FX, inflation index etc., spot date. If difference is of 2 business day then, this column will hold BD as value and Instrument Used as Fx Pivot.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Method",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the settlement method used in the contract. List of values are Physical or Cash.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sold Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the sold amount for an account. Typically, in FX contract, an amount is bought in one currency and sold in another currency at a predetermined exchange rate. Hence this is the sold amount specified in the selling currency rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sold Credit Protection Risk Weight",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the sum of risk weights of exposures in a basket which is protected by sold credit protection.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sold Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the unique identifier of the sold ISO currency code. Typically, in FX contract, an amount is bought in one currency and sold in another currency at a predetermined exchange rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Spot Consumer Price Index From Curve Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the spot CPI value should be derived from real rate curve. List of Values are Y and N. Consumer Price Index is average of prices change of a basket of predetermined instruments. Column is applicable for instruments like Zero Coupon Inflation Swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Spot Lag Tenor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the spot lag between the Valuation date and the underlying, underlying can be commodity, FX, inflation index etc., spot date. If difference is of 2 business day then, this column will hold 2 as value . Column is applicable for instruments like Equity American Option, Commodity Forward, Zero Coupon Inflation Swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Spot Lag Tenor Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the spot lag between the Valuation date and the underlying, underlying can be commodity, FX, inflation index etc., spot date. If difference is of 2 business day then, this column will hold BD as value . Column is applicable for instruments like Equity American Option, Commodity Forward, Zero Coupon Inflation Swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Spot Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Long",
                    "gcd": "Refers to the spot rate of the currency pair on the deal date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Strike Delta",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the strike of an option entered in terms of delta. Delta is the partial derivative of the value of the option with respect to the value of the underlying asset. For e.g. an option with a delta of 0.5 goes up 0.50 USD if the underlying asset goes up 1.00 USD or goes down 0.50 USD if the underlying asset goes down 1.00 USD. Black Scholes option formula is then used to compute the strike. Column is applicable for instruments like Commodity European Option.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Strike Delta Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the strike of an option is expressed as delta, this attribute stores the type of delta. It determines interpretation of delta for computing strike. Expected values are FORWARD, Delta is interpreted as the Delta that would be used to hedge in the Forward market. This delta is not proportional to a discount factor, FUTURES, Delta is interpreted as the Delta that would be used to hedge with Futures. This Delta is proportional to the domestic discount factor, SPOT, Default, Delta is interpreted as the Delta that would be used to hedge with spot contracts. This Delta is proportional to the foreign discount factor.\nColumn is applicable for instruments like Commodity European Option.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Swap Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the swaption type. List of values are payer swaption and receiver swaption. Payer swaption gives the owner of the swaption the right to enter into a swap where they pay the fixed leg and receive the floating leg. Receiver swaption gives the owner of the swaption the right to enter into a swap in which they will receive the fixed leg, and pay the floating leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Swaps Class",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to information on Swaps Class.\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Swaps Underlying Inflation Index Name",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the underlying index which is used in swap contract. This is applicable for instruments like Zero Coupon Inflation Swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Target Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Target amount. Target amount are stated by investors as a decision points. This amount can be of two type either on basis of number of payouts or on basis of accumulated payouts, user can provide target type in target type code column. It is applicable to pivot instrument like FX Dual Target Pivot Instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Target Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Target type code Expected values are NumberOfPayouts, Accumulated Payout, None.\nTarget Type provided in this column will drive the value provided in target amount column. Target amount are stated by investors as a decision points. This amount can be of two type either on basis of number of payouts or on basis of accumulated payouts, user can provide target type in target type code column. It is applicable to pivot instrument like FX Dual Target Pivot Instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Third Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the third currency in which profits are realized in a triangular arbitrage transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Ticker Symbol",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to a ticker symbol is the unique identifier used to identify the stock on a stock exchange.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Trade Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the swap contract was booked.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Trader Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the employee.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Tranche Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the tranche identifier. A Tranche is a piece, portion or slice of a deal or structured financing. This indicates which for which securitized tranche the particular mitigant covers.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the transaction was recorded in the system. Transaction Date is the date on which a security or other financial instrument is traded. The transaction date represents the time at which ownership is transferred.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code of the type of transaction performed by the customer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transfer Rate Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the transfer rate that is applicable for the contract for payable leg. In case of fixed rate instruments. For adjustable or floating or administered rate instruments, this is the initial rate that is picked up for transfer pricing the record till the first reprice event, after which it picks the TP rate from the TP IRC for future reprice dates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transfer Rate Receive Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the transfer rate that is applicable for the contract for receivable leg. In case of fixed rate instruments. For adjustable or floating or administered rate instruments, this is the initial rate that is picked up for transfer pricing the record till the first reprice event, after which it picks the TP rate from the TP IRC for future reprice dates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique account number of the underlying instrument. For instance, in case of repo contracts, this column will store the account number or contract code which holds the underlying security.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Coupon Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the coupon payment frequency of the underlying bond. Coupon is defined as the interest rate stated on a bond when it is issued. The coupon is typically paid semiannually.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Coupon Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the coupon payment frequency unit of the underlying bond. This should be used in conjunction with Underlying Last Coupon Frequency to define the last frequency of the coupon. Expected values are D Day, M Month, Y Year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Delta Strike Price",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the delta adjusted strike price of the underlying. Delta indicates if the price of an underlying varies, by how much the price of the option contract would vary. For instance, if delta is 0.8 and the strike price of the underlying of the option contract is 50 then this field would store 40, = 0.8 * 50.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Effective Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the effective date of the underlying instrument. The effective date is equal to the sum of issue date and settlement days.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Face Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the underlying face value. This field is used for Bond underlying.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Forward Price",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the forward price of the underlying of the derivative contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Implied Volatility",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the implied volatility of underlying. For example, in case of option on future, volatility of future will be provided in this column. Value is used in calculation of sensitivities of instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Instrument Maturity Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the underlying maturity date. For example if there is option on futures then maturity date of the underling is stored in this column, in given example its maturity date of future. This value is used in pricing of instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Term",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the term or duration of the underlying involved in the contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Term Multiplier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the units in D days or M months or Y years of the underlying term. This should be used in conjunction with Underlying Term to define the duration of the underlying.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Unit Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unit of underlying. For instance gm in case of gold, Quintal in case of commodity. This is used mainly for instruments like commodity swaps. Possible values are bushels, LB, Barrels, KG, Gram, Quintal etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Upfront Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of upfront payment in case of FX forwards. This is required when pay upfront flag is mentioned as Y.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Upfront Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the currency in which upfront amount is specified. ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Upfront Pay Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "This attribute stores the date when upfront payment is made.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Value To Calculate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the calculation options for convertible bonds. Expected values are 'Option Adjusted Spread' calculates the OAS from Price, 'PRICE' calculates Price from YTM, OAS or 'Discounted Value', as defined by user. Yield To Worst, Yield to Maturity, Yield to Call or Yield to Put all calculate Yield. Column is applicable for instruments like Equity convertible bond.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Variation Margin Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the day over day change in market value for a trade. The cumulative variation margin represents the market value for the trade. Variation margin is managed at the portfolio level, i.e. clearing house or clearing broker level.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Volatility",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the current volatility of the instrument. Value is used in calculation of sensitivities of instrument. Volatility of the underlying is considered here.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Volatility Day Count Convention",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the basis code, day count convention, column Refers to Day count convention used to measure time when calculating volatility. List of values are 30/360, 30/365, 30/ACT, ACT/360, ACT/365 and ACT/ACT. Suggested defaults 30/360 for amortizing transactions and Act/Act for non amortizing transactions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Weekday Load",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the WEEKDAY LOAD headings contain the load hours related with weekdays and weekends.\nFor example, on a Peak Contract, 8 hours per weekday of peak delivery are considered, Weekday Load = 8, Weekday Load = 0. The sum of total load hours contributes to the computation of the related Notional. An On Peak Contract will have a 0, zero, on the Weekday Load input parameter, if this parameter is not non zero, then the contract is assumed to be Off Peak. In the latter case the swap daily settlement dates are computed using a frequency of 1d between STARTDATE and END DATE. For the On Peak case, these dates are determined using a frequency of 1bd between STARTDATE and ENDDATE. Column is applicable for instruments like Commodity Swaption.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [],
            "useCases": []
        }
    ]
}