{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "Account Classification Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to classification code of the account. The list of values of account classification can be Fair Value, Amortized Cost, Available for Sale, Held till Maturity etc. Account Classification Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Customer Net Revenue",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to total revenue less the loss or expenses and taxes incurred for that account at customer level. \nIn case of Investments, Leases, Merchant Cards, Options, Swaps and Trusts: It is the sum of Total Commitment Amount Plus Fee Amount Plus Communication Charges Plus Other Charges Plus Other Party Charges Minus Allocated Cost.\nIn case of Casa, Cards, OD, TD, LC and Commitment contracts: Interest earned + Fees + Charges + Commission, Interest rate paid + Expenses.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Display Name",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description",
                    "gcd": "Refers to account name which should be displayed in the account. This is often the name of the primary customer on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Manager Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the account manager is an employee who is responsible for the day to day management of accounts of a particular customer. The account manager is a point of contact, and provides customer support, up selling, technical assistance and general relationship management. An account manager may be in charge of a number of smaller accounts, or may focus on a few larger accounts. This column Refers to the account manager code or the unique employee identifier of the manager assigned by the financial institution. Management Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Or Contract Closed Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the account is closed. Account can be closed upon maturity of the account, transfer of the account, death of the account holder or write off.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Or Contract Number",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of the account or contract held by the customer. Account number is defined as numbers, letters or alphanumeric code assigned to every significant customer, supplier and lender for ease of reference in accounting records of the financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Peer Group Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the account peer group of which this account is a member. An account is classified into one peer group, if provided as part of the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Purpose Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the purpose for which account has originated, purpose or special use of this account. Account purpose dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Settlement Delinquency Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to settlement amount past due balance. This is applicable for any payment settlement involved for said account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the status of the account. List of values can be Active, Inactive, in foreclosure, Re negotiated, Dispute, Frozen, Past Due, Closed etc. Account Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Sub Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Account Sub Type Code that is sub classified as per the banking source system for their internal operational purpose.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Account Type Code that is classified as per the banking source system for their internal operational purpose. \nIn case of ALM FTP applications, Account type are fixed set of values.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accounting Standard Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the accounting standard or the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. E.g. GAAP, IFRS etc. Generally Accepted Accounting Principles, GAAP. GAAP are the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. The Generally Accepted Accounting Principles exist to ensure that accountants are using the same or almost the same standards so that comparison of financial statements between or within a company is easy and accurate. They also promote transparency in accounting. However, GAAP provides broad guidelines, there is room for companies to follow an approach within a guideline.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Acquisition Channel Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the channel through which customer was acquired.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjusted Loss Given Default Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the Adjusted LGD for an exposure and mainly used for Internal Model Method to arrive at RWA. This is expressed in decimal number, For example, 30 percent will be 0.3.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjustment Effective Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the adjustment Effective Date for determining the reference date for the IRC rate lookup.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjustment Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier for adjustment type dimension at an account. Examples can be CONTRA,NEW etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Agency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the agency code that describes the type of the Issuing Agency . List of values are NON  Non Agency, FNMA_  Fannie Mae, FNMA_GNMA  Fannie Mae or Ginnie Mae, FRED_75  Freddie Mac 75, FRED_GOLD  Freddie Mac Gold, FRED_GNMA  Freddie Mac or Ginnie Mae, GNMA_  Ginnie Mae, NONAGENCY_SUBPRIME  Non Agency Subprime, NONAGENCY_PRIME  Non Agency Prime, NONAGENCY_OTHER  Non Agency Other.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag Indicates amortization is there or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Method For Premium Discount And Fees Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the amortization method used for premium, discount and fees. Indicative values are STRAIGHTLINE or LEVELYIELD, LEVELYIELD being the default one.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Term",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the amortization term is used in conjunction with amortization term unit to define the term over which the payment is amortized, depreciated. Amortization term identifies whether a record is a balloon and is used in calculation of payment amounts. It is also used when recalculating payment amounts for User Defined Payment Pattern records that are defined as percentage of Current Payment and have more than one payment frequency defined in the Payment Pattern interface.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Term Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the amortization term unit is used in conjunction with amortization term, AMRT_TERM, to define the term over which the payment is amortized. Expected values are D Days, M Months and Y Years.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amount Due In Next Twelve Months",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Amount Due In Next 12 Months.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Application Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the application number that was filled by the customer that formed the basis for the contract. Application is a document that provides the essential financial and other information about the borrower on which the lender bases the decision to lend.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Approved By Central Government Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates the exposure is in 'Investments in other approved securities guaranteed by Central Government' or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Approved By State Government Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the exposure is in 'Investments in other approved securities guaranteed by state Government' or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "As Of Date",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Daily Collateral Required",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the average daily collateral required for an account. This is required to monitor customer exposure and margin calls on a daily basis.\nThis would assist in benchmarking the margin money required from the customer based on trading pattern.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Peak Intra Day Collateral Used",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the average of the peak intra day collateral used. This is relevant in case of money market contracts such as Repurchase agreements which involve the use of collateral.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to Arithmetic or Geometric, case sensitive, which is Averaging Type used for pricing Asian option.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bank Asset Class Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the asset class of the underlying asset as defined by the Bank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Barrier Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to Barrier is an predetermined amount in Barrier options where options either come alive or die when barriers is reached. This Barrier Amount is store here.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Barrier Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the various barrier types available in barrier option. List of values are NA, Knock In and Knock Out, Up and In, Down and In, Up and Out, Down and Out and Double Barrier Options. Corresponding dimension is Barrier Type Dimension.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Benchmark Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code of the benchmark code associated with the floating rate instrument. The floating rate loans have a benchmark interest rate such as London Inter bank Offer Rate ,LIBOR,, Euro Interbank Offered Rate ,EURIBOR, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Benchmark Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the unique code associated with the benchmark currency. Benchmark currency is the currency associated with a benchmark such as LIBOR. Currency Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Book Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the contract was booked. The booked date can be different from start date of the contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Book Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to if the contract is related to the banking book or trading book. Usually contracts like loans and leases are on the banking book. However, instruments like mortgage backed securities can be held on the trading book of the financial institution. If the value is updated as T then exposure or contract belongs to trading book and if the value is updated as B then it belongs to banking book.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bought Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the bought amount for an account. Typically, in FX contract, an amount is bought in one currency and sold in another currency at a predetermined exchange rate. Hence this is the bought amount specified in the bought currency rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bought Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the unique identifier of the bought currency code. Typically, in FX contract, an amount is bought in one currency and sold in another currency at a predetermined exchange rate. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Branch Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the branch code. A branch, banking center or financial center is a retail location where a financial institution offers a wide array of face to face and automated services to its customers. This column Refers to the unique branch code assigned by the financial institution. A branch may specialize to offer certain type of products to customers. Branch needs approval from the regulators.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Brokerage Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicate if the account is maintained for brokerage purpose.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Brokerage Firm Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the brokerage firm involves in the investment contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Domain",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of the business domain., such as Institutional or Retail Brokerage. This is used to control access to data across distinct business operations.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Risk",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the level of risk associated with this account with respect to business characteristics. List of values are in the range of 0 10 with increasing values denoting increasing risk levels.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Segment Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique key identifying the business segment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Unit Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the business unit code as defined by the organization. A business unit is generally a broader definition and represents all the units in an organization. Business Unit dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Buy Or Sell Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates if the contract holder is the buyer or seller of the contract. This is applicable in case of derivative contracts like futures, forwards, options etc. A Buyer of a futures contract is said to be long while the seller is said to be short. In case of repo transactions, the party doing the reverse repo is referred to as the buyer. The seller of securities sells to the party with an agreement to buy back at a later date. List of Values are B, Buy, and S, Sell.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "CUSIP Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identification number issued to the instrument. CUSIP stands for 'Committee on Uniform Securities Identification Procedures' and refers to a 9 digit alphanumeric code assigned to all security issues approved for trading. By acting as a unique identifier for each security, CUSIPs help market participants avoid confusion and ensure that securities transactions are correctly matched and settled. Additionally, they are also needed to ensure that dividends, interest, and other payments are properly applied.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Calculation Option Display Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the choice between Just shifting the dates for holiday calendar and recalculating the payments based on the new dates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Capital Charge Exclusion Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the exposure will be excluded from the capital calculations.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Claim Foreign Currency And Bank Funding Currency Same Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the financial institution is funded in the same currency as that of a claim. This is applicable in case of claims on foreign sovereigns. This is applicable to Basel regulation of India jurisdiction. Claims denominated in domestic currency of the foreign sovereign met out of the resources in the same currency raised in the jurisdiction of that sovereign will attract a risk weight of zero percent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cleared Transaction Bank Role Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of the cleared transaction role of the reporting bank. Cleared Transaction Bank Role dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cleared Transaction Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag Identifies if the transaction is cleared through central counterparty. Transactions included are, 1, between the clearing member and clearing member client and, 2, clearing member and central counterparty.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Closed Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the party disassociates all direct and indirect relationship with the financial institution, this could also be on account of the death of an individual or dissolution of an entity.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Collateral Nominal Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the nominal or face value of collateral linked to account. Nominal value of the collateral is nothing but the original value of the collateral. This is relevant in case the collateral is a financial security such as equity shares, bonds, etc. The nominal value is usually equal to the book value or the acquisition value of the collateral.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commission Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the commission amount is received.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commission Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the commission amount earned by the financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commission Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the commission rate applicable for the contract. This is the rate applied on the total contract amount or availed amount based on agreement to compute the total commission amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commitment Contract Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of commitment contract code. Commitment contract covers the, irrevocable, committed portion of the facility extended to the customer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Common Chart Of Account Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the chart of accounts is a listing of the names of the accounts that a financial institution has identified and made available for recording transactions in its general ledger. A financial institution has the flexibility to define its chart of accounts as per requirement, including adding accounts as needed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Complementary Identification Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Complementary Identification Code. CIC Code is EIOPA Code used to classify securities. First two Positions of the CIC code are 'ISO 3166 1 alpha 2 country code or XL, for not listed, or XT, for not exchange tradable,', Position 3 and 4 are specified in Standard Product Type dimension table.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Compounding Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to compounding frequency, which is used calculate interest income. Compounded interest is calculated only when the compounding frequency is <less than payment frequency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Compounding Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the unit of compounding frequency, possible values are D, for days, BD, for business days, W, for Weeks, M, for month, y, for Year. Column is applicable for instruments like Equity convertible bond.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the start date of the foreign exchange contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Quantity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the contract quantity associated with the contract. One contract of a derivative like forwards can have multiple quantity associated with it.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Unwinding Trigger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code identifying the type of event that causes unwinding of the contract. Possible options are:, B,bankruptcy of the underlying or reference entity,F,adverse fall in value of the underlying reference asset,, R,adverse change in credit rating of the underlying assets or entity,, O,other events.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Unwinding Trigger Loss Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if notional loss is arising out of unwinding of trigger then end user is expected to populate this indicator as Y.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Walk Away Clause Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the contract contains a walk away clause for Over the Counter derivative transactions and Securities Financing transactions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Counter Party Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the account number of the counterparty of the financial institution. This is applicable in case of OTC trades and inter bank transactions. In case of over the counter derivative contracts, counterparties are individuals or corporations who are on the other side of the trade. Inter bank transactions are transactions between financial institution and provide liquidity to the banking system.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Counterparty Rating",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code representing the Counter Party Rating of the Instrument in this record.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Country Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the country code associated with the account or instrument or party or location. There are several popular country codes as part of ISO 3166 standard published by the International Organization for Standardization. ISO 3166 defines codes for the names of countries, dependent territories, special areas of geographical interest and their principal subdivisions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Country Code Of Risk",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the ISO country code of the risk. Country of risk refers to the country wherein the counter party does business. Dim Country is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the current performance status of the account. List of values are Delinquent, Foreclosed, Impaired, Closed, Disposed, Transferred, Bankrupt etc. Credit Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Currency Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Long",
                    "gcd": "Refers to the prevailing currency rate between two currencies in which the account is entered into.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Deferred Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to deferred current balance refers to Current un amortized deferred balance representing future income or expense such as premium or discount. Deferred Current Balance holds the discount or premium associated with an instrument. A discount loan or instrument is one with interest deducted from the face value of the loan at its origination. The discount amount is the difference between the loans current market price and its stated par value. The deferred current balance, which represents income, will be amortized over the life of the instrument according to a constant yield calculation. Therefore, as the instrument approaches maturity, the book balance approaches the face value or par balance. For discounted instruments, the deferred current balance is a negative balance. This indicates to the cash flow engine that the balance is income.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Forward Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the current forward rate on as of date of a forward contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Mark To Market Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Mark to Market value of the position. In case, the contract is freely tradable, then this price is available freely else this is computed using industry standard valuation technique.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Payment Amount Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the periodic principal and interest payment associated with gross balance of the payable leg. Principal portion only for level principal amortization type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Write Off Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount written off once the loan or receivable has turned bad. This is done when no recovery is possible and the due date of repayment has elapsed a while ago. The write off amount is for the current period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Jurisdiction",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the mantas classification associated with this record. This can be a jurisdiction which represents geographical or legal entity monitoring on data restrictions. Values can be AMEA, INDV, CORP etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source system from where data is extracted. Data can be sourced from multiple sources, this column will Refers to the source code from where the data is extracted for this extraction date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Day Count Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the day count indicator. Expected values are A/360, A/365, A/A, 30/360, 30/360 EUROPEAN, 30/A. Suggested default value are 1=30/360 for amortizing transactions OR 3=Act/Act. for non amortization.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Dealer Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the dealer who assisted in acquiring the account. Financial institution set up dealer networks to cover the geographic area at a low cost.\nIn the case of treasury a dealer would refer to a market maker. They provide quotes on the buy price and sell price of the instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delinquency Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Captures the unique identifier of delinquency status. Indicative values are Charge off, Redeemed, Doubtful, Bad Debt, Sub Standard, Non Performing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discount Day Count Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Business day counter for discounting. The possible values are Actual/360, Actual/365, Fixed, Actual/Actual, Business/252, Thirty/360.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discount Margin",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Discount Margin is average expected return earned over a given reference rate, that is additional to given reference rate, for a floating rate security. Column is applicable for instruments like Floating Rate Note. Refers to the margin or spread that must be added to discount rate obtained from interest rate curve to get the final discount rate that is used to calculate present value of an instrument. This is an optional input and is specified as a rate or price, see Discount Rate Margin Type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discount Rate Margin Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Indicates the form in which Discount Margin is given. Indicative Values are RATE, Rate Spread, PRICE, Price of instrument per 100. When it is given as PRICE then engine solves it to obtain a rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discounting Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the discount rate which is used to arrive at present value of future cash flows. This is the discount rate of the bought currency on the deal date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Diversified Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the Index is well diversified.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Downgrade Impact Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the downgrade Impact amount. This is the amount that will be posted as collateral for liabilities if legal entities rating goes below the stated rating, this stated rating is called as downgrade trigger.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Downgrade Trigger Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the trigger identifier for each account. A trigger is the set of condition in a accounts agreement that initiates a specific action in the event of a change in a firms credit rating. For example, a downgrade in a firms credit rating may set off posting additional collateral.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the effective date of the account or contract or interest rate or exchange rate from which it is effective.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Interest Rate For Hedge Management",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the effective interest rate of the instrument for Hedge Management application.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Maturity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the effective maturity of an exposure. Typically, it would be longest possible remaining time before the counterparty is scheduled to fulfill its obligation. It is used in RWA calculation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Maturity Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the effective maturity date of the contract. Effective maturity takes into account that certain instruments like bonds have a callable feature which can likely shorten the maturity of these instruments.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Month Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the last payment of the instrument is on month end or not. List of values are Y, N. Alternatively it indicate the end of a calendar month.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to end of period balance which includes accrued interest. All the calculations such as interest, prepayment amounts etc. are based on this amount. This is used in all the calculations performed by cash flow engine. In Case of LC Contracts, EOP Balance should be populated when LC Is executed. Till LC is executed, LC amount sanctioned should be hold in Total Commitment Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the end of period book balance. It is the sum of total of End of Period Balance Plus Deferred Balance. This is used while calculating amortization. The book balance is the term financial institutions use to describe the amount of money available before any adjustments have been made for deposits in transit, checks that have not yet been cleared, reserve requirements and interest received from 'float funds' hence is generally greater than end of period balance, Also called as 'gross balance'. It also excludes any deferred balance that is unamortized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exchange Of Principal Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether or not principal flows will be exchanged at maturity of the contract. Exchange of principal is used for indicating whether the principal flows would be exchanged at maturity.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure At Default Post Mitigation",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the exposure at default amount post mitigation by all eligible mitigants\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure At Default Pre Mitigation",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the pre mitigation Exposure at default amount of the total exposure, as applicable to the particular jurisdiction. This is generally equal to the sum of Exposure of default pre mitigation for the drawn portion of the exposure and the exposure of default per mitigation for the undrawn portion of the exposure.\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure Category Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Reserve Bank of India category code associated with the account or contract. List of values are Held to Maturity, HTM, Available for Sale, AFS, and Held for trading, HFS.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure Held At Fair Value Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is held at fair value. Fair value is applicable to exposures involving less liquid and physical assets. In case of actively traded instruments, the market value is the fair value. This is in the context of Financial Accounting standards board.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "External Customer Branch International Banking Facility Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the Non related Customer branch is an International Banking Facility,IBF, or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Failed Business Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of business days delayed after the agreed settlement date. This is applicable for failed trades. There are different guidelines for capital treatment of failed trades. European standards are dictated at directive level and permit a 5 business day grace period after settlement date on delivery versus payment, DvP, transactions before any charges are imposed at which point they are subject to charges on the exposure. These increase to 100 percent after 46 days. Settlement date is not defined or subject to specific limitations. For non DvP transactions, the charge starts immediately, with a one day grace period for cross border transactions, at a flat eight percent risk weighting of the exposure to the counterparty. US banking regulators take a balance sheet approach, under which a standard risk weight, usually 100 percent but in some cases 20 percent, is applied to the full notional amount of trades that have failed to settle without a grace period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Failed Trade Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the trade is a failed trade. Failed trades are trades that have occurred but not have settled. There are different guidelines for capital treatment of failed trades. European standards are dictated at directive level and permit a 5 business day grace period after settlement date on delivery versus payment, DvP, transactions before any charges are imposed at which point they are subject to charges on the exposure. These increase to 100 percent after 46 days. Settlement date is not defined or subject to specific limitations. For non DvP transactions, the charge starts immediately, with a one day grace period for cross border transactions, at a flat eight percent risk weighting of the exposure to the counterparty. US banking regulators take a balance sheet approach, under which a standard risk weight, usually 100 percent but in some cases 20 percent, is applied to the full notional amount of trades that have failed to settle without a grace period. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fair Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to fair value of an asset. Fair Value is a rational and unbiased estimate of the potential market price of and asset. The Financial Accounting Standards Board, FASB, issued 'Statement of Financial Accounting Standards No. 157: Fair Value Measurements, FAS 157,' in September 2006 to provide guidance about how entities should determine fair value estimations for financial reporting purposes.\n\nFair value is however measured based on the guidelines FASB 13 which has 3 levels.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fatca Pool Report Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the FATCA Pool Report Code. List of values are FATCA201  Recalcitrant account holders with US Indicia, FATCA202  Recalcitrant account holders without US Indicia, FATCA203  Dormant Accounts, FATCA204  Non participating foreign financial institutions, FATCA205  Recalcitrant account holders that are US persons and FATCA206  Recalcitrant account holders that are passive Non Financial Foreign Entities.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fatca Reporting Period End Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the FATCA reporting period end date. This date is the date on which the net worth is reported at the account level for FATCA purpose. This is used in conjunction with the column FATCA Reporting Period Net Worth Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fatca Reporting Period Net Worth Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the FATCA Reporting Period Net worth amount. This is the total net value of all assets associated with this account expressed in base currency as of the end of the last reporting period. This is the aggregate value of all holdings in this account, with a reduction for any margin loans or other debts owed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fatca Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the FATCA Status Code. List of values are INDETER  Indeterminate, RECALC  Recalcitrant, USP  US Person, NPFFI  Non Participating Foreign Financial Institution, PAS NFFE  Passive Non Financial Foreign Entity, ACT NFFE  Active Non Financial Foreign Entity, PFFI  Participating Foreign Financial Institution, EXC NFFE  Excepted Non Financial Foreign Entity, OWNER.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fee General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds fee amount. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fees For Effective Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the consolidated current un amortized, portion of the, fees which is or are applicable for, or are integral part of, Effective Interest Rate computation as per IFRS 9. This value will be used within the Cash Flow Engine.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fiduciary Relationship Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account is held with the bank under a fiduciary capacity. Fiduciary capacity means trustee, executor, administrator, registrar of stocks and bonds, transfer agent, guardian, assignee, receiver, or custodian under a uniform gifts to minors act investment adviser, if the bank receives a fee for its investment advice any capacity in which the bank possesses investment discretion on behalf of another or any other similar capacity that the regulator authorizes. For example deposits that are placed with a bank by a national bank for which the bank is a fiduciary.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Foreclosure Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to identify if the contract is foreclosed or pre closed. Preclosure refers to the early closure of the contract. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forward Premium",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the forward premium charged or paid by the Financial Institution for an account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forward Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the forward rate on contract date of a forward contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fund Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code identifying the fund. Fund dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fund Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code identifying the fund type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "General Ledger Account Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique general ledger account code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Geography Risk",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the level of geographical risk associated with this account. List of values are in the range of 0 10 with increasing values denoting increasing risk levels.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Government Paper Same Currency Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag Indicates whether government paper is denominated in domestic currency of issuer and funded by Financial Institution in same currency or not. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Gross Fee Income",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the fee income of the financial institution before offering any waivers. Fee income is charged for service rendered by financial institutions. Components that generate fee income include annual fee, over the limit fees, wire transfer fees, cheque book issued, bankers draft etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Gross Margin Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to contractual spread above or below pricing index of payable leg. This is applicable for floating rate accounts, which are typically funded by a consortium. The current net rate = Applicable rate from the IRC + margin. This is used along with Current Gross Rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Guaranteed By Sovereign Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if an account is partially or fully guaranteed by the Sovereign, Government agencies or sponsored agencies. This is derived using Standard Guarantor Type of an account or Standard Issuer type of Mitigant of the Account. List of values are Y and N. This also indicates if the exposure is directly and unconditionally by a sovereign entity or an entity for which zero risk weight is applicable in standardized approach. Claims on BIS, Bank of International Settlement, IMF, International Monetary Fund, ECB, European Central bank, MDB, Multilateral Development Bank, carry zero risk weight. Examples of MDB are The Asian Development Bank, ADB, The African Development Bank, AfDB, The European Investment Bank, EIB, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Guarantor Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the identifier of the Party who guaranteed the program.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Hedge Portfolio Set Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique hedge portfolio set code or Hedge identification number, hedge ID, under which this account is covered.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Held By Client Or Proprietary Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the account is held by client or not. If the value is updated as Y which means the security is held by client and if the value is updated as N which means the security is in the proprietary account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holding Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holding intent of the account. Holding Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holiday Display Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holiday calendar code as per the holiday calendar defined through the UI.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holiday Rolling Convention Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holiday rolling convention code, based on which the date on which cash flow has to happen is decided. This includes  Following business day, Modified following business day, Previous business day, Modified previous business day etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "IFSB Contract Type Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Islamic Financial Services Board classification of the instrument. This is applicable in case of Islamic finance products. Examples, include Murabahah, Musharakah, Sukuk, etc. Ifsb Contract Type Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Indemnification Asset Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to indemnification amount of the asset arising from loss sharing agreement. Indemnificationis the part of an agreement that provides for one party to bear the monetary costs, either directly or by reimbursement, for losses incurred by a second party.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Initial Fees For IFRS Nine Effective Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the consolidated initial, un amortized, fees which is or are applicable for, or are integral part of, Effective Interest Rate computation as per IFRS 9. This value will be used to compute the Effective Interest rate as of account inception date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to a unique Code representing a particular Instrument. This code can be ISIN Code, CUSIP, SEDOL etc. Instrument Contract dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Description",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the description of the Instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of instrument type, which is defined as code identifying the instrument category of the customer account. Instrument Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Accrued Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the accrued interest amount associated with the contract. This is the interest that has accumulated on an instrument since the last interest payment up to, but not including, the settlement date. Accrued Interest is defined as Interest earned but not received, realized. For example, bonds usually pay interest every six months, therefore interest accrues between one interest payment and the next. The buyer of a bond pays its market value plus the interest earned up to the settlement date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Accrued General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds accrued interest amount. Accrual of interest is required to report as on date due should the customer choose to close the account prematurely. The accrued interest is liquidated on the installment payment date until to the account. If the installment is received the interest is accounted as received, if delinquent the interest is capitalized to the principal  with the increase in principal the interest will start to accrue on the increased principal. If the account is in default, prolonged delinquent, the interest accrual is suspended on the account. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Calculation Method",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the method of computing interest. Expected values are Simple and Compounded.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the interest rate as applicable as on As of Date. This is expected for both, fixed rate as well as floating rate instrument. For floating rate instruments, the rate would be computed at the time of next re pricing date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the benchmark index associated with a pay leg of a Swap contract. Interest rate code identifies the index to which adjustable rate accounts are tied.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the benchmark index associated with a receive leg of a Swap contract. Interest rate code identifies the index to which adjustable rate accounts are tied.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Day Count Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Business day convention for Benchmark Index. The possible values are Actual/360, Actual/365 ,Fixed,, Actual/Actual, Business/252, Thirty/360.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Designated Maturity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the benchmarks designated maturity in days. For instance, LIBOR 3Ms designated maturity will be stored as 90.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Margin Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of Margin. Margin can be provided as Rate or Percentage. If provided as Rate then current net rate is Applicable rate from the IRC plus margin. If Percentage, Margin is calculated using IRC and Margin provided as percent. If it is Rate and input is 2 percent, then 2 needs to be provided in spread or margin column. If it is Percent and input is 5 percent of IRC, then 5 needs to be provided in spread or margin column. This column has been added to support Tiered Balance Interest Rates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the type of interest rate paid on this transaction., For instance Fixed Or Floating.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Timing Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of interest timing. if the interest accrual is in advance or in arrears. If the value is selected as Arrears than interest payments are paid at the end of the payment period along with the principal payments. If the value is selected as Advance than Interest payments are paid at the beginning of the payment period starting from the origination date. Payments are made on every payment date except for the Maturity date. Expected values are ARR, Interest In Arrears, ADV, Interest In Advance, or SIA, Set In Arrears. For repo it can be defaulted to ARR.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Internal Customer Branch Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the code for the internal branch which is an customer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Internal Customer Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the customer is an internal customer. This identifies if the contract is between one of the financial institutions subsidiaries. This is used in capital consolidation. The List of values are Y, N or NULL.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "International Banking Facility Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account or transaction is belongs to an international banking facility. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Issuer Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the issuer code for the financial instruments. Issuer is defined as a legal entity that develops, registers and sells securities or financial instruments. Issuers may be domestic or foreign governments, corporations or investment trusts. Issuers are legally responsible for the obligations of the issue and for reporting financial conditions, material developments and any other operational activities as required by the regulations of their jurisdictions. The most common types of financial instruments issued are common and preferred stocks, bonds, notes, debentures, negotiable instruments, bills and derivatives.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Issuer Name",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description",
                    "gcd": "Refers to the name of the instrument issuer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Payment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the immediate past date on which the payment was made to the account. For a repo contract this will generally be same as origination date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Repricing Date Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the balance as on Last Reprice Date when transfer pricing adjustable rate records. When transfer pricing adjustable rate records, Last Reprice Date BALANCE is used as the starting balance from the LAST_REPRICE_DATE. It will same as EOP Balance for a repo contract.\nIf payments, amortization, occurred in between the Last Reprice Date and the extract period, the end of period balance of the record is smaller than it was on the LAST_REPRICE_DATE. Therefore, in order to provide an accurate balance amount at the time of the Last Reprice Date, the Last Reprice Balance has been provided.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Legal Entity Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the entity code of the legal entity to which the account will be attributed in the general ledger.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Line Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code of the credit line associated with this account. Credit Line dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Line Of Business Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to line of business, LOB, is a functional unit that offers the products to the customer by the financial entity. Example: Corporate Finance, Trade Services, Private Wealth Management, Treasury Services, Retail Banking, Cards services etc. Refers to the unique code of the line of business applicable to the respective product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Liquidation Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the estimated number of days required for the liquidation of the investment. Illiquid instruments would have higher number of days specified here.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Long Settlement Transaction Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether it is a Long transaction or not. Needed for Long Settlement Transactions or Failed Trades. Non Sec STD Long settlement transactions. This is determined as per the Basel accord annex 4 para 2B, Long Settlement Transactions are transactions where a counterparty undertakes to deliver a security, a commodity, or a foreign exchange amount against cash, other financial instruments, or commodities, or vice versa, at a settlement or delivery date that is contractually specified as more than the lower of the market standard for this particular instrument and five business days after the date on which the bank enters into the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loss Given Default Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the loss given default value of the account. Loss given default is the expected amount to be lost by the financial institution if the borrower defaults. Institutions such as banks will determine their credit losses through an analysis of the actual loan defaults. While quantifying some losses may be simple, in some situations it may be quite difficult and require the analysis of multiple variables. For example, if Bank X loans USD 1 million to ABC Company and ABC defaults on the note, Bank Xs loss is not necessarily USD 1 million. This is because Bank X may hold substantial assets as collateral, and or may use the courts in an effort to be made whole. When all of these variables are factored in, Bank X may have lost substantially less than the original USD 1 million loan. The process of analyzing all of these variables, as well as all of the other loans in Bank Xs portfolio, is paramount to determining the loss given default. This value is calculated by the system.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loss Given Default Refresh Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which loss given default for the contract was refreshed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loss Share Agreement Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique reference to the loss sharing agreement that particular OREO, Other Real Estate Owned, asset is subjected to.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Management Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the management fees charges to the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margin Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the margin amount. Margins are cushion required by the financial institution to allow the customer to trade in derivative instruments like Options and Futures. These are highly volatile products and the potential loss is high, hence only informed customers are allowed to trade in such products. Margin amount is also relevant in the case of OTC contracts, this is maintained with the counterparty of the transaction. Margin amount refers to the difference between the market value of a collateral and amount of the loan advanced against it.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margin Receivable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the contractual spread above or below pricing index for a receive leg. This is applicable for floating rate accounts. The current net rate = Applicable rate from the IRC Plus margin.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margin Required Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate the margin if required for the account. If the value is updated as Y then account required specified margin and if the value is updated as N means the account does not require margin. Account without margin requirement are not allowed to trade on derivatives, naked short etc. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Marked Pay Obligations By Variable Interest Entity Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates these investments are earmarked for Variable Interest Entity obligation settlement. List of values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Exchange Name",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the name of the primary exchange where this security is listed or traded. An instrument can trade on multiple exchanges and market centers. Refers to the primary exchange where the instrument trades. Refers to the values like BSE, SICOM etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the market value of the instrument as on the As of Date. Market value of the asset is the price that would be received to sell an asset in an transaction between market participants on the given day. It is often the quoted market price which is available as part of market data and used to determine the market value of the asset.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Materiality Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is material or not. Material exposure is an exposure that is substantial in terms of size or risk.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maturity Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the contractual date on which the principal balance is expected to fully amortize and the balance payable would be nil. This is applicable for term loan products but not for revolving credit or overdraft type of account. In case of insurance policy, for some whole life insurance products the maturity date is aligned to maximum attained age and the policy is payable upon the earlier of the maturity date or the death of the insured. In case of Term Life insurance policies the maturity date is determined as policy issue date plus Term of the contract. In case of an annuity it is the date from which the annuitant has chosen to take the payouts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mitigant Market Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the market value of mitigant or collateral linked to account or contract. Market value of an instrument is easy to determine if the instrument trades on a well recognized exchange. In case the collateral does not trade on an exchange, appropriate valuation or appraisal methods may be employed to arrive at an estimated market value. It is used as an indication of the amount that could be fetched if the collateral is sold in open market as on As of Date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Net Fee Income",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to net fee income generated from an instrument and is computed as Gross Fee Income  Waived Fees. This can be NULL for a repo contract as generally no fee applicable.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Nettability Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether the exposure is nettable against any other nettable exposures of the same customer. This is valid only for OTC derivatives and Repos. If the value is updated as Y means the exposure is nettable against any other nettable exposure and if the value is updated as N means the exposure is not nettable against any other exposure.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Netting Agreement Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the netting agreement code on which the contract is made. A netting agreement is an arrangement between two parties   known as counterparties   that governs the treatment of certain offsetting transactions or contracts. Two transactions offset each other if a gain in one results in a loss in the other. In other words, the transactions hedge each other. This allows for net settlement of all contracts governed by this netting agreement, with a single counterparty, through a single payment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notional Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the notional amount of the exposure or instrument. This will be the amount, post adjustment for any regulatory capital calculation purpose. If there are any adjustments to the accounting exposure amount due to netting, or any other regulatory capital related computations, the same will be updated. For futures and options corresponds to contract size multiplied by the number of contracts and for swaps and forwards corresponds to the contract amount. This is applicable to off balance sheet instruments such as swaps.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notional Maximum Loss Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the maximum value of notional loss arising due to early termination or unwinding of the contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Number Of Underlying Contract",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the total number of the underlying contract of a Swap contract. E.g. If Future contract is CME Crude petrol and standard size of one contract is 500 Barrels. The total bought quantity is 100 future contracts. Then this new column will hold the value of 100 and Contract quantity will hold 50000.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Office Of Foreign Asset Control Reason Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates the OFAC reason indicator for this account. List of valid values are: O OFAC Freeze, P  Patriot Act Freeze, V  Patriot Verification, F  Systematic CIP Freeze, D  Compliance CIP Override and N  Registered Principle. Office Of Foreign Asset Control, OFAC, is defined by the department of the U.S. Treasury that enforces economic and trade sanctions against countries and groups of individuals involved in terrorism, narcotics and other disreputable activities.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Operational Relationship Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the balance amount of the account can be added to the high quality liquid assets. High Quality Liquid Assets are used in the calculation of liquidity coverage ratio.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Option Rebate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Option Rebate which is for a barrier option that offers a predetermined rebate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Option Style",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the option style of the embedded option. Option Style refers to the type of expiry of the embedded option. List of valid values are European, American or Bermudan. A European option can be exercised only on the expiry date of the option. An American option can be exercised on or before the expiry date of the option. A Bermudan option can be exercised on specific dates before the expiry date of the option.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Option Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the option type of the embedded option. List of valid values are Callable, Puttable and extendable. A bought call option is a right to buy an instrument at a specific price on or before the expiry date., Long Call American. A bought put option is a right to sell an instrument at a specific price on or before the expiry date., Long Put American. A sold call option is an obligation to sell an instrument at a specific price on or before the expiry date., Short Call American. A sold put option is an obligation to buy an instrument at a specific price on or before the expiry date., Short Put American. Option Type Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Organization Unit Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the cost center to which the account belongs to. Organization Unit dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the original account number held by the source system. If there are multiple source systems without unique account numbers, we expect the account number and source system to be concatenated as part of the primary key, while this column will store the original account number as generated by the source system.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Original Deferred Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the original non amortized income or expense, such as premiums discounts, fees, charges but it does not includes deferred cost incurred by bank which is not directly associated at account level. Unamortized income or expense are the unrealized income or expense on the account and would begin to accrue after issue of the security. The discounted bonds are sold at a price lower than the par value and would amortize to mature at par. Likewise, the premium bonds are sold at a premium over the par value of the bond as it may be offering a higher coupon rate compared to market. The premium paid is amortized over the period to mature at par value on the maturity date. Commitment contracts charge a commitment fee, which is amortized over a period based on the drawdown from the commitment contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Gross Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the book balance at the time of origination. Original gross book balance is the sum total of End of Period Balance Plus Deferred Balance, represented as a negative amount to depict the unamortized portion. This is used while calculating amortization. The book balance is the term financial institutions use to describe the amount of money available before any adjustments have been made for deposits in transit, checks that have not yet been cleared, reserve requirements and interest received from 'float funds' hence is generally greater than end of period balance, Also called as 'gross balance'.\nIt also excludes any deferred balance that is unamortized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Market Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to market value of the instrument as of origination date. Generally, this would be same as the End of period balance as on the origination date. Market value is what investors believe a stock is worth, the price is determined by the market demand and supply basis. A stock can be benchmarked against a price during the trading day  however, the same method of evaluation has to be maintained consistently.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Other Income Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "The aggregate gross amount of all income paid or credited to an account for the calendar year, reduced by interest, dividends, and gross proceeds.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Other Party Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the counterparty Financial Institution of the importer or exporter. This refers to the other party code, here would indicate the broker for the FX contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Over The Counter Derivative Multiplier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the multiplier in case of over the counter derivative contracts. This is useful for calculating the effective notional principal. Effective notional principal is calculated as stated notional principal amount multiplied by any multiplier in the OTC derivative contract. Financial institutions are required to use effective notional principal amount, rather than its apparent or stated notional principal amount in calculating potential future credit exposure. For example, a swap contract with a stated notional amount of USD 1,000,000 whose terms called for quarterly settlement of the difference between 5 percent and LIBOR multiplied by 10 has an effective notional amount of USD 10,000,000.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Over The Counter Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to Indicate whether a derivative exposure is traded on an exchange or over the counter. List of values are Y, N. If the value is updated as Y means the exposure is traded over the counter and if the value is updated as N means the exposure is traded in an exchange.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Ownership Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the organization defined code for the ownership type of the account. Expected values are IND  Individual, JOINT  Joint Tenant or Community Property, TRUST  Trust, CUST  Custodian, CORP  Corporate, FIRM  Firm Owned and OTHER  Other.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Parent Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the parent account number of the contract or account. For instance, if the asset is an underlying for a repurchase agreement, then the account number of the repo contract is expected in this column. Incase of Borrowings, it can also store the account as parent account which is help by the financial institution in fiduciary capacity. In case of cards, parent account number refers to corporate card master account number. Incase of OD Accounts, it should refer to the parent savings, checking account number or loan account number if the overdraft has arisen due to breach of limits or funds from those respective accounts. It will store loan account number as parent account number even for the cases where the overdraft has arisen in the escrow account for the payment of taxes and or insurance. It should be left NULL, if parent child relationship does not exist.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Party Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier for the party. Party is defined as an entity or a person who takes part or is involved in an agreement, lawsuit, or transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Pay Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the ISO currency code for the pay leg of an account or contract. It is mainly applicable for Swap and FX related contracts, e.g. FX Spots, FX Forwards, FX Futures.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Payment frequency is used in conjunction with PAYMENT FREQUENCY UNIT to define the payment frequency of an account. Using this, the Next Payment Dates are calculated. For a repo since there is only one payment at maturity, this column can be defaulted to number of days between Maturity and Original date. \nTransfer Pricing Application cash flow methodologies reference PAYMENT FREQ for calculating and processing payments and prepayments. The engine forecasts future next payment dates by incrementing NEXT PAYMENT DATE forward by PAYMENT FREQUENCY. PAYMENT FREQUENCY is referenced by the cash flow transfer pricing methodologies when deriving discounted cash flows. PAYMENT FREQUENCY > 0 in all cases. PAYMENT FREQUENCY = 0 can cause incorrect calculations to occur. Note that PAYMENT FREQUENCY = 1 and PAYMENT FREQUENCY MULT = D requires the cash flow engine to perform cash flow calculations for every day of the modeling horizon.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Payment frequency unit is used in conjunction with PAYMENT FREQUENCY to define the payment frequency of an account. Expected values are D Day, M Month and Y Year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Netting Agreement Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether under ISDA you are permitted to net payment under one single transaction. If you have to net payments across different contracts then it has to be an add on agreement. Hence, need a payment netting agreement flag in addition to master agreement code. List of values are Y, N. If the flag is Y then netting is permitted.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payoff Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Payoff amount of the derivative. The profit, or loss, from the sale of an item after the costs of selling it and any accounting losses have been subtracted. This term is commonly used in describing real estate and investment transactions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payoff General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds pay off amount. An amount realized is the gain or loss resulting from a sale of an asset. The amount realized encompasses all forms of compensation, including cash, the value of any property received as payment and any liabilities that the purchaser assumes as a result of the transaction. The net off of the profit or loss should be treated within this GL. If the entry is in credit side of the gl it would be realized profit and an entry in debit side would represent realized loss. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Pending Collateral Delivery Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the collateral amount pending to be delivered. This is an additional amount which is required to be extended as part of the contract due to certain market conditions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Pending Collateral Delivery Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the pending collateral has to be delivered.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Percent Encumbered",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Medium",
                    "gcd": "Refers to the percentage of security encumbered in case of partial encumbrance case.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Percentage Sold",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to percent of balance sold to investors, not owned by the bank. This is used compute Current Net Balance, Current Payment Net, Original Net Balance, etc. This is related to syndication, where there are several financial institution that participate in the syndication. The percent sold refers to the portion of exposure that is participated by other financial institutions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Portfolio Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of a portfolio. The term portfolio refers to any collection of financial assets such as stocks, bonds, cards and cash equivalents, as well as their mutual, exchange traded and closed fund counterparts. Portfolios may be held by individual investors and or managed by financial professionals, hedge funds, banks and other financial institutions. It is a generally accepted principle that a portfolio is designed according to the risk tolerance, time frame and investment objectives of the investor.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Portfolio Liquid Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the overall portfolio is liquid and well diversified or not. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Power Of Attorney Or Signatory Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether this account has power of attorney or signatory authority granted to a person with a US address. . This is required for FATCA purpose. List of values are Y, N. If the value is updated as Y means this account has power of attorney granted to a person with a US address and if the value is updated as N means the power of attorney is not granted to a person with US address or this account does not have any power of attorney.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Prime Brokerage Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account is associated with prime brokerage services. Prime brokerage is the generic name for a bundled package of services offered by investment banks and securities firms to hedge funds and other professional investors. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Probability Of Default Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the probability of default of an exposure over a period of one year, as required for regulatory capital calculation. This will be used in RWA calculation based on advanced approach. This is expressed in decimal number, For example, 30 percent will be 0.3.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Probability Of Default Refresh Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which said probability of default for the contract was refreshed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Product Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code assigned to each of the Products offered by the Bank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Protection Buy Sell Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates the protection is bought or sold. List of values are B and S. B for protection buyer and S for protection seller.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Provision Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the provision amount set against the account. Provisions are set aside by financial institution to cover against expected future loss. Provision amount on the loan increases as the credit quality deteriorates signifying high likelihood of default and thereby mandating more allocation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Provision General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds provision amount. All asset exposures need to be provisioned for to set off any future losses arising out of these exposures. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Qualifying Instrument Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the instrument deemed to be of comparable investment quality by the reporting bank, and the issuer has securities listed on a recognized stock exchange or not. List of values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Quote Method Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates the method of quotation of foreign currency. Expected values are D Direct and I Indirect. A direct quote is expressed as 1 foreign currency = X local currency and indirect as 1 local currency = X foreign currency. EG: GBP 1 = USD 1.2 Direct, 45 INR = USD 1 Indirect Quote.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Change Rounding Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Rate change round code is defined as the method used for rounding of the interest rate change. The cash flow engine uses RATE_CHG_RND_CODE to determine the rounding method that is applied to the current rate after a repricing event. RATE_CHG_ RND_CODE is used in conjunction with RATE_CHG_RND_FAC. List of values are Truncate, Round Up, Round down and Round nearest.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Change Rounding Factor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the value to which forecasted interest rates are rounded. The rate change factor is read with rate change round code. Truncate rate change round code would not have any factor as the decimal is ignored by the engine.\n\nRound Up rate change code  will round the interest to the nearest integer by the factor mentioned in the column. Example, if the unrounded forecasted rate is 8.65 and the RATE_CHG_RND_FAC = 0.5, the rounded forecasted rate = 9.00.\n\nRound down rate change code  will round down by the factor mentioned in the column to the nearest integer. Some instance it can round it to the nearest 0.5 as well. Example, if the unrounded forecasted rate is 8.65 and the RATE_CHG_RND_FAC = 0.25, the rounded forecasted rate = 8.50\n\nRound Nearest  The cash flow engine rounds the rate to the nearest multiple of RATE_CHG_RND_FAC. For example, if the unrounded forecasted rate is 8.65 and the RATE_CHG_RND_FAC = 0.25, the rounded forecasted rate = 8.75.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rating Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code representing the rating of the Instrument or the exposure.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Recalcitrant Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether this account is considered to be a recalcitrant account. A Recalcitrant account is defined as an account that, 1, fails to comply with reasonable requests for information pursuant to IRS mandated verification and due diligence procedures to identify US Accounts,, 2, fails to provide a name, address and taxpayer identification number or, 3, fails to provide a bank secrecy waiver upon request. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Receivable Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the ISO currency code for the receive leg of an account or contract. It is mainly applicable for Swap and FX related contracts, e.g. FX Spots, FX Forwards, FX Futures.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Receivable Leg Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the receivable leg amount which is used in cross currency swap contract. This column will store the receivable leg currency amount which is used in cross currency swap. This is commonly used in FX, SWAP type of contracts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Reciprocal Cross Holding Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicates if the exposure has reciprocal cross holding or not. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Referral Line Of Business Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Line of Business that is responsible to acquiring the account. Line of business, LOB, is a functional unit that offers the products of the financial entity to the customer. Example: Corporate Finance, Trade Services, Private Wealth Management, Treasury Services, Retail Banking, Cards services etc. This column Refers to the unique code of the line of business applicable to the respective product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Region Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the geographical grouping of the market based on certain common characteristics like language, ethnicity, country, continent, city and state. The region can vary based on the definition of market. Global market vs local market can have different definition of region.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Regular Way Traded Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the securities settlement contractually occurs within the period of time, after the trade date, generally established by regulations or conventions in the marketplace or exchange in which the transaction is being executed. It is a type of trade that is settled through the regular settlement cycle required for the particular investment being traded. The settlement cycle is the time that the regulations of the securities market allows for the buyer to complete payment and for the seller to deliver the goods being purchased. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Regulatory Capital Investment Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is a regulatory investment or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remaining Tenor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the remaining tenor of the account. Tenor is the term to maturity. The remaining tenor is computed as Maturity Date  As Of Date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remaining Tenor Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Remaining term unit is used in conjunction with remaining term to determine the remaining term of an account as on processing date. List of values are D Day, M Month and Y Year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repayment Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the type of repayment associated with the account. Indicated values are Conventional Fixed, Balloon, Adjustable Negative Amortizing, Rule of 78s, Level Principal, Conventional Adjustable etc. Conventional Amortization  This AMRT_TYPE_CD conventionally amortizes a record whose cash flows are defined in the PAYMENT_SCHEDULE table. Payment amounts should contain both principal + interest. Level Principal Payment Schedule  This AMRT_TYPE_CD level principal amortizes a record whose cash flows are defined in the PAYMENT_SCHEDULE table. Payment amounts should contain principal only. Negative amortization is applicable when the payment amount is not sufficient to cover the interest component of the loan for the period. Rule of 78 loans have a pre computed schedule.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Secured Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account or contract number is secured with a collateral or not. The collaterals to be considered here will be the collaterals other than margins. In case of deposits, this indicates it is Collateralized or Secured Deposit. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securitized Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the exposure is securitized or not. Securitize refers to a pooled group of financial assets that together create a new security, which is then marketed and sold to investors. The value and cash flows of the new security are based off of the underlying value and cash flows of the assets used in the securitization process. Companies will securitize illiquid assets into liquid assets in order to increase their overall liquidity and generate immediate proceeds from their assets. List of values are Y, N. If the value is updated as Y means the exposure is securitized and if the value is updated as N means the exposure is not securitized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settled In Home Country Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the instrument is settled in home country or not. List of values are Y and N. If the value is updated as Y the instrument is settled in home country, means where is instrument is originated, and if the value is updated as N the instrument is settled in outside the home country.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Country Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the ISO code of the country where the trade or transaction is expected to settle. There are several popular country codes as part of ISO 3166 standard published by the International Organization for Standardization. ISO 3166 defines codes for the names of countries, dependent territories, special areas of geographical interest and their principal subdivisions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date at which a security transaction must be paid by the buyer and the securities delivered by the seller. Stocks and bonds have a settlement date of three business days subsequent to the trade date . Listed options and government securities must be settled by the next business day. This is different from contract settlement date. A contract can have multiple settlements in different settlement types.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of days required for settlement after the transaction is performed. Usually the number of business days is captured here. In case of T Plus 2 settlement, it would store a value of 2.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Delinquency Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to past due days settlement amount is due for.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the settlement mechanisms used for secured and foreign exchange products. Expected values for secured tables are T  TRIPARTY, B  BILATERAL and O OTHER. Expected values for foreign exchange tables are C CLS,B  BILATERAL and O  OTHER.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Short Position Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag Indicates whether the derivative position is short or long. Short position is defined as the sale of a borrowed security, commodity or currency with the expectation that the asset will fall in value. Long position is defined as the buying of a security such as a stock, commodity or currency, with the expectation that the asset will rise in value. List of Values are Y and N. If the value is updated as Y means the derivative position is short position and if the value is updated as N means the derivative position is long position.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sold Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the sold amount for an account. Typically, in FX contract, an amount is bought in one currency and sold in another currency at a predetermined exchange rate. Hence this is the sold amount specified in the selling currency rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sold Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the unique identifier of the sold ISO currency code. Typically, in FX contract, an amount is bought in one currency and sold in another currency at a predetermined exchange rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Solvency Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates Whether General Market Risk is required, Y indicates only general market risk, N indicates only specific market risk and NULL indicates both general market risk and specific market risk. he list of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Specific Wrong Way Risk Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if any of the individual transactions conducted under the agreement with the given counterparty legal entity is considered a wrong way risk position. Possible options are Specific, General, and None. The BHC should use its internal BAU risk management process to determine whether an given transaction with the specific counterparty legal entity is a wrong way risk position, and if so whether it constitutes specific WWR or not. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Spot Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Long",
                    "gcd": "Refers to the spot rate of the currency pair on the deal date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Standard Business Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the standard business days for settlement. This is useful to determine if the transaction is a long settlement transaction or not. Long Settlement Transactions are transactions where a counterparty undertakes to deliver a security, a commodity, or a foreign exchange amount against cash, other financial instruments, or commodities, or vice versa, at a settlement or delivery date that is contractually specified as more than the lower of the market standard for this particular instrument and five business days after the date on which the bank enters into the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Standing Instructions To Us Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether there are standing instructions to transfer funds from this account to an account maintained in the United States. This is required for FATCA purpose. If the value is updated as Y means there are standing instructions to transfer funds to US account and if the value is updated as N means there are no instructions to transfer funds from the account to US account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Start Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the contract becomes effective.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Strike Rate Or Price",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the strike price or strike rate. In case of options, this stores the strike price. Strike price is the price at which an option to buy or to sell can be exercised. This is predetermined at the time of entering into the contract. In case of forward rate agreements, Refers to the forward rate of interest for the contract period as agreed between the parties. This column is also applicable to instruments like bullet swaps, equity total return swap, equity variance swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Tax Exempt Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to percent of interest income that is tax exempt. For instance, if 40 percent of interest income is exempt from tax and the balance is taxable, then this field would store 40 percent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Tax Expense",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the tax amount associated with this account. This is the actual tax amount withheld by the financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Tenor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the tenor for which exchange rate is being provided. This is applicable for forward exchange rates. For example, If three month forward rate is being given then this attribute will store 3 and tenor unit will be M. In case of spot and overnight rates this must be filled as 0. Tenor or maturity of the instrument like swap, FRA, Starting Tenor. In case of swaption this represents option tenor. This attribute is read together with Tenor Unit. This is required only for Single name credit default swap and credit index swaps. Also Refers to contractual term at origination date. Maturity Date is equal to Origination Date plus Origination Term.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Tenor Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the unit in which tenor of instrument is given. This attribute must be read together with Tenor. Expected values are ON  Overnight, TN  Tomorrow next, SN  Spot next, D  calendar days, BD  business days, W  weeks, M  months, Y  years. When unit is ON, TN, SN or Date then Tenor will be null. This is required only for Single name credit default swap and credit index swaps.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Third Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the third currency in which profits are realized in a triangular arbitrage transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Time To Collateral Posting In Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to Time to Collateral Posting in days. Time to collateral posting is the time after rating of the legal entity are downgraded and there is requirement to post additional collateral.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Fees And Charges",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total fees and charges collected or levied by the bank. This includes penal charges, fees, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Trading Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of a trading account number held by the customer. Trading account is an account similar to a traditional bank account, holding cash and securities, and is administered by an investment dealer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Trading Desk Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the trading desk that has entered into a trade. Banks has various trading desks specializing for specific products, like Interest Rate Products, Equity, Commodities, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unconditionally Cancellable Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates if the exposure or claim is unconditionally cancellable or conditionally cancellable, e.g. cancellable upon certain events, or not cancellable. In certain countries, retail commitments are considered unconditionally cancellable if the terms permit the bank to cancel them to the full extent allowable under consumer protection and related legislation. List of values are Y  Unconditionally Cancellable, C  Conditionally Cancellable and N or NULL  Not Cancellable.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Unique identifier of an underlying of derivative product. In case of an instrument underlying, underlying code will be same as instrument code and in case of contract underlying, for products like swaption, underlying code will be unique generated code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Face Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the underlying face value. This field is used for Bond underlying.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Instrument Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the instrument code of the underlying of the derivative. In case of convertible bonds, the code of the equity instrument is stored, in case of basket options, multiple codes separated by # are to be stored. Instrument Contract dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Instrument Type Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the underlying or reference instrument type code of the asset. In the case of derivatives, Refers to the information about the instrument type of reference asset on which this derivative contract has been entered into. For example, a call option on a bond will have the underlying instrument type as Bond. Instrument Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Unit Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unit of underlying. For instance gm in case of gold, Quintal in case of commodity. This is used mainly for instruments like commodity swaps. Possible values are bushels, LB, Barrels, KG, Gram, Quintal etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unit Or Index Linked Funds Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Flag indicates if the portfolio is unit linked or index linked portfolio. List of values Y  Unit or Index Linked, N  Not unit or index linked.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unrealized Gain Or Loss",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the unrealized gain or loss on exposure. Profit and Losses are classified into realized and unrealized profit or loss. Realized gain refers to the gain realized by selling or buying a security. Unrealized gain or loss refers to notional gain or loss which is not yet realized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unrealized General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Contains the GL code corresponding to the ledger account that holds unrealized amount. Unrealized gains and losses are simply those amounts that are the result of what a position is worth versus what you paid for it. The net off of \nthe profit or loss should be treated within this GL. If the entry is in \ncredit side of the gl it would be unrealized profit and an entry in debit \nside would represent unrealized loss. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Us Indicia Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Flag indicates if the account has US Indicia. US Indicia indicates presence of any of the following: US Citizenship or lawful or permanent resident, US birth place, US address, Instructions to transfer funds to US Accounts or directions regularly received from a US address etc. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Value Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the value date of the contract. Value Date is a securities industry term describing the date on which a trade, bonds, equities, foreign exchange, commodities, etc., settles. That is, the actual day on which transfer of cash or assets is completed, or the settlement amount is calculated. \nIn case of FX swap instrument Refers to the settlement date for spot or near leg. Also considered as the date on which the contract becomes effective.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Write Off General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds write off amount. The write off impacts the Profit and Loss account of the enterprise. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [
                {
                    "dqId": "DQCLREF187",
                    "btLogicalName": "Fees For Effective Interest Rate",
                    "dqDesc": "Should Be Greater Than or equal to 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQCLREF188",
                    "btLogicalName": "Effective Interest Rate For Hedge Management",
                    "dqDesc": "Should be greater than 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQCLREF189",
                    "btLogicalName": "Percentage Sold",
                    "dqDesc": "Should have values greater than or equal 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQCLREF190",
                    "btLogicalName": "Mitigant Market Value",
                    "dqDesc": "Should have values greater than 0",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQCLREF191",
                    "btLogicalName": "Contract Quantity",
                    "dqDesc": "should have values greater than 0",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQCLREF192",
                    "btLogicalName": "Loss Given Default Percentage",
                    "dqDesc": "Should be greater than 0 if not null.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQCLREF193",
                    "btLogicalName": "Bought Amount",
                    "dqDesc": "Should be greater than or equal to 0",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQCLREF194",
                    "btLogicalName": "Market Value",
                    "dqDesc": "Should be greater than 0",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQCLREF195",
                    "btLogicalName": "Interest Accrued Amount",
                    "dqDesc": "Should have values greater than 0",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQCLREF196",
                    "btLogicalName": "Notional Amount",
                    "dqDesc": "Should have values greater than 0",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQCLREF197",
                    "btLogicalName": "Amortization Term",
                    "dqDesc": "Should Be Greater Than Or Equal To 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQCLREF30",
                    "btLogicalName": "Book Date",
                    "dqDesc": "It should be less than or equal to As OF Date.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQCLREF31",
                    "btLogicalName": "Closed Date",
                    "dqDesc": "Should be less than or equal to As Of Date",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV08",
                    "btLogicalName": "Book Type",
                    "dqDesc": "Should have list of values as TRADING or BANKING",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31695",
                    "btLogicalName": "Approved By State Government Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31696",
                    "btLogicalName": "Capital Charge Exclusion Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31697",
                    "btLogicalName": "Exposure Held At Fair Value Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31698",
                    "btLogicalName": "Failed Trade Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31699",
                    "btLogicalName": "Long Settlement Transaction Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31700",
                    "btLogicalName": "Margin Required Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31701",
                    "btLogicalName": "Materiality Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31702",
                    "btLogicalName": "Over The Counter Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31703",
                    "btLogicalName": "Qualifying Instrument Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31704",
                    "btLogicalName": "Quote Method Indicator",
                    "dqDesc": "Should have list of values as D,I",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31705",
                    "btLogicalName": "Remaining Tenor Unit",
                    "dqDesc": "Should have list of values as D,M,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31706",
                    "btLogicalName": "Short Position Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31707",
                    "btLogicalName": "Tenor Unit",
                    "dqDesc": "Should have list of values as D,M,W,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31708",
                    "btLogicalName": "Contract Unwinding Trigger Loss Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31709",
                    "btLogicalName": "Fiduciary Relationship Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31710",
                    "btLogicalName": "Exchange Of Principal Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31711",
                    "btLogicalName": "Government Paper Same Currency Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31712",
                    "btLogicalName": "Guaranteed By Sovereign Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31713",
                    "btLogicalName": "Internal Customer Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31714",
                    "btLogicalName": "Nettability Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31715",
                    "btLogicalName": "Operational Relationship Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31716",
                    "btLogicalName": "Foreclosure Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31717",
                    "btLogicalName": "Payment Netting Agreement Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31718",
                    "btLogicalName": "Settled In Home Country Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31719",
                    "btLogicalName": "Amortization Term Unit",
                    "dqDesc": "Should have list of values as D,M,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31720",
                    "btLogicalName": "Brokerage Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31721",
                    "btLogicalName": "Claim Foreign Currency And Bank Funding Currency Same Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31722",
                    "btLogicalName": "Diversified Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31723",
                    "btLogicalName": "External Customer Branch International Banking Facility Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31724",
                    "btLogicalName": "Held By Client Or Proprietary Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31725",
                    "btLogicalName": "Power Of Attorney Or Signatory Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31726",
                    "btLogicalName": "Reciprocal Cross Holding Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31727",
                    "btLogicalName": "Regular Way Traded Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31728",
                    "btLogicalName": "Prime Brokerage Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31729",
                    "btLogicalName": "Protection Buy Sell Indicator",
                    "dqDesc": "Should have list of values as B,S",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31730",
                    "btLogicalName": "Amortization Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31731",
                    "btLogicalName": "Approved By Central Government Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31732",
                    "btLogicalName": "Buy Or Sell Indicator",
                    "dqDesc": "Should have list of values as B,S",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31733",
                    "btLogicalName": "Compounding Frequency Unit",
                    "dqDesc": "Should have list of values as D,M,W,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31734",
                    "btLogicalName": "International Banking Facility Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31735",
                    "btLogicalName": "Securitized Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31736",
                    "btLogicalName": "Unconditionally Cancellable Indicator",
                    "dqDesc": "Should have list of values as C,N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31737",
                    "btLogicalName": "Specific Wrong Way Risk Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31738",
                    "btLogicalName": "Account Or Contract Closed Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31739",
                    "btLogicalName": "Cleared Transaction Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31740",
                    "btLogicalName": "Marked Pay Obligations By Variable Interest Entity Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31741",
                    "btLogicalName": "Office Of Foreign Asset Control Reason Indicator",
                    "dqDesc": "Should have list of values as D,F,N,O,P,V",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31742",
                    "btLogicalName": "Recalcitrant Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31743",
                    "btLogicalName": "Secured Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31744",
                    "btLogicalName": "Standing Instructions To Us Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31745",
                    "btLogicalName": "End Of Month Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31746",
                    "btLogicalName": "Regulatory Capital Investment Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31747",
                    "btLogicalName": "Solvency Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31748",
                    "btLogicalName": "Unit Or Index Linked Funds Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31749",
                    "btLogicalName": "Contract Walk Away Clause Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31750",
                    "btLogicalName": "Us Indicia Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQLOV31751",
                    "btLogicalName": "Portfolio Liquid Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQMNDTR57",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQMNDTR58",
                    "btLogicalName": "Effective Date",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQMNDTR59",
                    "btLogicalName": "End Of Period Balance",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35687",
                    "btLogicalName": "Adjustment Effective Date",
                    "dqDesc": "Reference Check for Adjustment Effective Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35688",
                    "btLogicalName": "Adjustment Effective Date",
                    "dqDesc": "Reference Check for Adjustment Effective Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35689",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35690",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35691",
                    "btLogicalName": "Book Date",
                    "dqDesc": "Reference Check for Book Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35692",
                    "btLogicalName": "Book Date",
                    "dqDesc": "Reference Check for Book Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35693",
                    "btLogicalName": "Closed Date",
                    "dqDesc": "Reference Check for Closed Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35694",
                    "btLogicalName": "Closed Date",
                    "dqDesc": "Reference Check for Closed Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35695",
                    "btLogicalName": "Commission Date",
                    "dqDesc": "Reference Check for Commission Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35696",
                    "btLogicalName": "Commission Date",
                    "dqDesc": "Reference Check for Commission Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35697",
                    "btLogicalName": "Contract Date",
                    "dqDesc": "Reference Check for Contract Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35698",
                    "btLogicalName": "Contract Date",
                    "dqDesc": "Reference Check for Contract Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35699",
                    "btLogicalName": "Effective Maturity Date",
                    "dqDesc": "Reference Check for Effective Maturity Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35700",
                    "btLogicalName": "Effective Maturity Date",
                    "dqDesc": "Reference Check for Effective Maturity Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35701",
                    "btLogicalName": "Effective Date",
                    "dqDesc": "Reference Check for Effective Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35702",
                    "btLogicalName": "Effective Date",
                    "dqDesc": "Reference Check for Effective Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35703",
                    "btLogicalName": "Fatca Reporting Period End Date",
                    "dqDesc": "Reference Check for Fatca Reporting Period End Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35704",
                    "btLogicalName": "Fatca Reporting Period End Date",
                    "dqDesc": "Reference Check for Fatca Reporting Period End Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35705",
                    "btLogicalName": "Last Payment Date",
                    "dqDesc": "Reference Check for Last Payment Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35706",
                    "btLogicalName": "Last Payment Date",
                    "dqDesc": "Reference Check for Last Payment Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35707",
                    "btLogicalName": "Maturity Date",
                    "dqDesc": "Reference Check for Maturity Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35708",
                    "btLogicalName": "Maturity Date",
                    "dqDesc": "Reference Check for Maturity Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35709",
                    "btLogicalName": "Pending Collateral Delivery Date",
                    "dqDesc": "Reference Check for Pending Collateral Delivery Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35710",
                    "btLogicalName": "Pending Collateral Delivery Date",
                    "dqDesc": "Reference Check for Pending Collateral Delivery Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35711",
                    "btLogicalName": "Settlement Date",
                    "dqDesc": "Reference Check for Settlement Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35712",
                    "btLogicalName": "Settlement Date",
                    "dqDesc": "Reference Check for Settlement Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35713",
                    "btLogicalName": "Start Date",
                    "dqDesc": "Reference Check for Start Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35714",
                    "btLogicalName": "Start Date",
                    "dqDesc": "Reference Check for Start Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35715",
                    "btLogicalName": "Value Date",
                    "dqDesc": "Reference Check for Value Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35716",
                    "btLogicalName": "Value Date",
                    "dqDesc": "Reference Check for Value Date in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35717",
                    "btLogicalName": "Account Classification Code",
                    "dqDesc": "Reference Check for Account Classification Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35718",
                    "btLogicalName": "Account Manager Code",
                    "dqDesc": "Reference Check for Account Manager Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35719",
                    "btLogicalName": "Account Purpose Code",
                    "dqDesc": "Reference Check for Account Purpose Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35720",
                    "btLogicalName": "Account Type",
                    "dqDesc": "Reference Check for Account Type in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35721",
                    "btLogicalName": "Interest Accrued General Ledger Code",
                    "dqDesc": "Reference Check for Interest Accrued General Ledger Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35722",
                    "btLogicalName": "Account Status Code",
                    "dqDesc": "Reference Check for Account Status Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35723",
                    "btLogicalName": "Accounting Standard Code",
                    "dqDesc": "Reference Check for Accounting Standard Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35724",
                    "btLogicalName": "Adjustment Type",
                    "dqDesc": "Reference Check for Adjustment Type in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35725",
                    "btLogicalName": "Agency Code",
                    "dqDesc": "Reference Check for Agency Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35726",
                    "btLogicalName": "Amortization Method For Premium Discount And Fees Code",
                    "dqDesc": "Reference Check for Amortization Method For Premium Discount And Fees Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35727",
                    "btLogicalName": "Application Number",
                    "dqDesc": "Reference Check for Application Number in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35728",
                    "btLogicalName": "Barrier Type",
                    "dqDesc": "Reference Check for Barrier Type in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35729",
                    "btLogicalName": "Benchmark Currency Code",
                    "dqDesc": "Reference Check for Benchmark Currency Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35730",
                    "btLogicalName": "Benchmark Code",
                    "dqDesc": "Reference Check for Benchmark Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35731",
                    "btLogicalName": "Book Type",
                    "dqDesc": "Reference Check for Book Type in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35732",
                    "btLogicalName": "Bought Currency Code",
                    "dqDesc": "Reference Check for Bought Currency Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35733",
                    "btLogicalName": "Branch Code",
                    "dqDesc": "Reference Check for Branch Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35734",
                    "btLogicalName": "Business Domain",
                    "dqDesc": "Reference Check for Business Domain in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35735",
                    "btLogicalName": "Business Segment Code",
                    "dqDesc": "Reference Check for Business Segment Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35736",
                    "btLogicalName": "Business Unit Code",
                    "dqDesc": "Reference Check for Business Unit Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35737",
                    "btLogicalName": "Third Currency Code",
                    "dqDesc": "Reference Check for Third Currency Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35738",
                    "btLogicalName": "Acquisition Channel Code",
                    "dqDesc": "Reference Check for Acquisition Channel Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35739",
                    "btLogicalName": "Cleared Transaction Bank Role Code",
                    "dqDesc": "Reference Check for Cleared Transaction Bank Role Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35740",
                    "btLogicalName": "Commitment Contract Code",
                    "dqDesc": "Reference Check for Commitment Contract Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35741",
                    "btLogicalName": "Common Chart Of Account Code",
                    "dqDesc": "Reference Check for Common Chart Of Account Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35742",
                    "btLogicalName": "Account Or Contract Number",
                    "dqDesc": "Reference Check for Account Or Contract Number in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35743",
                    "btLogicalName": "Contract Unwinding Trigger Code",
                    "dqDesc": "Reference Check for Contract Unwinding Trigger Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35744",
                    "btLogicalName": "Counterparty Rating",
                    "dqDesc": "Reference Check for Counterparty Rating in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35745",
                    "btLogicalName": "Country Code",
                    "dqDesc": "Reference Check for Country Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35746",
                    "btLogicalName": "Country Code Of Risk",
                    "dqDesc": "Reference Check for Country Code Of Risk in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35747",
                    "btLogicalName": "Credit Status Code",
                    "dqDesc": "Reference Check for Credit Status Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35748",
                    "btLogicalName": "Data Source Code",
                    "dqDesc": "Reference Check for Data Source Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35749",
                    "btLogicalName": "Day Count Indicator",
                    "dqDesc": "Reference Check for Day Count Indicator in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35750",
                    "btLogicalName": "Dealer Identifier",
                    "dqDesc": "Reference Check for Dealer Identifier in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35751",
                    "btLogicalName": "Dealer Identifier",
                    "dqDesc": "Reference Check for Dealer Identifier in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35752",
                    "btLogicalName": "Delinquency Status Code",
                    "dqDesc": "Reference Check for Delinquency Status Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35753",
                    "btLogicalName": "Fee General Ledger Code",
                    "dqDesc": "Reference Check for Fee General Ledger Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35754",
                    "btLogicalName": "Fund Code",
                    "dqDesc": "Reference Check for Fund Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35755",
                    "btLogicalName": "Fund Type",
                    "dqDesc": "Reference Check for Fund Type in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35756",
                    "btLogicalName": "General Ledger Account Code",
                    "dqDesc": "Reference Check for General Ledger Account Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35757",
                    "btLogicalName": "Guarantor Identifier",
                    "dqDesc": "Reference Check for Guarantor Identifier in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35758",
                    "btLogicalName": "Hedge Portfolio Set Code",
                    "dqDesc": "Reference Check for Hedge Portfolio Set Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35759",
                    "btLogicalName": "Holding Type",
                    "dqDesc": "Reference Check for Holding Type in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35760",
                    "btLogicalName": "Holiday Rolling Convention Code",
                    "dqDesc": "Reference Check for Holiday Rolling Convention Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35761",
                    "btLogicalName": "Instrument Code",
                    "dqDesc": "Reference Check for Instrument Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35762",
                    "btLogicalName": "Instrument Type",
                    "dqDesc": "Reference Check for Instrument Type in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35763",
                    "btLogicalName": "Internal Customer Branch Code",
                    "dqDesc": "Reference Check for Internal Customer Branch Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35764",
                    "btLogicalName": "Interest Calculation Method",
                    "dqDesc": "Reference Check for Interest Calculation Method in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35765",
                    "btLogicalName": "Interest Timing Type",
                    "dqDesc": "Reference Check for Interest Timing Type in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35766",
                    "btLogicalName": "Interest Rate Type",
                    "dqDesc": "Reference Check for Interest Rate Type in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35767",
                    "btLogicalName": "Issuer Identifier",
                    "dqDesc": "Reference Check for Issuer Identifier in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35768",
                    "btLogicalName": "Issuer Identifier",
                    "dqDesc": "Reference Check for Issuer Identifier in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35769",
                    "btLogicalName": "Legal Entity Code",
                    "dqDesc": "Reference Check for Legal Entity Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35770",
                    "btLogicalName": "Line Code",
                    "dqDesc": "Reference Check for Line Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35771",
                    "btLogicalName": "Line Of Business Code",
                    "dqDesc": "Reference Check for Line Of Business Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35772",
                    "btLogicalName": "Loss Share Agreement Code",
                    "dqDesc": "Reference Check for Loss Share Agreement Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35773",
                    "btLogicalName": "Netting Agreement Code",
                    "dqDesc": "Reference Check for Netting Agreement Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35774",
                    "btLogicalName": "Option Type",
                    "dqDesc": "Reference Check for Option Type in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35775",
                    "btLogicalName": "Organization Unit Code",
                    "dqDesc": "Reference Check for Organization Unit Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35776",
                    "btLogicalName": "Original Account Number",
                    "dqDesc": "Reference Check for Original Account Number in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35777",
                    "btLogicalName": "Ownership Type",
                    "dqDesc": "Reference Check for Ownership Type in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35778",
                    "btLogicalName": "Parent Account Number",
                    "dqDesc": "Reference Check for Parent Account Number in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35779",
                    "btLogicalName": "Party Identifier",
                    "dqDesc": "Reference Check for Party Identifier in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35780",
                    "btLogicalName": "Pay Currency Code",
                    "dqDesc": "Reference Check for Pay Currency Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35781",
                    "btLogicalName": "Payoff General Ledger Code",
                    "dqDesc": "Reference Check for Payoff General Ledger Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35782",
                    "btLogicalName": "Portfolio Code",
                    "dqDesc": "Reference Check for Portfolio Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35783",
                    "btLogicalName": "Product Code",
                    "dqDesc": "Reference Check for Product Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35784",
                    "btLogicalName": "Provision General Ledger Code",
                    "dqDesc": "Reference Check for Provision General Ledger Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35785",
                    "btLogicalName": "Rating Code",
                    "dqDesc": "Reference Check for Rating Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35786",
                    "btLogicalName": "Receivable Currency Code",
                    "dqDesc": "Reference Check for Receivable Currency Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35787",
                    "btLogicalName": "Referral Line Of Business Code",
                    "dqDesc": "Reference Check for Referral Line Of Business Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35788",
                    "btLogicalName": "Region Code",
                    "dqDesc": "Reference Check for Region Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35789",
                    "btLogicalName": "Repayment Type",
                    "dqDesc": "Reference Check for Repayment Type in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35790",
                    "btLogicalName": "Settlement Country Code",
                    "dqDesc": "Reference Check for Settlement Country Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35791",
                    "btLogicalName": "Settlement Type",
                    "dqDesc": "Reference Check for Settlement Type in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35792",
                    "btLogicalName": "Sold Currency Code",
                    "dqDesc": "Reference Check for Sold Currency Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35793",
                    "btLogicalName": "Trading Desk Identifier",
                    "dqDesc": "Reference Check for Trading Desk Identifier in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35794",
                    "btLogicalName": "Underlying Code",
                    "dqDesc": "Reference Check for Underlying Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35795",
                    "btLogicalName": "Underlying Instrument Type Code",
                    "dqDesc": "Reference Check for Underlying Instrument Type Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35796",
                    "btLogicalName": "Underlying Instrument Code",
                    "dqDesc": "Reference Check for Underlying Instrument Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35797",
                    "btLogicalName": "Unrealized General Ledger Code",
                    "dqDesc": "Reference Check for Unrealized General Ledger Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                },
                {
                    "dqId": "DQREF35798",
                    "btLogicalName": "Write Off General Ledger Code",
                    "dqDesc": "Reference Check for Write Off General Ledger Code in Stage Foreign Exchange Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:21.0",
                    "modifiedDate": "2024-11-04 04:39:25.0"
                }
            ],
            "useCases": [
                {
                    "ucId": "ALM",
                    "ucName": "Asset Liability Management"
                },
                {
                    "ucId": "LLFP",
                    "ucName": "Oracle Loan Loss Forecasting and Provisioning"
                },
                {
                    "ucId": "LRM",
                    "ucName": "Liquidity Risk Management"
                },
                {
                    "ucId": "BASEL",
                    "ucName": "Regulatory Capital Adequency"
                },
                {
                    "ucId": "BSP",
                    "ucName": "Balance Sheet Planning"
                },
                {
                    "ucId": "CIRCA",
                    "ucName": "Customer Analytics"
                },
                {
                    "ucId": "FTP",
                    "ucName": "Funds Transfer Pricing"
                },
                {
                    "ucId": "PFT",
                    "ucName": "Profitability Management"
                }
            ]
        }
    ]
}