{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "Account Close Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the account is closed. Account can be an active or closed, this column will remain blank till account is active. Accounts can be closed upon maturity, transfer or death of a customer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Closing Reason Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the attrition reason which describes the reason why customer has closed the contract or the account. Indicative values are Written off Customer, Pricing Dissatisfaction, Emigration, Unclaimed account, Low Usage, Fraud Customer, Product features dissatisfaction, Service Dissatisfaction, Reason Unknown, Deceased Customer and Transferred to non serviceable location etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Defaulted Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the account has defaulted. This is an account that is under prolonged delinquent state.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Manager Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the account manager is an employee who is responsible for the day to day management of accounts of a particular customer. The account manager is a point of contact, and provides customer support, up selling, technical assistance and general relationship management. An account manager may be in charge of a number of smaller accounts, or may focus on a few larger accounts. This column Refers to the account manager code or the unique employee identifier of the manager assigned by the financial institution. Management Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Or Contract Closed Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the account is closed. Account can be closed upon maturity of the account, transfer of the account, death of the account holder or write off.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Or Contract Number",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of the account or contract held by the customer. Account number is defined as numbers, letters or alphanumeric code assigned to every significant customer, supplier and lender for ease of reference in accounting records of the financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Purpose Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the purpose for which account has originated, purpose or special use of this account. Account purpose dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the status of the account. List of values can be Active, Inactive, in foreclosure, Re negotiated, Dispute, Frozen, Past Due, Closed etc. Account Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accounting Standard Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the accounting standard or the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. E.g. GAAP, IFRS etc. Generally Accepted Accounting Principles, GAAP. GAAP are the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. The Generally Accepted Accounting Principles exist to ensure that accountants are using the same or almost the same standards so that comparison of financial statements between or within a company is easy and accurate. They also promote transparency in accounting. However, GAAP provides broad guidelines, there is room for companies to follow an approach within a guideline.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accrual Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the accrual status codes. Accrual Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Acquisition Channel Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the channel through which customer was acquired.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Actual Number Of Business Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the actual Number of Business Days between Remargining for Capital Market Transaction or Revaluation for Secured Transaction. This information is required in the volatility hair cut calculation. When the frequency of remargining or revaluation is longer than the minimum, the minimum haircut numbers will be scaled up depending on the actual number of business days between remargining or revaluation using the square root of time formula.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Additional Fees For Effective Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to any additional fees received beyond the origination date. This data is used to compute the EIR effective interest rate. Additional fees received is for a particular period. For example, a loan is originated in 2010. Origination fees is USD100. Additional fees received in Sep 2015 is USD50. This column will store USD50 for Sep 2015.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjusted Loss Given Default Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the Adjusted LGD for an exposure and mainly used for Internal Model Method to arrive at RWA. This is expressed in decimal number, For example, 30 percent will be 0.3.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjustment Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier for adjustment type dimension at an account. Examples can be CONTRA,NEW etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Allocated Transfer Risk Reserve Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Allocated Transfer Risk Reserve, ATRR. An allowance for bad debts that a bank keeps in order to protect against country risk. For example, a bank may keep an ATRR in case a country renders its currency inconvertible, which would prevent a foreign borrower in that country from making payments. This is a requirement of FDIC regulation which mandates that a banking institution shall establish an allocated transfer risk reserve, ATRR, for specified international assets when required by the Board.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Method For Premium Discount And Fees Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the amortization method used for premium, discount and fees. Indicative values are STRAIGHTLINE or LEVELYIELD, LEVELYIELD being the default one.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amount Due In Next Twelve Months",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Amount Due In Next 12 Months.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Application Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the application number that was filled by the customer that formed the basis for the contract. Application is a document that provides the essential financial and other information about the borrower on which the lender bases the decision to lend.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "As Of Date",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Automatic Cancellation Of Commitment Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the contract has a feature of automatic cancellation in it. An automatic cancellable contract means that the contract can be cancelled automatically, if certain conditions mentioned in the contract agreement are satisfied. This is used for the assignment of credit conversion factor, in the case of Regulatory capital calculations like Basel.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Gross Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the average book balance for the latest month. The book balance is the term financial institutions use to describe the amount of money available before any adjustments have been made for deposits in transit, checks that have not yet been cleared, reserve requirements and interest received from 'float funds' hence is generally greater than end of period balance, Also called as 'gross balance'.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Backed By Bullion Liability Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is backed by bullion. Backed by bullion indicates that the exposure is backed by physical holdings of the gold metal. This can be useful to identify if a mutual fund or an exchange traded fund is backed by physical holdings of gold. At national discretion, gold bullion held in own vaults or on an allocated basis to the extent backed by bullion liabilities can be treated as cash and therefore risk weighted at 0 percent. In addition, cash items in the process of collection can be risk weighted at 20 percent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bank Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code or identifier of the financial institution which owns the transaction, assigned by the central bank. Bank identifier can be one of the following identifier or code: BIC Code, Bank Identifier Codes, ABA Code, Routing transfer number, IFSC Code, Indian Financial System Code, BCHH etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Banking Book Exposure Or CCR Hedge Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate that this exposure is used to hedge the banking book exposure or CCR.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Banks Own Estimate Of Credit Conversion Factor Percent",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the Credit Conversion Factor percent estimate by the bank. This is applicable only to the off balance amount or products and not to the bills contracts. Using this weight as factor, Risk weighted Assets are calculated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Behavior Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to unique identifier of behavior type code. Expected values are Non Maturity, Non Performing And Devolvement, Recovery, Volatile, Core and Non Core. \nThe payment and repricing characteristics can be gathered for most financial instruments, but for some the contractual cashflows may be absent or may be based on occurrence of certain events. Asset Liability Management allows you to define custom behavior, payment and repricing patterns to accurately model the unique characteristics for such instruments. Behavior pattern can be defined for the following types of instruments \nNon maturity Instruments,\nNon Performing Instruments,\nDevolvement and Recovery of Guarantees.\n\nOnce you create a behavior pattern, you can use it by mapping the unique behavior pattern code as the amortization type code for your instruments. Behavior pattern codes are defined within a pre set range, 70000 – 99999. When the cash flow engine encounters an instrument with an amortization type code within this pre determined range, it understands that a Behavior Pattern should be referenced for determining the principal cash flow amounts. Non performing Asset need not have a sub type associated, all the events i.e. substandard, doubtful or loss is processed. No interest cashflow will be generated and any balance on the maturity date would be written off. In the case of non maturity instruments the core and volatile runoff events are run. Interest cashflow is paid out on the payment dates. The engine assumes the maturity of the longest non maturing instrument as the maturity date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bonus Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the usage bonus amount of the account. Amount of bonus applicable in case of bonus forward. If at expiry, the market rate is at or above the Protected Rate, you are obliged to buy currency at the Protected Rate. However if the market is below the Protected Rate, you can receive a “Bonus Rate” unless the market trades at or below a pre agreed “Limit Rate”.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bonus Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the currency code in which bonus is specified. It is applicable to bonus forward. ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bonus Forward Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the contract is a bonus forward or regular forward. A Bonus Forward allows you to buy or sell foreign currency at an agreed “Protected Rate” of exchange, but with the potential to buy currency at an enhanced “Bonus Rate” if the market moves against you.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Book Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to if the contract is related to the banking book or trading book. Usually contracts like loans and leases are on the banking book. However, instruments like mortgage backed securities can be held on the trading book of the financial institution. If the value is updated as T then exposure or contract belongs to trading book and if the value is updated as B then it belongs to banking book.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Borrower Capital Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates that the borrower contributed the amount of capital required before the bank advances funds under the credit facility, and the capital contributed by the borrower or internally generated by the project is contractually required to remain in the project throughout the life of the project.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Borrower Cash Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates that the borrower contributed capital to the project in the form of cash or unencumbered readily marketable assets, or has paid development expenses out of pocket, of at least 15 percent of the real estate is appraised ‘‘as completed’’ value.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Branch Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the branch code. A branch, banking center or financial center is a retail location where a financial institution offers a wide array of face to face and automated services to its customers. This column Refers to the unique branch code assigned by the financial institution. A branch may specialize to offer certain type of products to customers. Branch needs approval from the regulators.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Brokerage Firm Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the brokerage firm involves in the investment contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Days Needed For Long Transaction",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the business days needed for Long Settlement Transactions, this signifies that number of business days to deliver the agreed items after date of transaction, future date. PFD Ref  Non Sec STD Long settlement transactions. As per Basel accord Annex 4 para no. 2B, Long Settlement Transactions are transactions where a counterparty undertakes to deliver a security, a commodity, or a foreign exchange amount against cash, other financial instruments, or commodities, or vice versa, at a settlement or delivery date that is contractually specified as more than the lower of the market standard for this particular instrument and five business days after the date on which the bank enters into the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Domain",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of the business domain., such as Institutional or Retail Brokerage. This is used to control access to data across distinct business operations.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Risk",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the level of risk associated with this account with respect to business characteristics. List of values are in the range of 0 10 with increasing values denoting increasing risk levels.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Segment Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique key identifying the business segment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Unit Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the business unit code as defined by the organization. A business unit is generally a broader definition and represents all the units in an organization. Business Unit dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Buy Base Currency Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether base currency is at buy position, Positive payout for buy position if FX is greater than or equal to Strike, or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Buy Or Sell Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates if the contract holder is the buyer or seller of the contract. This is applicable in case of derivative contracts like futures, forwards, options etc. A Buyer of a futures contract is said to be long while the seller is said to be short. In case of repo transactions, the party doing the reverse repo is referred to as the buyer. The seller of securities sells to the party with an agreement to buy back at a later date. List of Values are B, Buy, and S, Sell.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "CUSIP Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identification number issued to the instrument. CUSIP stands for 'Committee on Uniform Securities Identification Procedures' and refers to a 9 digit alphanumeric code assigned to all security issues approved for trading. By acting as a unique identifier for each security, CUSIPs help market participants avoid confusion and ensure that securities transactions are correctly matched and settled. Additionally, they are also needed to ensure that dividends, interest, and other payments are properly applied.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Calculation Option Display Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the choice between Just shifting the dates for holiday calendar and recalculating the payments based on the new dates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cancelled Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if contract is cancelled or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Capital Charge Exclusion Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the exposure will be excluded from the capital calculations.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Capital Market Exposure Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is a capital market exposure. The capital market exposures would include both their direct exposures and indirect exposures of a financial institution. This is applicable to India jurisdiction. As per Reserve Bank of India, following would qualify as a capital market exposure, CME, Direct investments in equity shares, convertible bonds, convertible debentures and units of equity oriented mutual funds the corpus of which is not exclusively invested in corporate debt, advances against shares or bonds or debentures or other securities or on clean basis to individuals for investment in shares, including IPOs or ESOPs, convertible bonds, convertible debentures, and units of equity oriented mutual funds, advances for any other purposes where shares or convertible bonds or convertible debentures or units of equity oriented mutual funds are taken as primary security, advances for any other purposes to the extent secured by the collateral security of shares or convertible bonds or convertible debentures or units of equity oriented mutual funds i.e. where the primary security other than shares or convertible bonds or convertible debentures or units of equity oriented mutual funds does not fully cover the advances, secured and unsecured advances to stockbrokers and guarantees issued on behalf of stockbrokers and market makers, loans sanctioned to corporate against the security of shares or bonds or debentures or other securities or on clean basis for meeting contribution of promoter to the equity of new companies in anticipation of raising resources, bridge loans to companies against expected equity flows or issues, underwriting commitments taken up by the banks in respect of primary issue of shares or convertible bonds or convertible debentures or units of equity oriented mutual funds. However, with effect from April 16, 2008, banks may exclude their own underwriting commitments, as also the underwriting commitments of their subsidiaries, through the book running process for the purpose of arriving at the capital market exposure of the solo bank as well as the consolidated bank. The position in this regard would be reviewed at a future date, financing to stockbrokers for margin trading, all exposures to Venture Capital Funds, both registered and unregistered.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Central Counterparty Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the central counterparty code which clears the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Central Counterparty Rejection Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the central counterparty has rejected the transaction. Transactions rejected by a qualifying central counterparty, because, for example, of a discrepancy in the details of the transaction such as in quantity, price, or in the underlying security, between the buyer and seller, potentially give rise to risk exposure to either party.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Claim And Funding Liability Similar Currency Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if exposure and collateral are denominated or associated with same currency or not. This is applicable for property and mortgage loans. The flag is applicable for Basel I calculations and identifies whether the Claims on central governments and central banks outside the OECD will also attract a zero weight, or a low weight if the national supervisory authority elects to incorporate interest rate risk. This is applicable in case of contracts involving collateral.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Claim Foreign Currency And Bank Funding Currency Same Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the financial institution is funded in the same currency as that of a claim. This is applicable in case of claims on foreign sovereigns. This is applicable to Basel regulation of India jurisdiction. Claims denominated in domestic currency of the foreign sovereign met out of the resources in the same currency raised in the jurisdiction of that sovereign will attract a risk weight of zero percent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cleared Transaction Bank Role Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of the cleared transaction role of the reporting bank. Cleared Transaction Bank Role dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cleared Transaction Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag Identifies if the transaction is cleared through central counterparty. Transactions included are, 1, between the clearing member and clearing member client and, 2, clearing member and central counterparty.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Clearing Member Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the identifier Refers to the code of the Clearing member through which the CCP clears the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commission Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the commission amount is received.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commission Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the commission amount earned by the financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commission Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the commission rate applicable for the contract. This is the rate applied on the total contract amount or availed amount based on agreement to compute the total commission amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commitment Contract Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of commitment contract code. Commitment contract covers the, irrevocable, committed portion of the facility extended to the customer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Common Chart Of Account Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the chart of accounts is a listing of the names of the accounts that a financial institution has identified and made available for recording transactions in its general ledger. A financial institution has the flexibility to define its chart of accounts as per requirement, including adding accounts as needed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Compounding Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to compounding frequency, which is used calculate interest income. Compounded interest is calculated only when the compounding frequency is <less than payment frequency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Compounding Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the unit of compounding frequency, possible values are D, for days, BD, for business days, W, for Weeks, M, for month, y, for Year. Column is applicable for instruments like Equity convertible bond.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the contract amount associated with the letter of credit contract. In case of LC it is the maximum amount available under the letter of credit contract. In case of loan contracts, Refers to the total loan amount. In case of derivatives, Refers to the notional principal or contract value. In case of investments, Refers to the investment amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Origination Price",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the price at which the futures contract was trading at the time of origination.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Quantity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the contract quantity associated with the contract. One contract of a derivative like forwards can have multiple quantity associated with it.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Start Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the contract begins.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Term",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the duration of the futures contract and is stored as term point. For example if term point is 3 month then 3 will be stored here. Usually, the term of the futures contract is monthly and quarterly.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Term Multiplier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the unit of the contract term in D Days, M Months, Q Quarter or Y Years. This should be used in conjunction with Contract Term to define the term of the contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Walk Away Clause Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the contract contains a walk away clause for Over the Counter derivative transactions and Securities Financing transactions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Conversion Factor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the conversion factor is provided by the exchange as a daily value for the underlying instrument, which is used to calculate the cheapest to Deliver set of instruments.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Country Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the country code associated with the account or instrument or party or location. There are several popular country codes as part of ISO 3166 standard published by the International Organization for Standardization. ISO 3166 defines codes for the names of countries, dependent territories, special areas of geographical interest and their principal subdivisions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Country Code Of Risk",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the ISO country code of the risk. Country of risk refers to the country wherein the counter party does business. Dim Country is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the current performance status of the account. List of values are Delinquent, Foreclosed, Impaired, Closed, Disposed, Transferred, Bankrupt etc. Credit Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Deferred Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to deferred current balance refers to Current un amortized deferred balance representing future income or expense such as premium or discount. Deferred Current Balance holds the discount or premium associated with an instrument. A discount loan or instrument is one with interest deducted from the face value of the loan at its origination. The discount amount is the difference between the loans current market price and its stated par value. The deferred current balance, which represents income, will be amortized over the life of the instrument according to a constant yield calculation. Therefore, as the instrument approaches maturity, the book balance approaches the face value or par balance. For discounted instruments, the deferred current balance is a negative balance. This indicates to the cash flow engine that the balance is income.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Write Off Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount written off once the loan or receivable has turned bad. This is done when no recovery is possible and the due date of repayment has elapsed a while ago. The write off amount is for the current period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Daily Receipt Payment Cash Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Indicates if the instrument is subject to daily receipt and payment of cash variation. This is applicable in case of margin accounts and contracts with margin requirements. Margin requirements are common in case of exchange traded derivatives that are marked to market on a daily basis.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Jurisdiction",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the mantas classification associated with this record. This can be a jurisdiction which represents geographical or legal entity monitoring on data restrictions. Values can be AMEA, INDV, CORP etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source system from where data is extracted. Data can be sourced from multiple sources, this column will Refers to the source code from where the data is extracted for this extraction date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Day Count Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the day count indicator. Expected values are A/360, A/365, A/A, 30/360, 30/360 EUROPEAN, 30/A. Suggested default value are 1=30/360 for amortizing transactions OR 3=Act/Act. for non amortization.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Day Count Indicator Payable Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the day count indicator such as A/360, A/365, A/A, 30/360, 30/360 EUROPEAN, 30/A etc. for payable leg. Also used for measuring time when calculating volatility or interpolating volatility. Column is applicable for instruments like European swaption.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Day Count Indicator Receive Leg",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the day count indicator such as A/360, A/365, A/A, 30/360, 30/360 EUROPEAN, 30/A etc. for receivable leg.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Deal Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to unique identifier of the different legs of a same deal. For example In cleared transaction contracts where the one transaction is between clearing member and client i.e. Leg 1 and the other between clearing member and the CCP i.e. Leg 2. Leg 1 and Leg 2 are expected to have the same information D1 as deal id.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Debt Value Adjustments",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to DVA which is all unrealized gains and losses that have resulted from changes in the fair value of liabilities that are due to changes in own credit risk of the bank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delinquency Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of days the account has remained delinquent in the current delinquency period. The account could have been delinquent a number of time earlier, but Refers to the current delinquency days.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delivery Versus Payment Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if it is a DvP, Delivery Versus Payment, or RvP, Receive Versus Payment, trade or not. Delivery versus payment, DVP, is a settlement system that stipulates that cash payment must be made prior to or simultaneously with the delivery of the security. Delivery versus payment is from the perspective of buyer and from the perspective of seller, this system is called receive versus payment, RVP. For DvP transactions, if the payments have not yet taken place five business days after the settlement date, firms must calculate a capital charge by multiplying the positive current exposure of the transaction by the appropriate factor, according to a Table given by Basel. List of values are Y, N. Y indicates it is a DVP.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discount Margin",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Discount Margin is average expected return earned over a given reference rate, that is additional to given reference rate, for a floating rate security. Column is applicable for instruments like Floating Rate Note. Refers to the margin or spread that must be added to discount rate obtained from interest rate curve to get the final discount rate that is used to calculate present value of an instrument. This is an optional input and is specified as a rate or price, see Discount Rate Margin Type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Double Default Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure has a double default. Double default is explained as a case where both the obligor and the guarantor defaults. The CRM treatment is different for exposures which comes under the double default category.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the effective date of the account or contract or interest rate or exchange rate from which it is effective.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Exposure Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the effective expected exposure amount at a specific date is the maximum expected exposure that occurs at that date or any prior date. Alternatively, it may be defined for a specific date as the greater of the expected exposure at that date, or the effective exposure at the previous date. In effect, the Effective Expected Exposure is the Expected Exposure that is constrained to be non decreasing over time.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Interest Rate For Hedge Management",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the effective interest rate of the instrument for Hedge Management application.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Maturity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the effective maturity of an exposure. Typically, it would be longest possible remaining time before the counterparty is scheduled to fulfill its obligation. It is used in RWA calculation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Embedded Option Type Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates as S if the embedded option is separated form host contract and as N if it is non separated. List of Values are S and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Embedded Options Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the security has an embedded option within it. Embedded option refers to a provision in a security that is an inseparable part of the instrument. An embedded option is a special condition attached to a security, and in particular, a bond that gives the holder or the issuer the right to perform a specified action at some point in the future. An embedded option is part of another security, and as such does not trade by itself. Nevertheless, it can affect the value of the security of which it is a component. A security is not limited to one embedded option, as there may be several embedded options in one security.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Month Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the last payment of the instrument is on month end or not. List of values are Y, N. Alternatively it indicate the end of a calendar month.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to end of period balance which includes accrued interest. All the calculations such as interest, prepayment amounts etc. are based on this amount. This is used in all the calculations performed by cash flow engine. In Case of LC Contracts, EOP Balance should be populated when LC Is executed. Till LC is executed, LC amount sanctioned should be hold in Total Commitment Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the end of period book balance. It is the sum of total of End of Period Balance Plus Deferred Balance. This is used while calculating amortization. The book balance is the term financial institutions use to describe the amount of money available before any adjustments have been made for deposits in transit, checks that have not yet been cleared, reserve requirements and interest received from 'float funds' hence is generally greater than end of period balance, Also called as 'gross balance'. It also excludes any deferred balance that is unamortized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exempted Capital Market Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if an investment in paid up equity of the financial entity is exempt from capital market exposure.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Expected Loss Best Estimate Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the best estimate of expected loss. This is applicable to exposures which have already defaulted. This is useful when financial institutions use their own estimates of Loss given default.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Explicit Adjustment For Effective Maturity Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether there is an Explicit Adjustment for Effective Maturity or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure Funding Currency Same Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the financial institution is funded in the same currency as that of a claim. This is applicable in case of claims on foreign sovereigns. This is applicable to Basel regulation of India jurisdiction. Claims denominated in domestic currency of the foreign sovereign met out of the resources in the same currency raised in the jurisdiction of that sovereign will attract a risk weight of zero percent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure Held At Fair Value Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is held at fair value. Fair value is applicable to exposures involving less liquid and physical assets. In case of actively traded instruments, the market value is the fair value. This is in the context of Financial Accounting standards board.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Failed Business Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of business days delayed after the agreed settlement date. This is applicable for failed trades. There are different guidelines for capital treatment of failed trades. European standards are dictated at directive level and permit a 5 business day grace period after settlement date on delivery versus payment, DvP, transactions before any charges are imposed at which point they are subject to charges on the exposure. These increase to 100 percent after 46 days. Settlement date is not defined or subject to specific limitations. For non DvP transactions, the charge starts immediately, with a one day grace period for cross border transactions, at a flat eight percent risk weighting of the exposure to the counterparty. US banking regulators take a balance sheet approach, under which a standard risk weight, usually 100 percent but in some cases 20 percent, is applied to the full notional amount of trades that have failed to settle without a grace period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Failed Trade Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the trade is a failed trade. Failed trades are trades that have occurred but not have settled. There are different guidelines for capital treatment of failed trades. European standards are dictated at directive level and permit a 5 business day grace period after settlement date on delivery versus payment, DvP, transactions before any charges are imposed at which point they are subject to charges on the exposure. These increase to 100 percent after 46 days. Settlement date is not defined or subject to specific limitations. For non DvP transactions, the charge starts immediately, with a one day grace period for cross border transactions, at a flat eight percent risk weighting of the exposure to the counterparty. US banking regulators take a balance sheet approach, under which a standard risk weight, usually 100 percent but in some cases 20 percent, is applied to the full notional amount of trades that have failed to settle without a grace period. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fee Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the fees charged or paid by the Financial Institution in originating or acquiring the given instrument or account. Incase of investments, It Refers to the fee receivable i.e. current fee which has been assessed internally but not yet due to be charged for the account. It is used to calculate the Amortized Cost. If Amortized cost is not sourced in the Investments table, then it is derived from EOP balance + Current Deferred Premium Or Discount  Accrued interest  Fees  Deferred Fees Unamortized Amount. In case of bills, it refers to the fees charged by the financial institution in purchasing the bill and paying the amount to the exporter.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fee General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds fee amount. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fees For Effective Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the consolidated current un amortized, portion of the, fees which is or are applicable for, or are integral part of, Effective Interest Rate computation as per IFRS 9. This value will be used within the Cash Flow Engine.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fiduciary Parent Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the parent fiduciary account number of the account. In the case of fiduciary asset like retiral plans, the bank will store the retiral benefit specific plans, as the parent number of the account, and the retiral benefit higher level as the parent fiduciary account ID. This will be the ultimate parent number of the fiduciary assets. Providing this information indicates that this asset has been invested by the parent fiduciary account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fiduciary Relationship Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account is held with the bank under a fiduciary capacity. Fiduciary capacity means trustee, executor, administrator, registrar of stocks and bonds, transfer agent, guardian, assignee, receiver, or custodian under a uniform gifts to minors act investment adviser, if the bank receives a fee for its investment advice any capacity in which the bank possesses investment discretion on behalf of another or any other similar capacity that the regulator authorizes. For example deposits that are placed with a bank by a national bank for which the bank is a fiduciary.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Financial Market Quote Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to financial market Quote type code. Market data for given financial quote type will be used for calculation. Possible inputs: MID, BID, ASK or LST. Instrument Used:CommodityForward.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fixing Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of historical fixings of FX index. Expected values are SPOT, FORWARD. Default value used during instrument valuation is SPOT.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forward Rate Agreement Interest Reference Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Forward Rate Agreement interest reference rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forward Rate Agreement Months To Start",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to number of separated months for which forward rate of a forward rate agreement are available. This is useful to find the month for which a FRA quote corresponds.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forward Rate Agreement Quotes",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to number of separated forward rates for which forward rates of a forward rate agreement was available. This is used in conjunction with FRA months to start column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forward Rate Agreement Roll Over Duration",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of days after which a forward rate agreement is about to start. This is also known as FRA Roll over duration.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forward Rate Agreement Term Months",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the tenor of the forward rate agreement represented in months.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Front Stub Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if instrument is having irregular time period at the beginning, Front, or end, Back, of the contract. List of Values are Y and N. Select Y for First irregular Payment, include front, or N Last irregular Payment, not including front, of contract. If there are no irregular payment leave column blank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fund Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code identifying the fund. Fund dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fund Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code identifying the fund type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "General Ledger Account Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique general ledger account code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Geography Risk",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the level of geographical risk associated with this account. List of values are in the range of 0 10 with increasing values denoting increasing risk levels.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Guaranteed By Sovereign Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if an account is partially or fully guaranteed by the Sovereign, Government agencies or sponsored agencies. This is derived using Standard Guarantor Type of an account or Standard Issuer type of Mitigant of the Account. List of values are Y and N. This also indicates if the exposure is directly and unconditionally by a sovereign entity or an entity for which zero risk weight is applicable in standardized approach. Claims on BIS, Bank of International Settlement, IMF, International Monetary Fund, ECB, European Central bank, MDB, Multilateral Development Bank, carry zero risk weight. Examples of MDB are The Asian Development Bank, ADB, The African Development Bank, AfDB, The European Investment Bank, EIB, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Guarantor Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the identifier of the Party who guaranteed the program.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Hedge Portfolio Set Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique hedge portfolio set code or Hedge identification number, hedge ID, under which this account is covered.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Held By Client Or Proprietary Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the account is held by client or not. If the value is updated as Y which means the security is held by client and if the value is updated as N which means the security is in the proprietary account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "High Strike Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the high strike. It is applicable to FX Pivot Instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holding Period For Haircut",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the holding period in days to arrive at the base volatility haircut of an exposure. The standard supervisory haircuts, are based on an assumed 10 business day minimum holding period for derivatives and eligible margin loans.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holding Period In Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the holding period in days to arrive at the base volatility haircut of an exposure. The standard supervisory haircuts, are based on an assumed 10 business day minimum holding period for derivatives and eligible margin loans.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holding Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holding intent of the account. Holding Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holiday Display Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holiday calendar code as per the holiday calendar defined through the UI.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holiday Rolling Convention Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holiday rolling convention code, based on which the date on which cash flow has to happen is decided. This includes  Following business day, Modified following business day, Previous business day, Modified previous business day etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "IFSB Contract Type Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Islamic Financial Services Board classification of the instrument. This is applicable in case of Islamic finance products. Examples, include Murabahah, Musharakah, Sukuk, etc. Ifsb Contract Type Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "ISO Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Illiquid Derivatives Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the derivative is easily liquid table or easily replaceable or an exotic derivative. List of values are Y  It is not easily replaceable or easily liquid table, N  It is easily replaceable or easily liquid table. It is required for regulatory capital processing. Based on this flag and other parameters supervisory haircut is adjusted on the basis of a holding period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Include Last Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if instrument is having irregular time period at the beginning, Front, or end, Back, of the contract. Select Y for Include last or N for not including last . List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Incurred Credit Value Adjustment Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Incurred CVA Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Indemnification Asset Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to indemnification amount of the asset arising from loss sharing agreement. Indemnification is the part of an agreement that provides for one party to bear the monetary costs, either directly or by reimbursement, for losses incurred by a second party.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Industry Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the code that describes the primary business activity of the obligor or the industry to which the party is associated to as per the North American Industry Classification System, NAICS. If the NAICS code is not available, provide either the Standard Industrial Classification, SIC, or Global Industry Classification Standard, GICS. If the obligor is an individual, the industry code should be consistent with the industry in which the commercial purpose of the loan operates.\nIf the business or individual operates in multiple industries, the BHC or IHC should report the industry that best represents the commercial risk of the loan, i.e., the predominant industry.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to a unique Code representing a particular Instrument. This code can be ISIN Code, CUSIP, SEDOL etc. Instrument Contract dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of instrument type, which is defined as code identifying the instrument category of the customer account. Instrument Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Accrued Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the accrued interest amount associated with the contract. This is the interest that has accumulated on an instrument since the last interest payment up to, but not including, the settlement date. Accrued Interest is defined as Interest earned but not received, realized. For example, bonds usually pay interest every six months, therefore interest accrues between one interest payment and the next. The buyer of a bond pays its market value plus the interest earned up to the settlement date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Accrued General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds accrued interest amount. Accrual of interest is required to report as on date due should the customer choose to close the account prematurely. The accrued interest is liquidated on the installment payment date until to the account. If the installment is received the interest is accounted as received, if delinquent the interest is capitalized to the principal  with the increase in principal the interest will start to accrue on the increased principal. If the account is in default, prolonged delinquent, the interest accrual is suspended on the account. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Calculation Method",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the method of computing interest. Expected values are Simple and Compounded.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the interest rate as applicable as on As of Date. This is expected for both, fixed rate as well as floating rate instrument. For floating rate instruments, the rate would be computed at the time of next re pricing date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the interest rate code that identifies the index to which adjustable rate accounts are tied. Transfer Pricing references interest rate code when calculating option costs and uses the relevant interest rate from the defined interest rate code, IRC, together with the margin to determine the reprice rate for the instrument. The value populated in this column for each account record must be synchronized with the actual interest rate code values defined in Transfer Pricing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code Tenor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Stored the underlying IR index tenor used in instrument. Incase of Fx Forward Instrument this is used as IR index tenor for term currency.\nInstrument Used:AmortizingFRN.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code Tenor For Base Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the underlying IR index tenor used in instrument for base currency. Instrument Used: Fx Forward. This should be used in the conjunction with Interest Rate Code Tenor Unit For Base Currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code Tenor Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unit of underlying IR index tenor, possible values are D, for days, BD, for business days, W, for Weeks, M, for month, y, for Year, Q, for Quarter.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code Tenor Unit For Base Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unit of underlying IR index tenor for base currency, possible values are D, for days, BD, for business days, W, for Weeks, M, for month, Q, for Quarter, Y, for Year. This should be used in the conjunction with Interest Rate Code Tenor For Base Currency. Instrument Used: Fx American, Fx Forward.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Maturity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the maturity of the underlying of the interest forward or future.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Name For Base Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the interest rate code that identifies the index to which other currency, base currency, is associated with. Instrument Used: Fx Forward.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Spread",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to contractual spread above or below, in case of asset it will be a positive spread and for liability it will be a negative spread, pricing index and is applicable for floating or adjustable rate accounts. Since repo rate is generally fixed upfront this column can be left blank or can be used to store spread above or below benchmark rate, if applicable. The current net rate = Applicable rate from the IRC plus margin.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the type of interest rate paid on this transaction., For instance Fixed Or Floating.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Internal Customer Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the customer is an internal customer. This identifies if the contract is between one of the financial institutions subsidiaries. This is used in capital consolidation. The List of values are Y, N or NULL.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "International Banking Facility Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account or transaction is belongs to an international banking facility. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Inverse Price Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates stating whether or not to permit reverse entry of rate, i.e., units of base currency, Other currency, that can be bought with 1 unit of term currency, ccy Code. Instrument Used: Fx Forward. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Issuer Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the issuer code for the financial instruments. Issuer is defined as a legal entity that develops, registers and sells securities or financial instruments. Issuers may be domestic or foreign governments, corporations or investment trusts. Issuers are legally responsible for the obligations of the issue and for reporting financial conditions, material developments and any other operational activities as required by the regulations of their jurisdictions. The most common types of financial instruments issued are common and preferred stocks, bonds, notes, debentures, negotiable instruments, bills and derivatives.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock In Barrier Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the knock in barrier applicable in case of dual target FX forwards.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock In Observation Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the frequency of observation for Knock In. This is applicable when knock in is Bermudan only. This is used to generate schedule from trade date to expiry date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock In Observation Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unit in which frequency of observation for Knock In is specified. This is used to generate schedule from trade date to expiry date. Expected values are: D, Days, M, Months, Y, Years.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock In Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to type of the knock in. Applicable to FX forward contracts like dual target and pivot, the Knock in parameter determines whether the notional is levered when the payout is negative. Four variations are supported: \nEuropean, Discrete,: The knock in feature will be effective on each fixing and will be reset thereafter.\nBermudan: The knock in feature will be effective on a number of specified observation dates. \nNever: The knock in feature will never be in effect. The notional will not be levered at any time.\nAlways: The knock in feature will always be effective. The notional will be levered once the payout is negative.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Out Barrier Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the knock out barrier applicable in case of dual target FX forwards.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Out Bonus Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Amount of knock out bonus applicable in case of bonus forward. This is required only when knock out bonus type is Fixed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Out Bonus Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of knock out bonus which is applicable to forward contract. Expected values are: Fixed, Rebate as a fixed amount, or Forward, Rebate as buy or sell Notional at knock out Strike.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Out Observation Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the frequency of observation for Knock Outs. This is applicable when knock Out is Bermudan only. This is used to generate schedule from trade date to expiry date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Out Observation Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unit in which frequency of observation for Knock Outs is specified. This is used to generate schedule from trade date to expiry date. Expected values are: D, Days, M, Months, Y, Years.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Out Strike Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the strike used for knock out Bonus Settlement. It is applicable to dual target FX forwards.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knock Out Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Store the type of knock out. Applicable to FX forward contracts like dual target and pivot, Knock out is an additional early termination feature. If the underlying rate crosses the barrier in the agreed upon direction, the deal will be terminated. Four types of Knock outs are available:\nEuropean, Discrete,: The knock out feature is effective on and reset after each fixing date. If the knock out occurs, there is no settlement on a particular fixing date. However, the deal is still in effect after that date.\nEuropean, At Once,: The knock out feature is effective on each fixing date. If the knock out occurs, there is no settlement on any subsequent date.\nBermudan: The knock out feature is effective on specified dates.\nNever: The knock out feature is never in effect.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knocked In Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether AKI, knock in, event has occurred or not. A knock in is a latent option contract that begins to function as a normal option, 'knocks in', only once a certain price level is reached before expiration. Y indicates AKI has occurred while N indicates that it has not occurred. This is applicable in case of dual target fx forwards. List of values and Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Knocked Out Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether AKO, knock out, event has occurred or not. A knock out is an option with a built in mechanism to expire worthless if a specified price level is exceeded. Y indicates AKO has occurred while N indicates that it has not occurred. This is applicable in case of dual target fx forwards. List of values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Payout Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Last Payout parameter determines the amount of cash payment if the target is exceeded. There are three choices for Last Payout:\nFull: The last payout is computed as usual: which implies that the total payout may be larger than the predefined target.\nCapped: The last payout is capped by the target. \nRebate: The last payout is the rebate amount. In particular, zero rebate amount means no settlement once the target is breached.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Legal Entity Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the entity code of the legal entity to which the account will be attributed in the general ledger.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Leverage Ratio",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to leverage ratio calculated as Leverage Ratio= Total Liabilities divided by Total Assets.\nRefers to the multiplier or leverage number of FX forward trades like dual target and pivot. This is used for deal structuring in case of fx forwards and user can solve for the PV of the final product while changing this number.\nLeverage allows a client to trade without putting up the full amount. For example, 50:1 leverage, means USD 2 of equity is required to purchase an order worth, 2 multiply with 50, USD 100. for the given example this column will store 50.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Line Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code of the credit line associated with this account. Credit Line dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Line Of Business Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to line of business, LOB, is a functional unit that offers the products to the customer by the financial entity. Example: Corporate Finance, Trade Services, Private Wealth Management, Treasury Services, Retail Banking, Cards services etc. Refers to the unique code of the line of business applicable to the respective product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Liquidity Class Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to unique identifier of liquidity class code. Liquidity is defined as the degree to which an asset or security can be bought or sold in the market without affecting the price of the asset. Liquidity is characterized by a high level of trading activity. Assets that can be easily bought or sold are known as liquid assets. Expected values are Qualified Liquidity, Most Liquid, Readily Marketable, Qualified Thin Market, Not Qualified, Not Qualified  Readily Marketable, Not Qualified  Thin Marketable, Not Marketable and Other.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Long Run Weighted Average Loss Given Default",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the long run weighted average loss given default. This is the estimate of the average economic loss rate that is expected to be incurred in the event of default, measured over the long run. If the purchasing bank can estimate either the default weighted average loss rates of pool given default or average PD in a reliable manner, the bank may estimate the other parameter based on an estimate of the expected long run loss rate. The bank may, i, use an appropriate PD estimate to infer the long run default weighted average loss rate given default, or, ii, use a long run default weighted average loss rate given default to infer the appropriate PD.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Long Settlement Transaction Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether it is a Long transaction or not. Needed for Long Settlement Transactions or Failed Trades. Non Sec STD Long settlement transactions. This is determined as per the Basel accord annex 4 para 2B, Long Settlement Transactions are transactions where a counterparty undertakes to deliver a security, a commodity, or a foreign exchange amount against cash, other financial instruments, or commodities, or vice versa, at a settlement or delivery date that is contractually specified as more than the lower of the market standard for this particular instrument and five business days after the date on which the bank enters into the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Long Stub Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if instrument is having irregular payment in the beginning or end of the contract, then this attribute states if that irregular payment tenor is shorter or longer than regular payment tenor. If Longer then value will be Y if shorter then value will be N. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loss Cap Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the ISO currency code in which Loss Cap is specified. ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loss Given Default Pre CRM",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to loss percentage, without considering mitigation effect, if an exposure is defaulted over a period of one year. It will be used in RWA calculation based on advanced approach. This is expressed in decimal number, For example, 30 percent will be 0.3.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loss Share Agreement Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique reference to the loss sharing agreement that particular OREO, Other Real Estate Owned, asset is subjected to.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Low Knock In Barrier Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Low knock in barrier applicable in case of FX Pivot.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Low Knock In Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Low Knock In Type. Applicable to FX forward contracts like dual target and pivot, Knock out is an additional early termination feature. If the underlying rate crosses the barrier in the agreed upon direction, the deal will be terminated. Four types of Knock outs are available:\nEuropean, Discrete,: The knock out feature is effective on and reset after each fixing date. If the knock out occurs, there is no settlement on a particular fixing date. However, the deal is still in effect after that date.\nEuropean, At Once,: The knock out feature is effective on each fixing date. If the knock out occurs, there is no settlement on any subsequent date.\nBermudan: The knock out feature is effective on specified dates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Low Knock Out Barrier Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the knock out barrier applicable in case of FX Pivot.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Low Knock Out Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Low Knock Out Type. Applicable to FX forward contracts like dual target and pivot, Knock out is an additional early termination feature. If the underlying rate crosses the barrier in the agreed upon direction, the deal will be terminated. Four types of Knock outs are available:\nEuropean, Discrete,: The knock out feature is effective on and reset after each fixing date. If the knock out occurs, there is no settlement on a particular fixing date. However, the deal is still in effect after that date.\nEuropean, At Once,: The knock out feature is effective on each fixing date. If the knock out occurs, there is no settlement on any subsequent date.\nBermudan: The knock out feature is effective on specified dates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Low Strike Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the low strike amount. It is applicable to FX Pivot Instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Management Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the management fees charges to the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margin Agreement Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of the document signed by an individual for opening a margin account, in which the customer agrees to certain regulations and allows the brokerage to have a lien on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margin Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the margin amount. Margins are cushion required by the financial institution to allow the customer to trade in derivative instruments like Options and Futures. These are highly volatile products and the potential loss is high, hence only informed customers are allowed to trade in such products. Margin amount is also relevant in the case of OTC contracts, this is maintained with the counterparty of the transaction. Margin amount refers to the difference between the market value of a collateral and amount of the loan advanced against it.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margin Required Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate the margin if required for the account. If the value is updated as Y then account required specified margin and if the value is updated as N means the account does not require margin. Account without margin requirement are not allowed to trade on derivatives, naked short etc. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margined Transaction Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag identifies whether the derivative transaction is Margined or Unmargined. This will be populated as Y if the transaction has a margin associated with it irrespective of any other collateral. This will be used in SA CCR approach for OTC derivatives. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mark To Market Value In Natural Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Mark to Market value is a measure of the fair value of accounts that can change over time, such as assets and liabilities. Mark to market aims to provide a realistic appraisal of current financial situation of an institution or company. Mark to market value is the change in current market value as against the last traded value.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the market value of the instrument as on the As of Date. Market value of the asset is the price that would be received to sell an asset in an transaction between market participants on the given day. It is often the quoted market price which is available as part of market data and used to determine the market value of the asset.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Value Per Unit In Local Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the per unit market value of the asset or investment in local currency. This is applicable in case of mutual funds, futures and options, bonds etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Value Per Unit Reporting Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the per unit market value of the asset or investment in reporting currency. This is applicable in case of mutual funds, futures and options, bonds etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Materiality Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is material or not. Material exposure is an exposure that is substantial in terms of size or risk.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maturity Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the contractual date on which the principal balance is expected to fully amortize and the balance payable would be nil. This is applicable for term loan products but not for revolving credit or overdraft type of account. In case of insurance policy, for some whole life insurance products the maturity date is aligned to maximum attained age and the policy is payable upon the earlier of the maturity date or the death of the insured. In case of Term Life insurance policies the maturity date is determined as policy issue date plus Term of the contract. In case of an annuity it is the date from which the annuitant has chosen to take the payouts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maximum Supervisory Ratio",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum supervisory loan to value ratio for the loan specified by regulators. This is usually applicable in case of secured loans. FDIC suggests a maximum loan to value ratio of 65 percent in case of Raw land loans, 80 percent in case of commercial and non residential loans, 85 percent in case of 1 to 4 family loans.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Minimum Holding Period",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the Minimum Holding period in days for an exposure which is used to calculate the volatility haircut.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Net Present Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the net present value of the account or investment. Net present value is the sum of discounted cash inflows and cash outflows.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Nettability Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether the exposure is nettable against any other nettable exposures of the same customer. This is valid only for OTC derivatives and Repos. If the value is updated as Y means the exposure is nettable against any other nettable exposure and if the value is updated as N means the exposure is not nettable against any other exposure.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Netting Agreement Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the netting agreement code on which the contract is made. A netting agreement is an arrangement between two parties   known as counterparties   that governs the treatment of certain offsetting transactions or contracts. Two transactions offset each other if a gain in one results in a loss in the other. In other words, the transactions hedge each other. This allows for net settlement of all contracts governed by this netting agreement, with a single counterparty, through a single payment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notional Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the notional amount of the exposure or instrument. This will be the amount, post adjustment for any regulatory capital calculation purpose. If there are any adjustments to the accounting exposure amount due to netting, or any other regulatory capital related computations, the same will be updated. For futures and options corresponds to contract size multiplied by the number of contracts and for swaps and forwards corresponds to the contract amount. This is applicable to off balance sheet instruments such as swaps.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notional Amount Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the ISO currency code of the notional amount. The value expected is a valid ISO 4217 currency code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notional Principal Payment",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the notional that is the amount covered by the derivative. In the case of FX derivatives, this is the notional principal associated with the pay leg of the transaction, in the pay currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notional Principal Received",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the notional that is the amount covered by the derivative. In the case of FX derivatives, this is the notional principal associated with the receive leg of the transaction, in the receive currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Offset Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the account number that is being offset. It Refers to the loan account number which this liability account is offsetting. There can be multiple savings account offsetting a loan, but a liability account would not offset more than one loan account. For hypothecated deposits, it Refers to the account number of the related loan that is used to net against the deposit.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "One Way Cash Payment Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether Transaction one way cash payments on OTC derivative contracts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Organization Unit Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the cost center to which the account belongs to. Organization Unit dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Gross Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the book balance at the time of origination. Original gross book balance is the sum total of End of Period Balance Plus Deferred Balance, represented as a negative amount to depict the unamortized portion. This is used while calculating amortization. The book balance is the term financial institutions use to describe the amount of money available before any adjustments have been made for deposits in transit, checks that have not yet been cleared, reserve requirements and interest received from 'float funds' hence is generally greater than end of period balance, Also called as 'gross balance'.\nIt also excludes any deferred balance that is unamortized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Other Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the other currency involved in the option contract, for currency options.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Over The Counter Derivative Multiplier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the multiplier in case of over the counter derivative contracts. This is useful for calculating the effective notional principal. Effective notional principal is calculated as stated notional principal amount multiplied by any multiplier in the OTC derivative contract. Financial institutions are required to use effective notional principal amount, rather than its apparent or stated notional principal amount in calculating potential future credit exposure. For example, a swap contract with a stated notional amount of USD 1,000,000 whose terms called for quarterly settlement of the difference between 5 percent and LIBOR multiplied by 10 has an effective notional amount of USD 10,000,000.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Over The Counter Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to Indicate whether a derivative exposure is traded on an exchange or over the counter. List of values are Y, N. If the value is updated as Y means the exposure is traded over the counter and if the value is updated as N means the exposure is traded in an exchange.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Ownership Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the organization defined code for the ownership type of the account. Expected values are IND  Individual, JOINT  Joint Tenant or Community Property, TRUST  Trust, CUST  Custodian, CORP  Corporate, FIRM  Firm Owned and OTHER  Other.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Party Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier for the party. Party is defined as an entity or a person who takes part or is involved in an agreement, lawsuit, or transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Past Due Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to Indicate whether the exposure is past due or not. If delinquency days are greater than 90 then its past due. If the value is updated as Y means the exposure is past due and if the value is updated as N means the exposure is not past due. List of Values are Y,N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Pay Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the ISO currency code for the pay leg of an account or contract. It is mainly applicable for Swap and FX related contracts, e.g. FX Spots, FX Forwards, FX Futures.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Pay Upfront Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if there is an upfront payment like premium or other fee. List of Values are Y, N. Y when there is upfront payment and N when it is not there.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Pivot Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the pivot amount. The pivot points are defined as the level at which the market direction changes for the day. Pivots point is set by using high, low and closing price of the previous day. General definition of pivot point is Pivot Point =, High + Close + Low, divided by 3. It is applicable to pivot instrument like FX Dual Target Pivot Instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Portfolio Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of a portfolio. The term portfolio refers to any collection of financial assets such as stocks, bonds, cards and cash equivalents, as well as their mutual, exchange traded and closed fund counterparts. Portfolios may be held by individual investors and or managed by financial professionals, hedge funds, banks and other financial institutions. It is a generally accepted principle that a portfolio is designed according to the risk tolerance, time frame and investment objectives of the investor.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Prime Brokerage Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account is associated with prime brokerage services. Prime brokerage is the generic name for a bundled package of services offered by investment banks and securities firms to hedge funds and other professional investors. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Prior Transfer Pricing Period Average Daily Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Average Daily Balance as of the prior transfer period. When processing with the mid period repricing option, Transfer Pricing application references PRIOR_TP_PER_ADB as the average daily balance at the time of the last repricing event. This field is used in conjunction with the CUR_TP_PER_ADB field. If the last reprice date occurred during the processing period, the rate that would be applied would be the repriced rate on the balance held by the customer, instead a weighted average is calculated individually on balance prior to reprice and balance after reprice.\nExample: if the data extracted is for the month of Dec 2012, and the interest rate has been repriced on 15 Dec 2012, a normal scenario would require the repriced rate on the entire end of period balance, instead the FTP engine calculates a weighted average of both the rates to arrive at a weighted average rate to be applied.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Probability Of Default Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the probability of default of an exposure over a period of one year, as required for regulatory capital calculation. This will be used in RWA calculation based on advanced approach. This is expressed in decimal number, For example, 30 percent will be 0.3.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Product Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code assigned to each of the Products offered by the Bank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Product Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the product type associated with account. Product type is defined as classification like loan, deposit, cards, etc. Product Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Protection Buy Sell Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates the protection is bought or sold. List of values are B and S. B for protection buyer and S for protection seller.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Provision Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the provision amount set against the account. Provisions are set aside by financial institution to cover against expected future loss. Provision amount on the loan increases as the credit quality deteriorates signifying high likelihood of default and thereby mandating more allocation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Provision General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds provision amount. All asset exposures need to be provisioned for to set off any future losses arising out of these exposures. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Purchase Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the purchase price of an asset. This amount is not the same as the Balance Outstanding. It is an accounting rule that mandates that during the purchase of loans that have evidence of credit deterioration since origination, the net investment in loans is recorded. The net investment in loans is the lower of the acquisition cost of the loan or the estimated fair value at the date of acquisition.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Purchase Contract Cancelled Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the purchase contract has been cancelled. This is required for determining risk weight of the exposure. A 100 percent risk weight is applicable for one to four family residential pre sold construction loans for residences for which the purchase contract is cancelled. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Set Lag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the lag days to the next reprice date. This determines the date the interest by an adjustable rate instrument should refer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Set Lag Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the values as D  Days, M  Month and Y  Years, this is in conjunction with Rate Set Lag.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rebate Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of rebate given in case of FX forward contracts such as dual target and pivot. This is required when Last payout type is given as rebate. Also refers to or the total amount of rebate that is allowed on the total collection amount of the documentary collection contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rebate Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the ISO currency code in which rebate is specified. ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Receivable Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the ISO currency code for the receive leg of an account or contract. It is mainly applicable for Swap and FX related contracts, e.g. FX Spots, FX Forwards, FX Futures.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Reciprocal Cross Holding Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicates if the exposure has reciprocal cross holding or not. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Redemption Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the redemption value. Redemption value is the value at which the issuer of the instrument may choose to repurchase the instrument before maturity. In case of bonds, if the purchase price of the bond is less than the redemption value, it is said to be bought at a discount. If the price of the bond is more than the redemption value, it is said to be bought at a premium.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Referral Line Of Business Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Line of Business that is responsible to acquiring the account. Line of business, LOB, is a functional unit that offers the products of the financial entity to the customer. Example: Corporate Finance, Trade Services, Private Wealth Management, Treasury Services, Retail Banking, Cards services etc. This column Refers to the unique code of the line of business applicable to the respective product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Region Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the geographical grouping of the market based on certain common characteristics like language, ethnicity, country, continent, city and state. The region can vary based on the definition of market. Global market vs local market can have different definition of region.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Regular Way Traded Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the securities settlement contractually occurs within the period of time, after the trade date, generally established by regulations or conventions in the marketplace or exchange in which the transaction is being executed. It is a type of trade that is settled through the regular settlement cycle required for the particular investment being traded. The settlement cycle is the time that the regulations of the securities market allows for the buyer to complete payment and for the seller to deliver the goods being purchased. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Regulatory Capital Investment Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is a regulatory investment or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Regulatory Investment Participation Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of Participation Value for Regulatory Investments",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remargin Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the reimagining frequency of an exposure in days. This is used in calculating the volatility haircut. Reimagining frequency is the frequency at which the exposure is marked to market. For some transactions, depending on the nature and frequency of the revaluation and reimagining provisions, different holding periods are appropriate. The framework for collateral haircuts distinguishes between repo style transactions, i.e. repo or reverse repos and securities lending or borrowing, other capital market driven transactions, i.e. OTC derivatives transactions and margin lending, and secured lending. In capital market driven transactions and repo style transactions, the documentation contains reimagining clauses, in secured lending transactions, it generally does not. When the frequency of reimagining or revaluation is longer than the minimum, the minimum haircut numbers will be scaled up depending on the actual number of business days between reimagining or revaluation. Currently this attribute is only consumed by Basel application.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repayment Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the type of repayment associated with the account. Indicated values are Conventional Fixed, Balloon, Adjustable Negative Amortizing, Rule of 78s, Level Principal, Conventional Adjustable etc. Conventional Amortization  This AMRT_TYPE_CD conventionally amortizes a record whose cash flows are defined in the PAYMENT_SCHEDULE table. Payment amounts should contain both principal + interest. Level Principal Payment Schedule  This AMRT_TYPE_CD level principal amortizes a record whose cash flows are defined in the PAYMENT_SCHEDULE table. Payment amounts should contain principal only. Negative amortization is applicable when the payment amount is not sufficient to cover the interest component of the loan for the period. Rule of 78 loans have a pre computed schedule.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repo Instrument Residual Maturity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Repo Instrument Residual Maturity",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Retention Offer Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of retention offer type. Retention offer type is referred to as a service or payment or reward outside of a regular services provided to the customer that is offered as an incentive to retain a key customer or account. Retention Offer Type Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Secured Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account or contract number is secured with a collateral or not. The collaterals to be considered here will be the collaterals other than margins. In case of deposits, this indicates it is Collateralized or Secured Deposit. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securities Guarantor Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to unique code of the guarantor for the securities. List of values are Central Government  CGG, State Government  SGG and Others  OTH.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Seniority Claim Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is a senior claim. In case of Purchase Receivables, if the purchasing bank is unable to decompose EL into its PD and LGD components in a reliable manner, the risk weight is determined from the corporate risk weight function using the following specifications, if the bank can demonstrate that the exposures are exclusively senior claims to corporate borrowers, an LGD of 45Percent can be used, otherwise an LGD of 100Percent is used. List of values are Y and N, A value Y indicates that the exposure is a senior claim, and N indicates that the exposure is not a senior claim.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Seniority Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the exposure seniority in the event of bankruptcy of the counterparty. Seniority refers to the order of repayment in the event of a sale or bankruptcy of the issuer. \nSeniority can refer to either debt or preferred stock. Senior debt must be repaid before subordinated, or junior, debt is repaid. Each security, either debt or equity, that a company issues has a specific seniority or ranking. Bonds that have the same seniority in capital structure of a company are described as being pair passu. Preferred stock is senior to common stock in a sale when preferred shareholders must receive back their preference, typically their original investment amount, before the common shareholders receive anything.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settled In Home Country Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the instrument is settled in home country or not. List of values are Y and N. If the value is updated as Y the instrument is settled in home country, means where is instrument is originated, and if the value is updated as N the instrument is settled in outside the home country.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount to be settled for the FRA contract as a result of the differential between contract and market rates in local currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Country Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the ISO code of the country where the trade or transaction is expected to settle. There are several popular country codes as part of ISO 3166 standard published by the International Organization for Standardization. ISO 3166 defines codes for the names of countries, dependent territories, special areas of geographical interest and their principal subdivisions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the currency in which the trade is to settle. The value in this field must be a valid ISO 4217 currency code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date at which a security transaction must be paid by the buyer and the securities delivered by the seller. Stocks and bonds have a settlement date of three business days subsequent to the trade date . Listed options and government securities must be settled by the next business day. This is different from contract settlement date. A contract can have multiple settlements in different settlement types.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of days required for settlement after the transaction is performed. Usually the number of business days is captured here. In case of T Plus 2 settlement, it would store a value of 2.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Lag Tenor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the settlement lag between the Valuation date and the underlying, underlying can be commodity, FX, inflation index etc., spot date. If difference is of 2 business day then, this column will hold 2 as value and Instrument Used as Fx Pivot.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Lag Tenor Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the settlement lag between the Valuation date and the underlings, underlying can be commodity, FX, inflation index etc., spot date. If difference is of 2 business day then, this column will hold BD as value and Instrument Used as Fx Pivot.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the settlement mechanisms used for secured and foreign exchange products. Expected values for secured tables are T  TRIPARTY, B  BILATERAL and O OTHER. Expected values for foreign exchange tables are C CLS,B  BILATERAL and O  OTHER.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Short Position Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag Indicates whether the derivative position is short or long. Short position is defined as the sale of a borrowed security, commodity or currency with the expectation that the asset will fall in value. Long position is defined as the buying of a security such as a stock, commodity or currency, with the expectation that the asset will rise in value. List of Values are Y and N. If the value is updated as Y means the derivative position is short position and if the value is updated as N means the derivative position is long position.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Specific Wrong Way Risk Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if any of the individual transactions conducted under the agreement with the given counterparty legal entity is considered a wrong way risk position. Possible options are Specific, General, and None. The BHC should use its internal BAU risk management process to determine whether an given transaction with the specific counterparty legal entity is a wrong way risk position, and if so whether it constitutes specific WWR or not. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Spot Lag Tenor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the spot lag between the Valuation date and the underlying, underlying can be commodity, FX, inflation index etc., spot date. If difference is of 2 business day then, this column will hold 2 as value . Column is applicable for instruments like Equity American Option, Commodity Forward, Zero Coupon Inflation Swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Spot Lag Tenor Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the spot lag between the Valuation date and the underlying, underlying can be commodity, FX, inflation index etc., spot date. If difference is of 2 business day then, this column will hold BD as value . Column is applicable for instruments like Equity American Option, Commodity Forward, Zero Coupon Inflation Swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Squared Off Position Trading Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the transaction has the respective opposite position in trading book. When a dealer is in a square position, the positions are perfectly hedged. If the dealer is not in a square position, then he or she is taking either a long or a short position. A square position is in the middle, neither net long nor net short. If the value is updated as Y means the transaction has the respective opposite position in trading book and if the value is updated as N means there is no opposite position available in trading book. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Standard Business Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the standard business days for settlement. This is useful to determine if the transaction is a long settlement transaction or not. Long Settlement Transactions are transactions where a counterparty undertakes to deliver a security, a commodity, or a foreign exchange amount against cash, other financial instruments, or commodities, or vice versa, at a settlement or delivery date that is contractually specified as more than the lower of the market standard for this particular instrument and five business days after the date on which the bank enters into the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Strike Rate Or Price",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the strike price or strike rate. In case of options, this stores the strike price. Strike price is the price at which an option to buy or to sell can be exercised. This is predetermined at the time of entering into the contract. In case of forward rate agreements, Refers to the forward rate of interest for the contract period as agreed between the parties. This column is also applicable to instruments like bullet swaps, equity total return swap, equity variance swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sub Netting Agreement Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code of Sub Netting Agreement. Sub Netting happens within broader netting agreement covering either geography, markets, into, fx etc..",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Supervisory Beta Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the supervisory scaling parameter, beta. It is set to a value of 1.4. To be consistent with the Revised Framework for credit risk, the EAD for instruments with Counterparty Credit Risk must be determined conservatively and conditionally on a bad state of the economy. To accomplish such conditioning in a practical, pragmatic, and conservative manner, the Internal Model Method and Standardized Method scale Expected Positive Exposure using multipliers, termed alpha and beta, respectively. Both alpha and beta are set at 1.4, but supervisors have the flexibility to raise either parameter in appropriate situations.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Target Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Target amount. Target amount are stated by investors as a decision points. This amount can be of two type either on basis of number of payouts or on basis of accumulated payouts, user can provide target type in target type code column. It is applicable to pivot instrument like FX Dual Target Pivot Instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Target Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Target type code Expected values are NumberOfPayouts, Accumulated Payout, None.\nTarget Type provided in this column will drive the value provided in target amount column. Target amount are stated by investors as a decision points. This amount can be of two type either on basis of number of payouts or on basis of accumulated payouts, user can provide target type in target type code column. It is applicable to pivot instrument like FX Dual Target Pivot Instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Ticker Symbol",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to a ticker symbol is the unique identifier used to identify the stock on a stock exchange.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Return Swap Asset Offsetting Deterioration Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether an offset happens to the exposure, when it is protected by a total return swap. This offset to the exposure happens due to the deterioration of the asset, and this can be reduction in fair value or by an addition to reserve or any other accounting practice. A value of Y indicates that the offset of the asset value happens. In the case of EU, this is required for identifying whether the total return swap is an eligible mitigant or not. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Trader Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the employee.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Trading Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of a trading account number held by the customer. Trading account is an account similar to a traditional bank account, holding cash and securities, and is administered by an investment dealer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Trading Desk Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the trading desk that has entered into a trade. Banks has various trading desks specializing for specific products, like Interest Rate Products, Equity, Commodities, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unconditionally Cancellable Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates if the exposure or claim is unconditionally cancellable or conditionally cancellable, e.g. cancellable upon certain events, or not cancellable. In certain countries, retail commitments are considered unconditionally cancellable if the terms permit the bank to cancel them to the full extent allowable under consumer protection and related legislation. List of values are Y  Unconditionally Cancellable, C  Conditionally Cancellable and N or NULL  Not Cancellable.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Unique identifier of an underlying of derivative product. In case of an instrument underlying, underlying code will be same as instrument code and in case of contract underlying, for products like swaption, underlying code will be unique generated code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the currency code corresponding to the underlying.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Forward Price",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the forward price of the underlying of the derivative contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Instrument Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the instrument code of the underlying of the derivative. In case of convertible bonds, the code of the equity instrument is stored, in case of basket options, multiple codes separated by # are to be stored. Instrument Contract dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Instrument Type Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the underlying or reference instrument type code of the asset. In the case of derivatives, Refers to the information about the instrument type of reference asset on which this derivative contract has been entered into. For example, a call option on a bond will have the underlying instrument type as Bond. Instrument Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Type Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the underlying type of the derivatives, which are reference asset for the funds. The underlying type indicates whether the derivative is bought on equity, debt etc. This information will be obtained from the mandate or the prospectus of the account or instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unrealized Gain Or Loss",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the unrealized gain or loss on exposure. Profit and Losses are classified into realized and unrealized profit or loss. Realized gain refers to the gain realized by selling or buying a security. Unrealized gain or loss refers to notional gain or loss which is not yet realized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Upfront Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of upfront payment in case of FX forwards. This is required when pay upfront flag is mentioned as Y.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Upfront Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the currency in which upfront amount is specified. ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Upfront Pay Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "This attribute stores the date when upfront payment is made.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Value Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the value date of the contract. Value Date is a securities industry term describing the date on which a trade, bonds, equities, foreign exchange, commodities, etc., settles. That is, the actual day on which transfer of cash or assets is completed, or the settlement amount is calculated. \nIn case of FX swap instrument Refers to the settlement date for spot or near leg. Also considered as the date on which the contract becomes effective.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Write Off General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds write off amount. The write off impacts the Profit and Loss account of the enterprise. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [
                {
                    "dqId": "DQCLREF167",
                    "btLogicalName": "Repo Instrument Residual Maturity",
                    "dqDesc": "Should be greater than 0",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQCLREF168",
                    "btLogicalName": "Mark To Market Value In Natural Currency",
                    "dqDesc": "Should be greater than 0",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQCLREF169",
                    "btLogicalName": "Contract Amount",
                    "dqDesc": "Should be greater than 0",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQCLREF170",
                    "btLogicalName": "Fees For Effective Interest Rate",
                    "dqDesc": "Should Be Greater Than or equal to 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQCLREF171",
                    "btLogicalName": "Effective Interest Rate For Hedge Management",
                    "dqDesc": "Should Be Greater Than or equal to 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQCLREF172",
                    "btLogicalName": "Notional Amount",
                    "dqDesc": "Should have values greater than 0",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV05",
                    "btLogicalName": "Book Type",
                    "dqDesc": "Should have list of values as TRADING or BANKING",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31307",
                    "btLogicalName": "Banking Book Exposure Or CCR Hedge Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31308",
                    "btLogicalName": "Borrower Capital Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31309",
                    "btLogicalName": "Cancelled Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31310",
                    "btLogicalName": "Capital Market Exposure Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31311",
                    "btLogicalName": "Central Counterparty Rejection Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31312",
                    "btLogicalName": "Claim And Funding Liability Similar Currency Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31313",
                    "btLogicalName": "Double Default Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31314",
                    "btLogicalName": "Explicit Adjustment For Effective Maturity Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31315",
                    "btLogicalName": "Exposure Held At Fair Value Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31316",
                    "btLogicalName": "Failed Trade Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31317",
                    "btLogicalName": "Held By Client Or Proprietary Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31318",
                    "btLogicalName": "Illiquid Derivatives Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31319",
                    "btLogicalName": "Nettability Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31320",
                    "btLogicalName": "Past Due Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31321",
                    "btLogicalName": "Rate Set Lag Unit",
                    "dqDesc": "Should have list of values as D,M,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31322",
                    "btLogicalName": "Include Last Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31323",
                    "btLogicalName": "Pay Upfront Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31324",
                    "btLogicalName": "Purchase Contract Cancelled Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31325",
                    "btLogicalName": "Regular Way Traded Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31326",
                    "btLogicalName": "Regulatory Capital Investment Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31327",
                    "btLogicalName": "Specific Wrong Way Risk Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31328",
                    "btLogicalName": "Squared Off Position Trading Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31329",
                    "btLogicalName": "Total Return Swap Asset Offsetting Deterioration Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31330",
                    "btLogicalName": "Automatic Cancellation Of Commitment Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31331",
                    "btLogicalName": "Backed By Bullion Liability Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31332",
                    "btLogicalName": "Contract Walk Away Clause Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31333",
                    "btLogicalName": "Internal Customer Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31334",
                    "btLogicalName": "Long Stub Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31335",
                    "btLogicalName": "Margin Required Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31336",
                    "btLogicalName": "Unconditionally Cancellable Indicator",
                    "dqDesc": "Should have list of values as C,N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31337",
                    "btLogicalName": "Account Defaulted Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31338",
                    "btLogicalName": "Borrower Cash Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31339",
                    "btLogicalName": "Exposure Funding Currency Same Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31340",
                    "btLogicalName": "Inverse Price Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31341",
                    "btLogicalName": "Knocked Out Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31342",
                    "btLogicalName": "One Way Cash Payment Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31343",
                    "btLogicalName": "Embedded Options Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31344",
                    "btLogicalName": "End Of Month Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31345",
                    "btLogicalName": "Front Stub Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31346",
                    "btLogicalName": "Buy Base Currency Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31347",
                    "btLogicalName": "Buy Or Sell Indicator",
                    "dqDesc": "Should have list of values as B,S",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31348",
                    "btLogicalName": "Cleared Transaction Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31349",
                    "btLogicalName": "Compounding Frequency Unit",
                    "dqDesc": "Should have list of values as D,M,W,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31350",
                    "btLogicalName": "Contract Term Multiplier",
                    "dqDesc": "Should have list of values as D,M,Q,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31351",
                    "btLogicalName": "Guaranteed By Sovereign Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31352",
                    "btLogicalName": "International Banking Facility Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31353",
                    "btLogicalName": "Knocked In Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31354",
                    "btLogicalName": "Reciprocal Cross Holding Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31355",
                    "btLogicalName": "Seniority Claim Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31356",
                    "btLogicalName": "Short Position Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31357",
                    "btLogicalName": "Bonus Forward Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31358",
                    "btLogicalName": "Capital Charge Exclusion Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31359",
                    "btLogicalName": "Fiduciary Relationship Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31360",
                    "btLogicalName": "Exempted Capital Market Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31361",
                    "btLogicalName": "Long Settlement Transaction Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31362",
                    "btLogicalName": "Margined Transaction Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31363",
                    "btLogicalName": "Settled In Home Country Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31364",
                    "btLogicalName": "Account Or Contract Closed Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31365",
                    "btLogicalName": "Delivery Versus Payment Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31366",
                    "btLogicalName": "Materiality Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31367",
                    "btLogicalName": "Secured Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31368",
                    "btLogicalName": "Protection Buy Sell Indicator",
                    "dqDesc": "Should have list of values as B,S",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31369",
                    "btLogicalName": "Claim Foreign Currency And Bank Funding Currency Same Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31370",
                    "btLogicalName": "Embedded Option Type Indicator",
                    "dqDesc": "Should have list of values as N,S",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31371",
                    "btLogicalName": "Over The Counter Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQLOV31372",
                    "btLogicalName": "Prime Brokerage Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQMNDTR50",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQMNDTR51",
                    "btLogicalName": "End Of Period Balance",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQMNDTR52",
                    "btLogicalName": "Market Value",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQMNDTR53",
                    "btLogicalName": "Effective Date",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34786",
                    "btLogicalName": "Account Close Date",
                    "dqDesc": "Reference Check for Account Close Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34787",
                    "btLogicalName": "Account Close Date",
                    "dqDesc": "Reference Check for Account Close Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34788",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34789",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34790",
                    "btLogicalName": "Commission Date",
                    "dqDesc": "Reference Check for Commission Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34791",
                    "btLogicalName": "Commission Date",
                    "dqDesc": "Reference Check for Commission Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34792",
                    "btLogicalName": "Contract Start Date",
                    "dqDesc": "Reference Check for Contract Start Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34793",
                    "btLogicalName": "Contract Start Date",
                    "dqDesc": "Reference Check for Contract Start Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34794",
                    "btLogicalName": "Effective Date",
                    "dqDesc": "Reference Check for Effective Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34795",
                    "btLogicalName": "Effective Date",
                    "dqDesc": "Reference Check for Effective Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34796",
                    "btLogicalName": "Maturity Date",
                    "dqDesc": "Reference Check for Maturity Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34797",
                    "btLogicalName": "Maturity Date",
                    "dqDesc": "Reference Check for Maturity Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34798",
                    "btLogicalName": "Settlement Date",
                    "dqDesc": "Reference Check for Settlement Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34799",
                    "btLogicalName": "Settlement Date",
                    "dqDesc": "Reference Check for Settlement Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34800",
                    "btLogicalName": "Upfront Pay Date",
                    "dqDesc": "Reference Check for Upfront Pay Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34801",
                    "btLogicalName": "Upfront Pay Date",
                    "dqDesc": "Reference Check for Upfront Pay Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34802",
                    "btLogicalName": "Value Date",
                    "dqDesc": "Reference Check for Value Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34803",
                    "btLogicalName": "Value Date",
                    "dqDesc": "Reference Check for Value Date in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34804",
                    "btLogicalName": "Account Manager Code",
                    "dqDesc": "Reference Check for Account Manager Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34805",
                    "btLogicalName": "Account Purpose Code",
                    "dqDesc": "Reference Check for Account Purpose Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34806",
                    "btLogicalName": "Interest Accrued General Ledger Code",
                    "dqDesc": "Reference Check for Interest Accrued General Ledger Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34807",
                    "btLogicalName": "Accrual Status Code",
                    "dqDesc": "Reference Check for Accrual Status Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34808",
                    "btLogicalName": "Account Status Code",
                    "dqDesc": "Reference Check for Account Status Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34809",
                    "btLogicalName": "Accounting Standard Code",
                    "dqDesc": "Reference Check for Accounting Standard Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34810",
                    "btLogicalName": "Adjustment Type",
                    "dqDesc": "Reference Check for Adjustment Type in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34811",
                    "btLogicalName": "Amortization Method For Premium Discount And Fees Code",
                    "dqDesc": "Reference Check for Amortization Method For Premium Discount And Fees Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34812",
                    "btLogicalName": "Application Number",
                    "dqDesc": "Reference Check for Application Number in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34813",
                    "btLogicalName": "Bank Code",
                    "dqDesc": "Reference Check for Bank Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34814",
                    "btLogicalName": "Behavior Type",
                    "dqDesc": "Reference Check for Behavior Type in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34815",
                    "btLogicalName": "Bonus Currency Code",
                    "dqDesc": "Reference Check for Bonus Currency Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34816",
                    "btLogicalName": "Book Type",
                    "dqDesc": "Reference Check for Book Type in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34817",
                    "btLogicalName": "Branch Code",
                    "dqDesc": "Reference Check for Branch Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34818",
                    "btLogicalName": "Business Domain",
                    "dqDesc": "Reference Check for Business Domain in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34819",
                    "btLogicalName": "Business Segment Code",
                    "dqDesc": "Reference Check for Business Segment Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34820",
                    "btLogicalName": "Business Unit Code",
                    "dqDesc": "Reference Check for Business Unit Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34821",
                    "btLogicalName": "ISO Currency Code",
                    "dqDesc": "Reference Check for ISO Currency Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34822",
                    "btLogicalName": "Central Counterparty Code",
                    "dqDesc": "Reference Check for Central Counterparty Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34823",
                    "btLogicalName": "Acquisition Channel Code",
                    "dqDesc": "Reference Check for Acquisition Channel Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34824",
                    "btLogicalName": "Cleared Transaction Bank Role Code",
                    "dqDesc": "Reference Check for Cleared Transaction Bank Role Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34825",
                    "btLogicalName": "Clearing Member Code",
                    "dqDesc": "Reference Check for Clearing Member Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34826",
                    "btLogicalName": "Commitment Contract Code",
                    "dqDesc": "Reference Check for Commitment Contract Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34827",
                    "btLogicalName": "Common Chart Of Account Code",
                    "dqDesc": "Reference Check for Common Chart Of Account Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34828",
                    "btLogicalName": "Account Or Contract Number",
                    "dqDesc": "Reference Check for Account Or Contract Number in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34829",
                    "btLogicalName": "Offset Account Number",
                    "dqDesc": "Reference Check for Offset Account Number in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34830",
                    "btLogicalName": "Country Code",
                    "dqDesc": "Reference Check for Country Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34831",
                    "btLogicalName": "Country Code Of Risk",
                    "dqDesc": "Reference Check for Country Code Of Risk in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34832",
                    "btLogicalName": "Credit Status Code",
                    "dqDesc": "Reference Check for Credit Status Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34833",
                    "btLogicalName": "Data Source Code",
                    "dqDesc": "Reference Check for Data Source Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34834",
                    "btLogicalName": "Day Count Indicator",
                    "dqDesc": "Reference Check for Day Count Indicator in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34835",
                    "btLogicalName": "Day Count Indicator Payable Leg",
                    "dqDesc": "Reference Check for Day Count Indicator Payable Leg in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34836",
                    "btLogicalName": "Deal Identifier",
                    "dqDesc": "Reference Check for Deal Identifier in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34837",
                    "btLogicalName": "Fee General Ledger Code",
                    "dqDesc": "Reference Check for Fee General Ledger Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34838",
                    "btLogicalName": "Financial Market Quote Type",
                    "dqDesc": "Reference Check for Financial Market Quote Type in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34839",
                    "btLogicalName": "Fund Code",
                    "dqDesc": "Reference Check for Fund Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34840",
                    "btLogicalName": "Fund Type",
                    "dqDesc": "Reference Check for Fund Type in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34841",
                    "btLogicalName": "General Ledger Account Code",
                    "dqDesc": "Reference Check for General Ledger Account Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34842",
                    "btLogicalName": "Guarantor Identifier",
                    "dqDesc": "Reference Check for Guarantor Identifier in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34843",
                    "btLogicalName": "Hedge Portfolio Set Code",
                    "dqDesc": "Reference Check for Hedge Portfolio Set Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34844",
                    "btLogicalName": "Holding Type",
                    "dqDesc": "Reference Check for Holding Type in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34845",
                    "btLogicalName": "Holiday Rolling Convention Code",
                    "dqDesc": "Reference Check for Holiday Rolling Convention Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34846",
                    "btLogicalName": "Industry Code",
                    "dqDesc": "Reference Check for Industry Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34847",
                    "btLogicalName": "Instrument Code",
                    "dqDesc": "Reference Check for Instrument Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34848",
                    "btLogicalName": "Instrument Type",
                    "dqDesc": "Reference Check for Instrument Type in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34849",
                    "btLogicalName": "Interest Calculation Method",
                    "dqDesc": "Reference Check for Interest Calculation Method in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34850",
                    "btLogicalName": "Interest Rate Code",
                    "dqDesc": "Reference Check for Interest Rate Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34851",
                    "btLogicalName": "Interest Rate Type",
                    "dqDesc": "Reference Check for Interest Rate Type in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34852",
                    "btLogicalName": "Issuer Identifier",
                    "dqDesc": "Reference Check for Issuer Identifier in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34853",
                    "btLogicalName": "Issuer Identifier",
                    "dqDesc": "Reference Check for Issuer Identifier in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34854",
                    "btLogicalName": "Legal Entity Code",
                    "dqDesc": "Reference Check for Legal Entity Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34855",
                    "btLogicalName": "Line Code",
                    "dqDesc": "Reference Check for Line Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34856",
                    "btLogicalName": "Line Of Business Code",
                    "dqDesc": "Reference Check for Line Of Business Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34857",
                    "btLogicalName": "Loss Cap Currency Code",
                    "dqDesc": "Reference Check for Loss Cap Currency Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34858",
                    "btLogicalName": "Loss Share Agreement Code",
                    "dqDesc": "Reference Check for Loss Share Agreement Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34859",
                    "btLogicalName": "Netting Agreement Code",
                    "dqDesc": "Reference Check for Netting Agreement Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34860",
                    "btLogicalName": "Notional Amount Currency Code",
                    "dqDesc": "Reference Check for Notional Amount Currency Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34861",
                    "btLogicalName": "Organization Unit Code",
                    "dqDesc": "Reference Check for Organization Unit Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34862",
                    "btLogicalName": "Other Currency Code",
                    "dqDesc": "Reference Check for Other Currency Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34863",
                    "btLogicalName": "Ownership Type",
                    "dqDesc": "Reference Check for Ownership Type in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34864",
                    "btLogicalName": "Fiduciary Parent Account Number",
                    "dqDesc": "Reference Check for Fiduciary Parent Account Number in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34865",
                    "btLogicalName": "Party Identifier",
                    "dqDesc": "Reference Check for Party Identifier in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34866",
                    "btLogicalName": "Pay Currency Code",
                    "dqDesc": "Reference Check for Pay Currency Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34867",
                    "btLogicalName": "Portfolio Code",
                    "dqDesc": "Reference Check for Portfolio Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34868",
                    "btLogicalName": "Product Code",
                    "dqDesc": "Reference Check for Product Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34869",
                    "btLogicalName": "Product Type",
                    "dqDesc": "Reference Check for Product Type in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34870",
                    "btLogicalName": "Provision General Ledger Code",
                    "dqDesc": "Reference Check for Provision General Ledger Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34871",
                    "btLogicalName": "Receivable Currency Code",
                    "dqDesc": "Reference Check for Receivable Currency Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34872",
                    "btLogicalName": "Rebate Currency Code",
                    "dqDesc": "Reference Check for Rebate Currency Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34873",
                    "btLogicalName": "Referral Line Of Business Code",
                    "dqDesc": "Reference Check for Referral Line Of Business Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34874",
                    "btLogicalName": "Region Code",
                    "dqDesc": "Reference Check for Region Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34875",
                    "btLogicalName": "Repayment Type",
                    "dqDesc": "Reference Check for Repayment Type in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34876",
                    "btLogicalName": "Retention Offer Type",
                    "dqDesc": "Reference Check for Retention Offer Type in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34877",
                    "btLogicalName": "Securities Guarantor Identifier",
                    "dqDesc": "Reference Check for Securities Guarantor Identifier in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34878",
                    "btLogicalName": "Seniority Code",
                    "dqDesc": "Reference Check for Seniority Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34879",
                    "btLogicalName": "Settlement Currency Code",
                    "dqDesc": "Reference Check for Settlement Currency Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34880",
                    "btLogicalName": "Settlement Country Code",
                    "dqDesc": "Reference Check for Settlement Country Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34881",
                    "btLogicalName": "Settlement Type",
                    "dqDesc": "Reference Check for Settlement Type in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34882",
                    "btLogicalName": "Ticker Symbol",
                    "dqDesc": "Reference Check for Ticker Symbol in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34883",
                    "btLogicalName": "Trading Desk Identifier",
                    "dqDesc": "Reference Check for Trading Desk Identifier in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34884",
                    "btLogicalName": "Underlying Currency Code",
                    "dqDesc": "Reference Check for Underlying Currency Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34885",
                    "btLogicalName": "Underlying Code",
                    "dqDesc": "Reference Check for Underlying Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34886",
                    "btLogicalName": "Underlying Instrument Type Code",
                    "dqDesc": "Reference Check for Underlying Instrument Type Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34887",
                    "btLogicalName": "Underlying Instrument Code",
                    "dqDesc": "Reference Check for Underlying Instrument Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34888",
                    "btLogicalName": "Underlying Type Code",
                    "dqDesc": "Reference Check for Underlying Type Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34889",
                    "btLogicalName": "Upfront Currency Code",
                    "dqDesc": "Reference Check for Upfront Currency Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                },
                {
                    "dqId": "DQREF34890",
                    "btLogicalName": "Write Off General Ledger Code",
                    "dqDesc": "Reference Check for Write Off General Ledger Code in Stage Forwards Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:10.0",
                    "modifiedDate": "2024-11-04 04:39:04.0"
                }
            ],
            "useCases": [
                {
                    "ucId": "ALM",
                    "ucName": "Asset Liability Management"
                },
                {
                    "ucId": "BASEL",
                    "ucName": "Regulatory Capital Adequency"
                },
                {
                    "ucId": "BSP",
                    "ucName": "Balance Sheet Planning"
                },
                {
                    "ucId": "FTP",
                    "ucName": "Funds Transfer Pricing"
                }
            ]
        }
    ]
}