{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "Account Attrition Score",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the attrition score of the account. Attrition score is to define the probability of losing the account. Higher score translates into more chances of losing the account. Attrition reason can be Pricing Dissatisfaction, Product features dissatisfaction, Service Dissatisfaction etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Classification Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to classification code of the account. The list of values of account classification can be Fair Value, Amortized Cost, Available for Sale, Held till Maturity etc. Account Classification Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Customer Net Revenue",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to total revenue less the loss or expenses and taxes incurred for that account at customer level. \nIn case of Investments, Leases, Merchant Cards, Options, Swaps and Trusts: It is the sum of Total Commitment Amount Plus Fee Amount Plus Communication Charges Plus Other Charges Plus Other Party Charges Minus Allocated Cost.\nIn case of Casa, Cards, OD, TD, LC and Commitment contracts: Interest earned + Fees + Charges + Commission, Interest rate paid + Expenses.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Defaulted Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the account has defaulted. This is an account that is under prolonged delinquent state.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Display Name",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description",
                    "gcd": "Refers to account name which should be displayed in the account. This is often the name of the primary customer on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Limit Utilization Percentage Inception Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the utilization percent or utilization ratio of the account since inception. Utilization percent is a measure of the credit limit utilization of an account. The utilization percent since inception can be calculated as the average outstanding balance divided by average credit limit or credit line amount since inception. Account utilization ratio is an important parameter considered by financial institutions since it helps in assessing the credit profile of a customer or prospect in a more accurate manner.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Limit Utilization Percentage Year Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the utilization percent or utilization ratio of the account year till date. Utilization percent is a measure of the credit limit utilization of an account. The year to date account utilization percent is calculated in a cumulative manner. This is because the financial institution may charge fees on unused amount of the loan. The account utilization percent is a measure of the percent of the total credit line amount used.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Manager Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the account manager is an employee who is responsible for the day to day management of accounts of a particular customer. The account manager is a point of contact, and provides customer support, up selling, technical assistance and general relationship management. An account manager may be in charge of a number of smaller accounts, or may focus on a few larger accounts. This column Refers to the account manager code or the unique employee identifier of the manager assigned by the financial institution. Management Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Or Contract Closed Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the account is closed. Account can be closed upon maturity of the account, transfer of the account, death of the account holder or write off.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Or Contract Number",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of the account or contract held by the customer. Account number is defined as numbers, letters or alphanumeric code assigned to every significant customer, supplier and lender for ease of reference in accounting records of the financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Peer Group Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the account peer group of which this account is a member. An account is classified into one peer group, if provided as part of the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Pool Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the pool id generated using Retail Pooling, Basel pooling, etc. used for exposure.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Purpose Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the purpose for which account has originated, purpose or special use of this account. Account purpose dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Reinstatement Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the letter of credit account was reinstated. LC can be revolving in order to minimize the credit availed from the financial institution. The credit availed is reinstated upon successful receipt of documents from the exporter.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Retention Segment Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to unique identifier of the account retention segment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Risk Score",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to risk score of the account. This is generally applicable for retail customers. Higher score translates into better credit rating.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the status of the account. List of values can be Active, Inactive, in foreclosure, Re negotiated, Dispute, Frozen, Past Due, Closed etc. Account Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Sub Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Account Sub Type Code that is sub classified as per the banking source system for their internal operational purpose.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Account Type Code that is classified as per the banking source system for their internal operational purpose. \nIn case of ALM FTP applications, Account type are fixed set of values.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Under Enforcement Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if an account that has been written off, defaulted, is under enforcement for the recovery of dues.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accounting Standard Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the accounting standard or the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. E.g. GAAP, IFRS etc. Generally Accepted Accounting Principles, GAAP. GAAP are the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. The Generally Accepted Accounting Principles exist to ensure that accountants are using the same or almost the same standards so that comparison of financial statements between or within a company is easy and accurate. They also promote transparency in accounting. However, GAAP provides broad guidelines, there is room for companies to follow an approach within a guideline.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accrual Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the accrual status codes. Accrual Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accrued Commission Month Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the commission amount accrued from month till date. In case the commission is earned for a relatively long period of time, it may be amortized over a period of time.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Acquisition Channel Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the channel through which customer was acquired.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Actual Number Of Business Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the actual Number of Business Days between Remargining for Capital Market Transaction or Revaluation for Secured Transaction. This information is required in the volatility hair cut calculation. When the frequency of remargining or revaluation is longer than the minimum, the minimum haircut numbers will be scaled up depending on the actual number of business days between remargining or revaluation using the square root of time formula.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Additional Fees For Effective Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to any additional fees received beyond the origination date. This data is used to compute the EIR effective interest rate. Additional fees received is for a particular period. For example, a loan is originated in 2010. Origination fees is USD100. Additional fees received in Sep 2015 is USD50. This column will store USD50 for Sep 2015.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjusted Loss Given Default Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the Adjusted LGD for an exposure and mainly used for Internal Model Method to arrive at RWA. This is expressed in decimal number, For example, 30 percent will be 0.3.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjustment Effective Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the adjustment Effective Date for determining the reference date for the IRC rate lookup.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjustment Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier for adjustment type dimension at an account. Examples can be CONTRA,NEW etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Allocated Cost",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the allocated cost, which is generally populated by the Profitability App. This includes all the indirect expenses, like facilities, IT, Operations etc., which need to be allocated back to the account in order to arrive at the correct profitability of the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Allocated Transfer Risk Reserve Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Allocated Transfer Risk Reserve, ATRR. An allowance for bad debts that a bank keeps in order to protect against country risk. For example, a bank may keep an ATRR in case a country renders its currency inconvertible, which would prevent a foreign borrower in that country from making payments. This is a requirement of FDIC regulation which mandates that a banking institution shall establish an allocated transfer risk reserve, ATRR, for specified international assets when required by the Board.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Method For Premium Discount And Fees Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the amortization method used for premium, discount and fees. Indicative values are STRAIGHTLINE or LEVELYIELD, LEVELYIELD being the default one.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amount Available As On Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total amount available as on date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amount Availed To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount availed till date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amount Due In Next Twelve Months",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Amount Due In Next 12 Months.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amount In Local Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the LC contract amount in local currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amount Liquidated To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount liquidated till date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "As Of Date",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Asset Financing Company Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether the exposure is towards an Asset Financing Company.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Attrition Reason Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the reason code for which customer has canceled the contract or the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Automatic Cancellation Of Commitment Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the contract has a feature of automatic cancellation in it. An automatic cancellable contract means that the contract can be cancelled automatically, if certain conditions mentioned in the contract agreement are satisfied. This is used for the assignment of credit conversion factor, in the case of Regulatory capital calculations like Basel.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Available For Sale Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the account has been marked for sale or securitization in near future.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Balance Month Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the monthly Average balance. There are different ways to compute monthly average balance. A simple method would be, Opening balance Plus Closing Balance, divided by 2. A complex method would be find out for how many days the balance was with the Financial Institution and then compute the average balance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Backed By Bullion Liability Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is backed by bullion. Backed by bullion indicates that the exposure is backed by physical holdings of the gold metal. This can be useful to identify if a mutual fund or an exchange traded fund is backed by physical holdings of gold. At national discretion, gold bullion held in own vaults or on an allocated basis to the extent backed by bullion liabilities can be treated as cash and therefore risk weighted at 0 percent. In addition, cash items in the process of collection can be risk weighted at 20 percent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Banking Arrangement Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to banking arrangement code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Banking Book Exposure Or CCR Hedge Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate that this exposure is used to hedge the banking book exposure or CCR.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Banks Own Estimate Of Credit Conversion Factor Percent",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the Credit Conversion Factor percent estimate by the bank. This is applicable only to the off balance amount or products and not to the bills contracts. Using this weight as factor, Risk weighted Assets are calculated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Behavior Sub Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the behavior sub type which is used by ALM application to predict behavior patterns for instruments that do not have contractual cash flows.\nThe behavior sub type values are based on the behavior type and values are Sight Devolvement, Sight Recovery, Usance Devolvement and Usance Recovery, from Behavior Pattern. If sub type code is Sight and devolvement code is yes, then all recovery events are processed. If sub type code is Sight and Devolvement code is No then all Sight Events are processed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Behavior Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to unique identifier of behavior type code. Expected values are Non Maturity, Non Performing And Devolvement, Recovery, Volatile, Core and Non Core. \nThe payment and repricing characteristics can be gathered for most financial instruments, but for some the contractual cashflows may be absent or may be based on occurrence of certain events. Asset Liability Management allows you to define custom behavior, payment and repricing patterns to accurately model the unique characteristics for such instruments. Behavior pattern can be defined for the following types of instruments \nNon maturity Instruments,\nNon Performing Instruments,\nDevolvement and Recovery of Guarantees.\n\nOnce you create a behavior pattern, you can use it by mapping the unique behavior pattern code as the amortization type code for your instruments. Behavior pattern codes are defined within a pre set range, 70000 – 99999. When the cash flow engine encounters an instrument with an amortization type code within this pre determined range, it understands that a Behavior Pattern should be referenced for determining the principal cash flow amounts. Non performing Asset need not have a sub type associated, all the events i.e. substandard, doubtful or loss is processed. No interest cashflow will be generated and any balance on the maturity date would be written off. In the case of non maturity instruments the core and volatile runoff events are run. Interest cashflow is paid out on the payment dates. The engine assumes the maturity of the longest non maturing instrument as the maturity date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Book Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to if the contract is related to the banking book or trading book. Usually contracts like loans and leases are on the banking book. However, instruments like mortgage backed securities can be held on the trading book of the financial institution. If the value is updated as T then exposure or contract belongs to trading book and if the value is updated as B then it belongs to banking book.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Borrower Capital Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates that the borrower contributed the amount of capital required before the bank advances funds under the credit facility, and the capital contributed by the borrower or internally generated by the project is contractually required to remain in the project throughout the life of the project.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Borrower Cash Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates that the borrower contributed capital to the project in the form of cash or unencumbered readily marketable assets, or has paid development expenses out of pocket, of at least 15 percent of the real estate is appraised ‘‘as completed’’ value.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Branch Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the branch code. A branch, banking center or financial center is a retail location where a financial institution offers a wide array of face to face and automated services to its customers. This column Refers to the unique branch code assigned by the financial institution. A branch may specialize to offer certain type of products to customers. Branch needs approval from the regulators.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Days Needed For Long Transaction",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the business days needed for Long Settlement Transactions, this signifies that number of business days to deliver the agreed items after date of transaction, future date. PFD Ref  Non Sec STD Long settlement transactions. As per Basel accord Annex 4 para no. 2B, Long Settlement Transactions are transactions where a counterparty undertakes to deliver a security, a commodity, or a foreign exchange amount against cash, other financial instruments, or commodities, or vice versa, at a settlement or delivery date that is contractually specified as more than the lower of the market standard for this particular instrument and five business days after the date on which the bank enters into the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Domain",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of the business domain., such as Institutional or Retail Brokerage. This is used to control access to data across distinct business operations.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Risk",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the level of risk associated with this account with respect to business characteristics. List of values are in the range of 0 10 with increasing values denoting increasing risk levels.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Unit Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the business unit code as defined by the organization. A business unit is generally a broader definition and represents all the units in an organization. Business Unit dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Buy Or Sell Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates if the contract holder is the buyer or seller of the contract. This is applicable in case of derivative contracts like futures, forwards, options etc. A Buyer of a futures contract is said to be long while the seller is said to be short. In case of repo transactions, the party doing the reverse repo is referred to as the buyer. The seller of securities sells to the party with an agreement to buy back at a later date. List of Values are B, Buy, and S, Sell.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Calculation Option Display Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the choice between Just shifting the dates for holiday calendar and recalculating the payments based on the new dates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Campaign Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the campaign under which the account was acquired. Campaign is defined as Specific activities designed to promote a product, service or business. A marketing campaign is a coordinated series of steps that can include promotion of a product through different mediums like television, radio, print, online using a variety of different types of advertisements. The campaign doesn't have to rely solely on advertising, and can also include demonstrations, word of mouth and other interactive techniques. Campaigns are created or started by financial institutions to promote sales, improve visibility of the brand or product and create opportunities for addon sales and cross selling.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Capital Market Exposure Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is a capital market exposure. The capital market exposures would include both their direct exposures and indirect exposures of a financial institution. This is applicable to India jurisdiction. As per Reserve Bank of India, following would qualify as a capital market exposure, CME, Direct investments in equity shares, convertible bonds, convertible debentures and units of equity oriented mutual funds the corpus of which is not exclusively invested in corporate debt, advances against shares or bonds or debentures or other securities or on clean basis to individuals for investment in shares, including IPOs or ESOPs, convertible bonds, convertible debentures, and units of equity oriented mutual funds, advances for any other purposes where shares or convertible bonds or convertible debentures or units of equity oriented mutual funds are taken as primary security, advances for any other purposes to the extent secured by the collateral security of shares or convertible bonds or convertible debentures or units of equity oriented mutual funds i.e. where the primary security other than shares or convertible bonds or convertible debentures or units of equity oriented mutual funds does not fully cover the advances, secured and unsecured advances to stockbrokers and guarantees issued on behalf of stockbrokers and market makers, loans sanctioned to corporate against the security of shares or bonds or debentures or other securities or on clean basis for meeting contribution of promoter to the equity of new companies in anticipation of raising resources, bridge loans to companies against expected equity flows or issues, underwriting commitments taken up by the banks in respect of primary issue of shares or convertible bonds or convertible debentures or units of equity oriented mutual funds. However, with effect from April 16, 2008, banks may exclude their own underwriting commitments, as also the underwriting commitments of their subsidiaries, through the book running process for the purpose of arriving at the capital market exposure of the solo bank as well as the consolidated bank. The position in this regard would be reviewed at a future date, financing to stockbrokers for margin trading, all exposures to Venture Capital Funds, both registered and unregistered.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Central Counterparty Rejection Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the central counterparty has rejected the transaction. Transactions rejected by a qualifying central counterparty, because, for example, of a discrepancy in the details of the transaction such as in quantity, price, or in the underlying security, between the buyer and seller, potentially give rise to risk exposure to either party.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Claim And Funding Liability Similar Currency Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if exposure and collateral are denominated or associated with same currency or not. This is applicable for property and mortgage loans. The flag is applicable for Basel I calculations and identifies whether the Claims on central governments and central banks outside the OECD will also attract a zero weight, or a low weight if the national supervisory authority elects to incorporate interest rate risk. This is applicable in case of contracts involving collateral.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Claim Foreign Currency And Bank Funding Currency Same Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the financial institution is funded in the same currency as that of a claim. This is applicable in case of claims on foreign sovereigns. This is applicable to Basel regulation of India jurisdiction. Claims denominated in domestic currency of the foreign sovereign met out of the resources in the same currency raised in the jurisdiction of that sovereign will attract a risk weight of zero percent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Closed Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the party disassociates all direct and indirect relationship with the financial institution, this could also be on account of the death of an individual or dissolution of an entity.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Closure Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of closure of the letter of credit contract. This is the reason why the contract is in a closed status. List of values are Expired, Cancelled, Matured etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commission Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to any commission that is earned by the bank from a customer or either of customer accounts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commission General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the Sales commission. To be used in conjunction with n_sales_commission. GL Account dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commission Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the commission rate applicable for the contract. This is the rate applied on the total contract amount or availed amount based on agreement to compute the total commission amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commitment Contract Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of commitment contract code. Commitment contract covers the, irrevocable, committed portion of the facility extended to the customer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Common Chart Of Account Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the chart of accounts is a listing of the names of the accounts that a financial institution has identified and made available for recording transactions in its general ledger. A financial institution has the flexibility to define its chart of accounts as per requirement, including adding accounts as needed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Communication Charges",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount incurred by the Financial Institution towards communication charges. This would include direct expenses. Additionally, Financial Institution may allocate indirect expenses to an account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Walk Away Clause Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the contract contains a walk away clause for Over the Counter derivative transactions and Securities Financing transactions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Country Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the country code associated with the account or instrument or party or location. There are several popular country codes as part of ISO 3166 standard published by the International Organization for Standardization. ISO 3166 defines codes for the names of countries, dependent territories, special areas of geographical interest and their principal subdivisions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Country Code Of Risk",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the ISO country code of the risk. Country of risk refers to the country wherein the counter party does business. Dim Country is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Conversion Factor For Drawn Portion Of Exposure",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Store Credit Conversion Factor for the drawn portion of off balance sheet exposure. It is used in calculating effective amount an exposure. This is expressed in decimal number, For example, 30 percent will be 0.3.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Conversion Factor Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the Credit Conversion factor value for an exposure. It is applicable for undrawn part of on balance sheet and drawn and undrawn part of off balance sheet exposures and is used for calculating the effective amount of exposure for which credit risk needs to be calculated. This is expressed in decimal number, For example, 30 percent will be 0.3.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Participation Tranche Identifier Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier for the Participation Tranche. For participation or syndication arrangement, amount is often not disbursed in single go. Multiple disbursements are referred to tranches here.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Quality Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the credit quality type. Indicative Values are Low Pass, Pass, Watch List, Loss etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the current performance status of the account. List of values are Delinquent, Foreclosed, Impaired, Closed, Disposed, Transferred, Bankrupt etc. Credit Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Deferred Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to deferred current balance refers to Current un amortized deferred balance representing future income or expense such as premium or discount. Deferred Current Balance holds the discount or premium associated with an instrument. A discount loan or instrument is one with interest deducted from the face value of the loan at its origination. The discount amount is the difference between the loans current market price and its stated par value. The deferred current balance, which represents income, will be amortized over the life of the instrument according to a constant yield calculation. Therefore, as the instrument approaches maturity, the book balance approaches the face value or par balance. For discounted instruments, the deferred current balance is a negative balance. This indicates to the cash flow engine that the balance is income.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Deferred Premium Or Discount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the current Deferred Premium or Discount refers to Current non amortized deferred balance representing future income or expense such as premium or discount. Deferred Current Balance holds the discount or premium associated with an instrument. A discount loan or instrument is one with interest deducted from the face value of the loan at its origination. The discount amount is the difference between the loans current market price and its stated par value. The deferred current balance, which represents income, will be amortized over the life of the instrument according to a constant yield calculation. Therefore, as the instrument approaches maturity, the book balance approaches the face value or par balance. For discounted instruments, the deferred current balance is a negative balance. This indicates to the cash flow engine that the balance is income.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Daily Receipt Payment Cash Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Indicates if the instrument is subject to daily receipt and payment of cash variation. This is applicable in case of margin accounts and contracts with margin requirements. Margin requirements are common in case of exchange traded derivatives that are marked to market on a daily basis.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Jurisdiction",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the mantas classification associated with this record. This can be a jurisdiction which represents geographical or legal entity monitoring on data restrictions. Values can be AMEA, INDV, CORP etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source system from where data is extracted. Data can be sourced from multiple sources, this column will Refers to the source code from where the data is extracted for this extraction date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Day Count Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the day count indicator. Expected values are A/360, A/365, A/A, 30/360, 30/360 EUROPEAN, 30/A. Suggested default value are 1=30/360 for amortizing transactions OR 3=Act/Act. for non amortization.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Deferred Costs",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the deferred financing costs or debt issuance costs is an accounting concept meaning costs associated with debt issuing process, such as various fees and commissions paid to investment banks, law firms, auditors, regulators, and so on.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Deferred Fees Unamortized Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the current deferred fees amount, reflecting the unamortized portion. Fees that are amortized through the life of the loan such as Closing Fees or Amendment Fees.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delinquency Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of days the account has remained delinquent in the current delinquency period. The account could have been delinquent a number of time earlier, but Refers to the current delinquency days.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delinquency Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Captures the unique identifier of delinquency status. Indicative values are Charge off, Redeemed, Doubtful, Bad Debt, Sub Standard, Non Performing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delivery Versus Payment Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if it is a DvP, Delivery Versus Payment, or RvP, Receive Versus Payment, trade or not. Delivery versus payment, DVP, is a settlement system that stipulates that cash payment must be made prior to or simultaneously with the delivery of the security. Delivery versus payment is from the perspective of buyer and from the perspective of seller, this system is called receive versus payment, RVP. For DvP transactions, if the payments have not yet taken place five business days after the settlement date, firms must calculate a capital charge by multiplying the positive current exposure of the transaction by the appropriate factor, according to a Table given by Basel. List of values are Y, N. Y indicates it is a DVP.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Devolved Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount invoked by the counterparty, also known as the beneficiary, of the guarantee on the guaranteeing institution, Bank, for non fulfillment of guarantee conditions by the Party, the customer of the bank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Devolvement Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the devolvement amount of a Letter of Credit.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Devolvement Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the devolvement status code. Devolvement is a process whereby if an investment issue is undersubscribed, an underwriter is required to subscribe to the remaining shares. The outstanding unsubscribed amount devolves onto the underwriter. This column will hold the values as Devolved or Not Devolved.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discount Margin",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Discount Margin is average expected return earned over a given reference rate, that is additional to given reference rate, for a floating rate security. Column is applicable for instruments like Floating Rate Note. Refers to the margin or spread that must be added to discount rate obtained from interest rate curve to get the final discount rate that is used to calculate present value of an instrument. This is an optional input and is specified as a rate or price, see Discount Rate Margin Type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discount Rate Margin Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Indicates the form in which Discount Margin is given. Indicative Values are RATE, Rate Spread, PRICE, Price of instrument per 100. When it is given as PRICE then engine solves it to obtain a rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discounting Day Counter",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the discounting day convention. The possible values are Actual/360, Actual/365, Fixed, Actual/Actual, Business/252, Thirty/360 etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Double Default Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure has a double default. Double default is explained as a case where both the obligor and the guarantor defaults. The CRM treatment is different for exposures which comes under the double default category.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Downgrade Impact Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the downgrade Impact amount. This is the amount that will be posted as collateral for liabilities if legal entities rating goes below the stated rating, this stated rating is called as downgrade trigger.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Downgrade Trigger Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the trigger identifier for each account. A trigger is the set of condition in a accounts agreement that initiates a specific action in the event of a change in a firms credit rating. For example, a downgrade in a firms credit rating may set off posting additional collateral.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Draw Notice Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of days of notice that legally needs to be provided to the Bank by the party, obligor, to draw on the loan. Also, the drawdown request would have to be processed and the time required is factored into the notice days.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Exposure Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the effective expected exposure amount at a specific date is the maximum expected exposure that occurs at that date or any prior date. Alternatively, it may be defined for a specific date as the greater of the expected exposure at that date, or the effective exposure at the previous date. In effect, the Effective Expected Exposure is the Expected Exposure that is constrained to be non decreasing over time.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Maturity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the effective maturity of an exposure. Typically, it would be longest possible remaining time before the counterparty is scheduled to fulfill its obligation. It is used in RWA calculation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Maturity Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the effective maturity date of the contract. Effective maturity takes into account that certain instruments like bonds have a callable feature which can likely shorten the maturity of these instruments.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Eligible Protection Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether this position has received the eligible CD or Guarantee from eligible securitization guarantor.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Embedded Option Type Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates as S if the embedded option is separated form host contract and as N if it is non separated. List of Values are S and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to end of period balance which includes accrued interest. All the calculations such as interest, prepayment amounts etc. are based on this amount. This is used in all the calculations performed by cash flow engine. In Case of LC Contracts, EOP Balance should be populated when LC Is executed. Till LC is executed, LC amount sanctioned should be hold in Total Commitment Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the end of period book balance. It is the sum of total of End of Period Balance Plus Deferred Balance. This is used while calculating amortization. The book balance is the term financial institutions use to describe the amount of money available before any adjustments have been made for deposits in transit, checks that have not yet been cleared, reserve requirements and interest received from 'float funds' hence is generally greater than end of period balance, Also called as 'gross balance'. It also excludes any deferred balance that is unamortized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exempted Capital Market Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if an investment in paid up equity of the financial entity is exempt from capital market exposure.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Expected Loss Best Estimate Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the best estimate of expected loss. This is applicable to exposures which have already defaulted. This is useful when financial institutions use their own estimates of Loss given default.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Expiry Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the expiration date of the account or contract. Expiration is the date after which the contract ceases to hold true.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Explicit Adjustment For Effective Maturity Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether there is an Explicit Adjustment for Effective Maturity or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure At Default Post Mitigation",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the exposure at default amount post mitigation by all eligible mitigants\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure At Default Pre Mitigation",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the pre mitigation Exposure at default amount of the total exposure, as applicable to the particular jurisdiction. This is generally equal to the sum of Exposure of default pre mitigation for the drawn portion of the exposure and the exposure of default per mitigation for the undrawn portion of the exposure.\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure Funding Currency Same Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the financial institution is funded in the same currency as that of a claim. This is applicable in case of claims on foreign sovereigns. This is applicable to Basel regulation of India jurisdiction. Claims denominated in domestic currency of the foreign sovereign met out of the resources in the same currency raised in the jurisdiction of that sovereign will attract a risk weight of zero percent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure Held At Fair Value Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is held at fair value. Fair value is applicable to exposures involving less liquid and physical assets. In case of actively traded instruments, the market value is the fair value. This is in the context of Financial Accounting standards board.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure Limit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the limit amount sanctioned for the line under which the guarantee is provided. Sanctioned limit is referred as an extent to which a financial institution will advance credit to a customer. Also called a guidance line of credit, its computation may differ from institution to institution, and is rarely, if ever, disclosed to customers.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure One To Four Family Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure in the form of one  to four family residential construction loans if the residences have been pre sold under firm contracts to purchasers who have obtained firm commitments for permanent qualifying mortgages and have made substantial earnest money deposits, and the loans meet the other underwriting characteristics established by the agencies in the general risk based capital rules.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure Ongoing Finance Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is part of the financial institutions ongoing financing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure Reporting Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the currency in which the exposure needs to be reported.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "External Customer Branch International Banking Facility Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the Non related Customer branch is an International Banking Facility,IBF, or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Failed Trade Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the trade is a failed trade. Failed trades are trades that have occurred but not have settled. There are different guidelines for capital treatment of failed trades. European standards are dictated at directive level and permit a 5 business day grace period after settlement date on delivery versus payment, DvP, transactions before any charges are imposed at which point they are subject to charges on the exposure. These increase to 100 percent after 46 days. Settlement date is not defined or subject to specific limitations. For non DvP transactions, the charge starts immediately, with a one day grace period for cross border transactions, at a flat eight percent risk weighting of the exposure to the counterparty. US banking regulators take a balance sheet approach, under which a standard risk weight, usually 100 percent but in some cases 20 percent, is applied to the full notional amount of trades that have failed to settle without a grace period. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fair Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to fair value of an asset. Fair Value is a rational and unbiased estimate of the potential market price of and asset. The Financial Accounting Standards Board, FASB, issued 'Statement of Financial Accounting Standards No. 157: Fair Value Measurements, FAS 157,' in September 2006 to provide guidance about how entities should determine fair value estimations for financial reporting purposes.\n\nFair value is however measured based on the guidelines FASB 13 which has 3 levels.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fatca Pool Report Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the FATCA Pool Report Code. List of values are FATCA201  Recalcitrant account holders with US Indicia, FATCA202  Recalcitrant account holders without US Indicia, FATCA203  Dormant Accounts, FATCA204  Non participating foreign financial institutions, FATCA205  Recalcitrant account holders that are US persons and FATCA206  Recalcitrant account holders that are passive Non Financial Foreign Entities.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fatca Reporting Period End Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the FATCA reporting period end date. This date is the date on which the net worth is reported at the account level for FATCA purpose. This is used in conjunction with the column FATCA Reporting Period Net Worth Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fatca Reporting Period Net Worth Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the FATCA Reporting Period Net worth amount. This is the total net value of all assets associated with this account expressed in base currency as of the end of the last reporting period. This is the aggregate value of all holdings in this account, with a reduction for any margin loans or other debts owed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fatca Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the FATCA Status Code. List of values are INDETER  Indeterminate, RECALC  Recalcitrant, USP  US Person, NPFFI  Non Participating Foreign Financial Institution, PAS NFFE  Passive Non Financial Foreign Entity, ACT NFFE  Active Non Financial Foreign Entity, PFFI  Participating Foreign Financial Institution, EXC NFFE  Excepted Non Financial Foreign Entity, OWNER.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fee Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the fees charged or paid by the Financial Institution in originating or acquiring the given instrument or account. Incase of investments, It Refers to the fee receivable i.e. current fee which has been assessed internally but not yet due to be charged for the account. It is used to calculate the Amortized Cost. If Amortized cost is not sourced in the Investments table, then it is derived from EOP balance + Current Deferred Premium Or Discount  Accrued interest  Fees  Deferred Fees Unamortized Amount. In case of bills, it refers to the fees charged by the financial institution in purchasing the bill and paying the amount to the exporter.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fee General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds fee amount. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fees For Effective Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the consolidated current un amortized, portion of the, fees which is or are applicable for, or are integral part of, Effective Interest Rate computation as per IFRS 9. This value will be used within the Cash Flow Engine.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fiduciary Relationship Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account is held with the bank under a fiduciary capacity. Fiduciary capacity means trustee, executor, administrator, registrar of stocks and bonds, transfer agent, guardian, assignee, receiver, or custodian under a uniform gifts to minors act investment adviser, if the bank receives a fee for its investment advice any capacity in which the bank possesses investment discretion on behalf of another or any other similar capacity that the regulator authorizes. For example deposits that are placed with a bank by a national bank for which the bank is a fiduciary.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Foreclosure Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to identify if the contract is foreclosed or pre closed. Preclosure refers to the early closure of the contract. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Foreign Exchange Cover",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the foreign exchange cover, hedge, required for the Letter of Credit contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forex Haircut",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the foreign exchange haircut applicable and is applicable for Over the counter contracts. Haircut is a generic term used in transactions involving collateral. A haircut is usually applied on the market value of the collateral to arrive at a more realistic value of the collateral. The haircut depends on multiple factors such as volatility, liquidity etc. of the collateral.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "General Ledger Account Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique general ledger account code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Geography Risk",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the level of geographical risk associated with this account. List of values are in the range of 0 10 with increasing values denoting increasing risk levels.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Global Relationship Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Flag indicates if this account is a part of a global or major corporate relationship, that is, one of several accounts held with a large, trusted customer, List of Values are Y = Yes, N= No.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Guaranteed By Sovereign Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if an account is partially or fully guaranteed by the Sovereign, Government agencies or sponsored agencies. This is derived using Standard Guarantor Type of an account or Standard Issuer type of Mitigant of the Account. List of values are Y and N. This also indicates if the exposure is directly and unconditionally by a sovereign entity or an entity for which zero risk weight is applicable in standardized approach. Claims on BIS, Bank of International Settlement, IMF, International Monetary Fund, ECB, European Central bank, MDB, Multilateral Development Bank, carry zero risk weight. Examples of MDB are The Asian Development Bank, ADB, The African Development Bank, AfDB, The European Investment Bank, EIB, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Hedge Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the status of hedge associated with the account. List of values are Full Hedging, Partial Hedging and No Hedging. Hedging is an investment to offset the potential loss or gain due to a certain asset price change. Hedging is undertaken by corporate finance team to hedge against common risks such as foreign exchange, price fluctuations of certain materials etc. Exposures such as loans, cards etc. can also be hedged with the use of certain instruments. For instance, a loan disbursed to a corporate entity can be hedged by buying protection, Credit Default Swap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Hedged Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount which is required as part of asset hedging. If there is a hedge associated with the asset, the value that has been offered as hedge is stored as hedge amount. As per bcbs 238, if the asset was sold and thereby the hedge was terminated then there is an impending cash outflow to address the open risk position.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holding Period For Haircut",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the holding period in days to arrive at the base volatility haircut of an exposure. The standard supervisory haircuts, are based on an assumed 10 business day minimum holding period for derivatives and eligible margin loans.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holding Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holding intent of the account. Holding Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holiday Display Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holiday calendar code as per the holiday calendar defined through the UI.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holiday Rolling Convention Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holiday rolling convention code, based on which the date on which cash flow has to happen is decided. This includes  Following business day, Modified following business day, Previous business day, Modified previous business day etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "IFRS Nine Provision Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the portion of the previous period 'Expected Credit Loss, ECL,' related to the undrawn part of the instrument or account. Allowance is the portion of ECL for the drawn part while Provision is the provision ECL for the undrawn part.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "IFSB Contract Type Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Islamic Financial Services Board classification of the instrument. This is applicable in case of Islamic finance products. Examples, include Murabahah, Musharakah, Sukuk, etc. Ifsb Contract Type Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "ISO Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Indemnification Asset Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to indemnification amount of the asset arising from loss sharing agreement. Indemnification is the part of an agreement that provides for one party to bear the monetary costs, either directly or by reimbursement, for losses incurred by a second party.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Industry Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the code that describes the primary business activity of the obligor or the industry to which the party is associated to as per the North American Industry Classification System, NAICS. If the NAICS code is not available, provide either the Standard Industrial Classification, SIC, or Global Industry Classification Standard, GICS. If the obligor is an individual, the industry code should be consistent with the industry in which the commercial purpose of the loan operates.\nIf the business or individual operates in multiple industries, the BHC or IHC should report the industry that best represents the commercial risk of the loan, i.e., the predominant industry.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Initial Fees For IFRS Nine Effective Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the consolidated initial, un amortized, fees which is or are applicable for, or are integral part of, Effective Interest Rate computation as per IFRS 9. This value will be used to compute the Effective Interest rate as of account inception date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to a unique Code representing a particular Instrument. This code can be ISIN Code, CUSIP, SEDOL etc. Instrument Contract dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Short Term Qualification Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account qualifies as a short term exposure. This is required for risk weight assignment in the Standardized Approach. Qualifying short term exposures usually have a preferential treatment. Short term exposures are defined as exposures having an original tenor of less than three months. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of instrument type, which is defined as code identifying the instrument category of the customer account. Instrument Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Accrued Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the accrued interest amount associated with the contract. This is the interest that has accumulated on an instrument since the last interest payment up to, but not including, the settlement date. Accrued Interest is defined as Interest earned but not received, realized. For example, bonds usually pay interest every six months, therefore interest accrues between one interest payment and the next. The buyer of a bond pays its market value plus the interest earned up to the settlement date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Accrued General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds accrued interest amount. Accrual of interest is required to report as on date due should the customer choose to close the account prematurely. The accrued interest is liquidated on the installment payment date until to the account. If the installment is received the interest is accounted as received, if delinquent the interest is capitalized to the principal  with the increase in principal the interest will start to accrue on the increased principal. If the account is in default, prolonged delinquent, the interest accrual is suspended on the account. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Margin Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of Margin. Margin can be provided as Rate or Percentage. If provided as Rate then current net rate is Applicable rate from the IRC plus margin. If Percentage, Margin is calculated using IRC and Margin provided as percent. If it is Rate and input is 2 percent, then 2 needs to be provided in spread or margin column. If it is Percent and input is 5 percent of IRC, then 5 needs to be provided in spread or margin column. This column has been added to support Tiered Balance Interest Rates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Internal Customer Branch Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the code for the internal branch which is an customer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "International Banking Facility Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account or transaction is belongs to an international banking facility. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Issue Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Date on which the account was originated or issued by the originating institution. For accounts originated by the current institution, ISSUE DATE is equal to ORIGINATION DATE. For accounts acquired through acquisition of another institution, or purchase of a pool of accounts, ISSUE DATE less than ORIGINATION DATE. If ORIGINATION DATE from the original institution is not available, ISSUE DATE is equal to ORIGINATION DATE. ISSUE DATE less than or equal to ORIGINATION DATE, ISSUE DATE cannot be greater than ORIGINATION DATE.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Issuer Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the issuer code for the financial instruments. Issuer is defined as a legal entity that develops, registers and sells securities or financial instruments. Issuers may be domestic or foreign governments, corporations or investment trusts. Issuers are legally responsible for the obligations of the issue and for reporting financial conditions, material developments and any other operational activities as required by the regulations of their jurisdictions. The most common types of financial instruments issued are common and preferred stocks, bonds, notes, debentures, negotiable instruments, bills and derivatives.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Lead Bank Party Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the identifier of the lead bank of the borrower.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Legal Entity Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the entity code of the legal entity to which the account will be attributed in the general ledger.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Lending Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of lending for the contract. The possible values for lending types are Sole, Consortium and Both.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Line Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code of the credit line associated with this account. Credit Line dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Line Of Business Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to line of business, LOB, is a functional unit that offers the products to the customer by the financial entity. Example: Corporate Finance, Trade Services, Private Wealth Management, Treasury Services, Retail Banking, Cards services etc. Refers to the unique code of the line of business applicable to the respective product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Location Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique location code. Location code is defined as the code which will represent the address of the property from zip code onwards like which city, country etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Long Run Weighted Average Loss Given Default",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the long run weighted average loss given default. This is the estimate of the average economic loss rate that is expected to be incurred in the event of default, measured over the long run. If the purchasing bank can estimate either the default weighted average loss rates of pool given default or average PD in a reliable manner, the bank may estimate the other parameter based on an estimate of the expected long run loss rate. The bank may, i, use an appropriate PD estimate to infer the long run default weighted average loss rate given default, or, ii, use a long run default weighted average loss rate given default to infer the appropriate PD.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Long Settlement Transaction Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether it is a Long transaction or not. Needed for Long Settlement Transactions or Failed Trades. Non Sec STD Long settlement transactions. This is determined as per the Basel accord annex 4 para 2B, Long Settlement Transactions are transactions where a counterparty undertakes to deliver a security, a commodity, or a foreign exchange amount against cash, other financial instruments, or commodities, or vice versa, at a settlement or delivery date that is contractually specified as more than the lower of the market standard for this particular instrument and five business days after the date on which the bank enters into the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loss Given Default Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the loss given default value of the account. Loss given default is the expected amount to be lost by the financial institution if the borrower defaults. Institutions such as banks will determine their credit losses through an analysis of the actual loan defaults. While quantifying some losses may be simple, in some situations it may be quite difficult and require the analysis of multiple variables. For example, if Bank X loans USD 1 million to ABC Company and ABC defaults on the note, Bank Xs loss is not necessarily USD 1 million. This is because Bank X may hold substantial assets as collateral, and or may use the courts in an effort to be made whole. When all of these variables are factored in, Bank X may have lost substantially less than the original USD 1 million loan. The process of analyzing all of these variables, as well as all of the other loans in Bank Xs portfolio, is paramount to determining the loss given default. This value is calculated by the system.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loss Given Default Refresh Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which loss given default for the contract was refreshed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loss Share Agreement Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique reference to the loss sharing agreement that particular OREO, Other Real Estate Owned, asset is subjected to.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margin Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the margin is the contractual spread that is added to the pricing index and results in the financial institutions retention, net, rate, for adjustable rate accounts. It is used as current net rate = Applicable rate from the Interest Rate Curve Plus margin. The gross rate, CUR_GROSS_RATE, is equal to the index to which the record is tied to plus a spread, which is defined by the MARGIN_GROSS field.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the market value of the instrument as on the As of Date. Market value of the asset is the price that would be received to sell an asset in an transaction between market participants on the given day. It is often the quoted market price which is available as part of market data and used to determine the market value of the asset.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Materiality Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is material or not. Material exposure is an exposure that is substantial in terms of size or risk.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maturity Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the contractual date on which the principal balance is expected to fully amortize and the balance payable would be nil. This is applicable for term loan products but not for revolving credit or overdraft type of account. In case of insurance policy, for some whole life insurance products the maturity date is aligned to maximum attained age and the policy is payable upon the earlier of the maturity date or the death of the insured. In case of Term Life insurance policies the maturity date is determined as policy issue date plus Term of the contract. In case of an annuity it is the date from which the annuitant has chosen to take the payouts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maturity Of The Associated Facility",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Maturity of the associated facility. In case of irrevocable commitments to provide off balance sheet facilities, irrevocable commitments are called original facility and off balance sheet item are called as an associated facility.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maximum Potential Loss",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Maximum Potential loss is defined as the value of the largest loss that could result from a disaster, assuming the normal functioning of passive protective features, i.e. firewalls, nonflammable materials, etc., and proper functioning of most, perhaps not all, active suppression systems, i.e. sprinklers. This loss estimate is always less than, or in rare cases, equal to, the Maximum Foreseeable Loss, which assumes the failure of all active protective features. Underwriting decisions can be influenced by PML evaluations, and the amount of reinsurance ceded on a risk can be predicated on the PML valuation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maximum Supervisory Ratio",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum supervisory loan to value ratio for the loan specified by regulators. This is usually applicable in case of secured loans. FDIC suggests a maximum loan to value ratio of 65 percent in case of Raw land loans, 80 percent in case of commercial and non residential loans, 85 percent in case of 1 to 4 family loans.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Minimum Holding Period",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the Minimum Holding period in days for an exposure which is used to calculate the volatility haircut.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mitigant Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the ISO code of the currency in which the collateral or mitigant is denominated. In case of physical assets, this will store the home currency. In case of financial assets such as stocks, bonds etc., this stores the currency in which the asset is denominated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mitigant Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the value of mitigant or collateral linked to account or contract. Value of an instrument is easy to determine if the instrument trades on a well recognized exchange. In case the collateral does not trade on an exchange, appropriate valuation or appraisal methods may be employed to arrive at an estimated market value. It is used as an indication of the amount that could be fetched if the collateral is sold in open market as on As of Date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mortgage Lending Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the mortgage lending value of property associated with this loan, in case of mortgage loans. This is applicable for exposure secured by CRE, Commercial Real Estate. Normally a risk weight of 100 percent is applied. However, in exceptional circumstances for well developed and long established markets, mortgages on office and or multi purpose commercial premises and or multi tenanted commercial premises may have the potential to receive a preferential risk weight of 50 percent for the tranche of the loan that does not exceed the lower of 50 percent of the market value or 60 percent of the mortgage lending value of the property securing the loan. Any exposure beyond these limits will receive a 100 percent risk weight. This exceptional treatment will be subject to very strict conditions. In particular, two tests must be fulfilled, namely that, i, losses stemming from commercial real estate lending up to the lower of 50 percent of the market value or 60 percent of loan to value, LTV, based on mortgage lending value, MLV, must not exceed 0.3 percent of the outstanding loans in any given year and that, ii, overall losses stemming from commercial real estate lending must not exceed 0.5 percent of the outstanding loans in any given year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Net Of Margin",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the net of the margin.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Net Present Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the net present value of the account or investment. Net present value is the sum of discounted cash inflows and cash outflows.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Net Unamortized Fee",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to net unamortized fee. Typically fees amortized over the life cycle of the Contract. Refers to the few components that are not amortized and are collected as and when required. Origination fees for a given Contract should be offset against related origination costs and the net amount should be deferred.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Net Unamortized Origination Cost",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Net unamortized origination cost in local currency. Direct origination costs for a given Contract should be offset against related commitment fees and the net amount should be deferred.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Nettability Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether the exposure is nettable against any other nettable exposures of the same customer. This is valid only for OTC derivatives and Repos. If the value is updated as Y means the exposure is nettable against any other nettable exposure and if the value is updated as N means the exposure is not nettable against any other exposure.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Netting Agreement Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the netting agreement code on which the contract is made. A netting agreement is an arrangement between two parties   known as counterparties   that governs the treatment of certain offsetting transactions or contracts. Two transactions offset each other if a gain in one results in a loss in the other. In other words, the transactions hedge each other. This allows for net settlement of all contracts governed by this netting agreement, with a single counterparty, through a single payment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "New Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the account is a new account which means if the value is updated as Y the account is new account as of current extraction date and if the value is updated as N the account is an old account as of current extraction date. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Next Reprice Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which interest rate will be reprice for the instrument. It is applicable for adjustable rate accounts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Non Deposit Taking Systemically Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is a claim on Non deposit taking systemically important non banking finance company, NBFC. They are known as Non Bank Systemically Important Financial Institutions in other countries. In India, NBFCs whose asset size is of Rs.100 crore, INR 1 billion, or more as per last audited balance sheet are considered as systemically important NBFCs. The rationale for such classification is that the activities of such NBFCs will have a bearing on the financial stability in the country.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Offer Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the offer. An offer is defined as an abstract, physical and or monetary benefit attached to a product for a predetermined period of time with a view to increase the sales of a product. Offer dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Office Of Foreign Asset Control Reason Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates the OFAC reason indicator for this account. List of valid values are: O OFAC Freeze, P  Patriot Act Freeze, V  Patriot Verification, F  Systematic CIP Freeze, D  Compliance CIP Override and N  Registered Principle. Office Of Foreign Asset Control, OFAC, is defined by the department of the U.S. Treasury that enforces economic and trade sanctions against countries and groups of individuals involved in terrorism, narcotics and other disreputable activities.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "One Way Cash Payment Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether Transaction one way cash payments on OTC derivative contracts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Operation Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the operations performed on a letter of credit contract. Expected values are Advise, Confirm etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Operational Relationship Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the balance amount of the account can be added to the high quality liquid assets. High Quality Liquid Assets are used in the calculation of liquidity coverage ratio.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Organization Unit Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the cost center to which the account belongs to. Organization Unit dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the original account number held by the source system. If there are multiple source systems without unique account numbers, we expect the account number and source system to be concatenated as part of the primary key, while this column will store the original account number as generated by the source system.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Original Gross Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the book balance at the time of origination. Original gross book balance is the sum total of End of Period Balance Plus Deferred Balance, represented as a negative amount to depict the unamortized portion. This is used while calculating amortization. The book balance is the term financial institutions use to describe the amount of money available before any adjustments have been made for deposits in transit, checks that have not yet been cleared, reserve requirements and interest received from 'float funds' hence is generally greater than end of period balance, Also called as 'gross balance'.\nIt also excludes any deferred balance that is unamortized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Maturity Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the original maturity date of the reference issue, typically debt securities. It would be used to derive residual maturity and original maturity of the reference issue. Original maturity date is the contractual date on which the principal balance of an earning asset or debt instrument is due and payable to the holder.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Origination Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the Date on which current institution originated or acquired the instrument. For rolled instruments the greater of date last rolled or date acquired.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Other Party Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the counterparty Financial Institution of the importer or exporter. This refers to the other party code, here would indicate the broker for the FX contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Over The Counter Derivative Multiplier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the multiplier in case of over the counter derivative contracts. This is useful for calculating the effective notional principal. Effective notional principal is calculated as stated notional principal amount multiplied by any multiplier in the OTC derivative contract. Financial institutions are required to use effective notional principal amount, rather than its apparent or stated notional principal amount in calculating potential future credit exposure. For example, a swap contract with a stated notional amount of USD 1,000,000 whose terms called for quarterly settlement of the difference between 5 percent and LIBOR multiplied by 10 has an effective notional amount of USD 10,000,000.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Ownership Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the organization defined code for the ownership type of the account. Expected values are IND  Individual, JOINT  Joint Tenant or Community Property, TRUST  Trust, CUST  Custodian, CORP  Corporate, FIRM  Firm Owned and OTHER  Other.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Parent Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the parent account number of the contract or account. For instance, if the asset is an underlying for a repurchase agreement, then the account number of the repo contract is expected in this column. Incase of Borrowings, it can also store the account as parent account which is help by the financial institution in fiduciary capacity. In case of cards, parent account number refers to corporate card master account number. Incase of OD Accounts, it should refer to the parent savings, checking account number or loan account number if the overdraft has arisen due to breach of limits or funds from those respective accounts. It will store loan account number as parent account number even for the cases where the overdraft has arisen in the escrow account for the payment of taxes and or insurance. It should be left NULL, if parent child relationship does not exist.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Participation Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account or credit facility is a part of the syndicate. Syndicated loans are usually large loans made to corporate borrowers. More than one financial institution is involved in a syndicated loan. The main goal of syndicated lending is to spread the risk of a borrower default across multiple lenders, such as banks, or institutional investors like pensions funds and hedge funds. Because syndicated loans tend to be much larger than standard bank loans, the risk of even one borrower defaulting could cripple a single lender. Syndicated loans are also used in the leveraged buyout community to fund large corporate takeovers with primarily debt funding.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Participation Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the percentage of total participation amount to be participated by the entity. This should be populated by reporting entity when they participate in a given contract and do not play role of lead or fronting agent. This should hold the value of less than 100 since other financial institutions are participating in the credit facility as well. This percentage should be the Participation Percent of the reporting entity. NULL value will be considered as 100 percent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Participation Sold Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to percentage contribution of the reporting bank in the total borrowed amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Participation Unutilized Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the unutilized amount by reporting bank under a given participation contract. Actual unutilized amount will be differ based on whether bank is fronting or not. In case of non fronting contracts, it is undrawn amount proportional to bank contribution whereas in case of fronting entire undrawn amount becomes bank unutilized amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Participation Utilized Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the utilized amount by reporting bank under a given participation contract. Actual utilized amount will be differ based on whether bank is fronting or not. In case of non fronting contracts, it is amount proportional to bank contribution whereas in case of fronting entire amount becomes bank utilized amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Partner Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code to identify a partner. Partners assist in origination of accounts. Partner dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Party Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier for the party. Party is defined as an entity or a person who takes part or is involved in an agreement, lawsuit, or transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Past Due Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to Indicate whether the exposure is past due or not. If delinquency days are greater than 90 then its past due. If the value is updated as Y means the exposure is past due and if the value is updated as N means the exposure is not past due. List of Values are Y,N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Power Of Attorney Or Signatory Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether this account has power of attorney or signatory authority granted to a person with a US address. . This is required for FATCA purpose. List of values are Y, N. If the value is updated as Y means this account has power of attorney granted to a person with a US address and if the value is updated as N means the power of attorney is not granted to a person with US address or this account does not have any power of attorney.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Preferential Treatment Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether there is a preferential treatment on the exposure or not. At national discretion, a lower risk weight may be applied to exposures of the bank to their sovereign, or central bank, of incorporation denominated in domestic currency and funded19 in that currency.20 Where this discretion is exercised, other national supervisory authorities may also permit their banks to apply the same risk weight to domestic currency exposures to this sovereign, or central bank, funded in that currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Previous Reinstatements",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the previous reinstatement amounts. In the context of LC, Reinstatement refers to the process where a letter of credit contract is brought back into existence from expiry or cancellation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Probability Of Default Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the probability of default of an exposure over a period of one year, as required for regulatory capital calculation. This will be used in RWA calculation based on advanced approach. This is expressed in decimal number, For example, 30 percent will be 0.3.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Probability Of Default Refresh Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which said probability of default for the contract was refreshed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Product Bundle Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of product bundle code. Bundling is a marketing strategy that joins products or services together in order to sell them as a single combined unit. Bundling allows the convenient purchase of several products and or services from the same financial institution. The products and services are usually related, but they can also consist of dissimilar products which appeal to one group of customers. For example Credit card product is bundled with savings account product or loan product is bundled with a CASA account. There are certain interest cost advantages that are available as part of product bundle, should the customer close a product which is part of the bundle, the financial institution could review the advantage provided to other accounts as part of the bundle.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Product Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code assigned to each of the Products offered by the Bank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Provision Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the provision amount set against the account. Provisions are set aside by financial institution to cover against expected future loss. Provision amount on the loan increases as the credit quality deteriorates signifying high likelihood of default and thereby mandating more allocation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Provision Amount Month Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the provision amount set against the account from the start of the month till date. Provisions are set aside by financial institution to cover against expected future loss. Provision amount on the loan increases as the credit quality deteriorates signifying high likelihood of default and thereby mandating more allocation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Provision General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds provision amount. All asset exposures need to be provisioned for to set off any future losses arising out of these exposures. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Purchase Contract Cancelled Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the purchase contract has been cancelled. This is required for determining risk weight of the exposure. A 100 percent risk weight is applicable for one to four family residential pre sold construction loans for residences for which the purchase contract is cancelled. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Purchased Or Originated Credit Impaired Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account has been Purchased or Originated as a Credit Impaired account. List of values are Y or N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Qualifying Reference Obligation Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is a qualifying reference obligation or not. This is applicable to credit derivatives on the trading book of the financial institution. Add on factors are used to determine potential future exposure in case credit risk of the trading book. The add on factors are different for qualifying reference obligation and non qualifying reference obligation. Add on is an amount for potential future credit exposure over the remaining life of the contract calculated by applying an add on factor to the notional principal amount of the derivative. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Floor Cap",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the rate ceiling if one is contained in the credit agreement for floating rate credit facilities.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Realized Gain Or Loss Amount For The Period",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the realized gain or loss on exposure. Profit and Losses are classified into realized and unrealized profit o loss. Realized gain refers to the gain realized by selling or buying a security.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Realized General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds realized amount. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Realized Loss Given Default",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the realized loss given default as of extraction date. The realized loss given default is computed by considering outstanding balance at default and offsetting any mitigates offered. List of values are between 0 and 1.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Recalcitrant Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether this account is considered to be a recalcitrant account. A Recalcitrant account is defined as an account that, 1, fails to comply with reasonable requests for information pursuant to IRS mandated verification and due diligence procedures to identify US Accounts,, 2, fails to provide a name, address and taxpayer identification number or, 3, fails to provide a bank secrecy waiver upon request. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Reciprocal Cross Holding Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicates if the exposure has reciprocal cross holding or not. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Referral Line Of Business Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Line of Business that is responsible to acquiring the account. Line of business, LOB, is a functional unit that offers the products of the financial entity to the customer. Example: Corporate Finance, Trade Services, Private Wealth Management, Treasury Services, Retail Banking, Cards services etc. This column Refers to the unique code of the line of business applicable to the respective product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Region Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the geographical grouping of the market based on certain common characteristics like language, ethnicity, country, continent, city and state. The region can vary based on the definition of market. Global market vs local market can have different definition of region.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Regulatory Capital Investment Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is a regulatory investment or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Regulatory Investment Participation Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of Participation Value for Regulatory Investments",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remaining Number Of Payments",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the remaining number of payments due as per agreed payment schedule. The remaining number of principal, interest, or principal and interest payments to be made from the as of date until the maturity date of the record. This is used to compute the payment dates on which payment of principal and interest happen. As each payment is made during the life of the instrument, the cash flow engine reduces the remaining number of payments by 1 and rolls the payment period forward by the payment frequency. If the newly calculated remaining number of payments = 1, the cash flow engine no longer rolls the payment frequency and makes the next, and final, payment on the maturity date. If Remaining number of payments = 0, record is invalid. Also If Remaining number of payments = 1, Next payment date = Maturity date. For non term accounts, Remaining number of payments = 1.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remaining Tenor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the remaining tenor of the account. Tenor is the term to maturity. The remaining tenor is computed as Maturity Date  As Of Date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remaining Tenor Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Remaining term unit is used in conjunction with remaining term to determine the remaining term of an account as on processing date. List of values are D Day, M Month and Y Year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remargin Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the reimagining frequency of an exposure in days. This is used in calculating the volatility haircut. Reimagining frequency is the frequency at which the exposure is marked to market. For some transactions, depending on the nature and frequency of the revaluation and reimagining provisions, different holding periods are appropriate. The framework for collateral haircuts distinguishes between repo style transactions, i.e. repo or reverse repos and securities lending or borrowing, other capital market driven transactions, i.e. OTC derivatives transactions and margin lending, and secured lending. In capital market driven transactions and repo style transactions, the documentation contains reimagining clauses, in secured lending transactions, it generally does not. When the frequency of reimagining or revaluation is longer than the minimum, the minimum haircut numbers will be scaled up depending on the actual number of business days between reimagining or revaluation. Currently this attribute is only consumed by Basel application.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repayer Industry Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the Industry code of the Repayer of the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repayment Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the type of repayment associated with the account. Indicated values are Conventional Fixed, Balloon, Adjustable Negative Amortizing, Rule of 78s, Level Principal, Conventional Adjustable etc. Conventional Amortization  This AMRT_TYPE_CD conventionally amortizes a record whose cash flows are defined in the PAYMENT_SCHEDULE table. Payment amounts should contain both principal + interest. Level Principal Payment Schedule  This AMRT_TYPE_CD level principal amortizes a record whose cash flows are defined in the PAYMENT_SCHEDULE table. Payment amounts should contain principal only. Negative amortization is applicable when the payment amount is not sufficient to cover the interest component of the loan for the period. Rule of 78 loans have a pre computed schedule.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repo Instrument Issuer Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code or identified of the issuer of the instrument. Issuer dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repo Instrument Residual Maturity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Repo Instrument Residual Maturity",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Retention Offer Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of retention offer type. Retention offer type is referred to as a service or payment or reward outside of a regular services provided to the customer that is offered as an incentive to retain a key customer or account. Retention Offer Type Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Revaluation Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the frequency at which the reference exposure is revalued to reflect its fair value in days. This is used in calculating the volatility haircut.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Revocability Notice Period",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of days provided as notice to party, obligor, to reduce availability of Credit Line in the case of Revocable credit facility.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Revocable Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Revocable Status. The expected values are irrevocable, conditionally revocable etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Revolving Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account is a term or revolving account. Revolving credit is a type of loan or credit that does not have a fixed number of payments. The revolving limit is similar to a credit limit against which a customer can draw funds for financing. Revolving amount is applicable to products like credit cards, revolving loans or line of credit etc. Term products are those products that have pre scheduled payments or maturity. Examples of term products are term loans, term deposits or Certificate of deposit etc. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Risk Weight By Discretion Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the risk weight for the exposure is given by the financial institution itself. This required for Standardized approach. Subject to national discretion, claims on domestic PSEs may also be treated as claims on the sovereigns in whose jurisdictions the PSEs are established. Where this discretion is exercised, other national supervisors may allow their banks to risk weight claims on such PSEs in the same manner. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sales Commission Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the commission amount paid typically to DSAs for sale of a banking product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sales Representative Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the sales representative associated with the account. A product offering of a bank is usually sold via multiple channels. Sales representatives are usually employed to sell certain types of products like insurance policies, mutual funds etc. DIM_SALES_REPRESENTATIVE is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sanctioned Limit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the credit limit that was sanctioned for this account which was originally allocated to the customer at the time of joining. The maximum amount for which a particular borrower is approved is known as the credit limit. If the limit is not revised the original limit and credit limit are the same.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Secured Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account or contract number is secured with a collateral or not. The collaterals to be considered here will be the collaterals other than margins. In case of deposits, this indicates it is Collateralized or Secured Deposit. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securities Guarantor Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to unique code of the guarantor for the securities. List of values are Central Government  CGG, State Government  SGG and Others  OTH.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securitization Pool Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Unique identifier of the organization defined codes for a securitization pool. Securitize refers to a pooled group of financial assets that together create a new security, which is then marketed and sold to investors. The value and cash flows of the new security are based off of the underlying value and cash flows of the assets used in the securitization process. Companies will securitize illiquid assets into liquid assets in order to increase their overall liquidity and generate immediate proceeds from their assets.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securitized Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the exposure is securitized or not. Securitize refers to a pooled group of financial assets that together create a new security, which is then marketed and sold to investors. The value and cash flows of the new security are based off of the underlying value and cash flows of the assets used in the securitization process. Companies will securitize illiquid assets into liquid assets in order to increase their overall liquidity and generate immediate proceeds from their assets. List of values are Y, N. If the value is updated as Y means the exposure is securitized and if the value is updated as N means the exposure is not securitized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Seniority Claim Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is a senior claim. In case of Purchase Receivables, if the purchasing bank is unable to decompose EL into its PD and LGD components in a reliable manner, the risk weight is determined from the corporate risk weight function using the following specifications, if the bank can demonstrate that the exposures are exclusively senior claims to corporate borrowers, an LGD of 45Percent can be used, otherwise an LGD of 100Percent is used. List of values are Y and N, A value Y indicates that the exposure is a senior claim, and N indicates that the exposure is not a senior claim.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Seniority Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the exposure seniority in the event of bankruptcy of the counterparty. Seniority refers to the order of repayment in the event of a sale or bankruptcy of the issuer. \nSeniority can refer to either debt or preferred stock. Senior debt must be repaid before subordinated, or junior, debt is repaid. Each security, either debt or equity, that a company issues has a specific seniority or ranking. Bonds that have the same seniority in capital structure of a company are described as being pair passu. Preferred stock is senior to common stock in a sale when preferred shareholders must receive back their preference, typically their original investment amount, before the common shareholders receive anything.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Service Representative Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the service representative who is responsible for servicing the account. Service representatives are employees or contractors designated by the bank to service accounts. They are also commonly called as customer service representatives.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Notice Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the settlement notice days. This is the number of days required by the financial institution to settle the guarantee invoked by the beneficiary.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sight Usance Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Indicates if the contract is a sight letter of credit or a usance letter of credit. Under a sight letter of credit, payment is made to the seller immediately after the required documents have been submitted to the authorized bank, provided the conditions in the letter of credit have been met. Banks are, however, allowed a reasonable period of time for checking purposes, not more than five working days after they receive the documents. In the case of a usance letter of credit, the payment to the seller is not made when the documents are submitted, but instead at a later time defined in the letter of credit. Usance letter of credit is also referred to as deferred payment letter of credit. List of Values are S and U.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Solvency Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates Whether General Market Risk is required, Y indicates only general market risk, N indicates only specific market risk and NULL indicates both general market risk and specific market risk. he list of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Squared Off Position Trading Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the transaction has the respective opposite position in trading book. When a dealer is in a square position, the positions are perfectly hedged. If the dealer is not in a square position, then he or she is taking either a long or a short position. A square position is in the middle, neither net long nor net short. If the value is updated as Y means the transaction has the respective opposite position in trading book and if the value is updated as N means there is no opposite position available in trading book. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Standard Business Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the standard business days for settlement. This is useful to determine if the transaction is a long settlement transaction or not. Long Settlement Transactions are transactions where a counterparty undertakes to deliver a security, a commodity, or a foreign exchange amount against cash, other financial instruments, or commodities, or vice versa, at a settlement or delivery date that is contractually specified as more than the lower of the market standard for this particular instrument and five business days after the date on which the bank enters into the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Standing Instructions To Us Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether there are standing instructions to transfer funds from this account to an account maintained in the United States. This is required for FATCA purpose. If the value is updated as Y means there are standing instructions to transfer funds to US account and if the value is updated as N means there are no instructions to transfer funds from the account to US account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Start Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the contract becomes effective.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Superannuation Or Maximum Benefit Limits Covered Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the loans and advances granted by State or Central cooperative banks to their own staff, which are fully covered by superannuation benefits and mortgage of flat or house. This is applicable for India jurisdiction Risk weight calculation. A risk weight of 20 percent is applicable for such exposures. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Supervisory Beta Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the supervisory scaling parameter, beta. It is set to a value of 1.4. To be consistent with the Revised Framework for credit risk, the EAD for instruments with Counterparty Credit Risk must be determined conservatively and conditionally on a bad state of the economy. To accomplish such conditioning in a practical, pragmatic, and conservative manner, the Internal Model Method and Standardized Method scale Expected Positive Exposure using multipliers, termed alpha and beta, respectively. Both alpha and beta are set at 1.4, but supervisors have the flexibility to raise either parameter in appropriate situations.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Swing Line Contract Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if said contacts is a swing line contract. A swing line facility is a sub limit of a syndicated revolving credit loan whereby a lender makes a short term, operating not more than five days, loan, in smaller amounts, on shorter notice and with a higher interest rate than is otherwise available for revolving credit loans. The purpose is to support the borrowers cash management needs. List of Values are Y and N. Y as Swing Line Contract and N or Null as Not a Swing Line Contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Tenor Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the contractual term in days as on the origination date of the contract. The maturity date is calculated by adding origination term or tenor to the origination date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Term Out Option Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Refers to the indicator to identify the transfer of debt within a balance sheet of company without acquiring new debt. This is done through the capitalization of short term to long term debt. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Commitment Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total commitment amount of an account. In case of lease commitments, this amount reflects the minimum lease payments in relation to the non cancellable operating leases. This is committed amount that is irrevocable and the Financial institution is bound to lend this to the customer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Fees And Charges",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total fees and charges collected or levied by the bank. This includes penal charges, fees, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Participated Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to total committed amount in case of consortium banking arrangement by all the participated institutions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Revenue",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total revenue from the account. This includes all types of charges, fees, interest income, non interest income include deposit and transaction fees, insufficient funds, NSF, fees, annual fees, monthly account service charges, inactivity fees, check and deposit slip fees, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Trade Related Obligations Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if trade related obligations are associated with the account. Trade finance instruments consist of trade related obligations directly underpinned by the movement of goods or the provision of services, such as:, 1, documentary trade letters of credit, documentary and clean collection, import bills, and export bills, and, 2, guarantees directly related to trade finance obligations, such as shipping guarantees. List of value are Y, N. Y  if instrument is having trade related obligations and N  if such trade obligations are not associated with the instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Treatment Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identification code for a treatment. Treatment is defined which is channel specific instance of an offer. Treatment Refers to the message associated with the offer. Treatment dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unconditionally Cancellable Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates if the exposure or claim is unconditionally cancellable or conditionally cancellable, e.g. cancellable upon certain events, or not cancellable. In certain countries, retail commitments are considered unconditionally cancellable if the terms permit the bank to cancel them to the full extent allowable under consumer protection and related legislation. List of values are Y  Unconditionally Cancellable, C  Conditionally Cancellable and N or NULL  Not Cancellable.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the currency code corresponding to the underlying.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underlying Type Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the underlying type of the derivatives, which are reference asset for the funds. The underlying type indicates whether the derivative is bought on equity, debt etc. This information will be obtained from the mandate or the prospectus of the account or instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Undrawn Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the undrawn amount till date. In case of borrowings, it is computed as Sanctioned Limit  Drawn Amount. In case of cards, it is computed as Sanctioned Limit  EOP Balance. In case of facility it is derived by subtracting the committed amount if any from the facility amount and also by reducing the total amount exposures from the facility amount. In case of commitment contract it is the difference between the committed amount and the drawn or utilized amount in the loan exposures.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Undrawn General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code specific to the undrawn amount of the account. The undrawn amount is the sanctioned amount less the drawn portion of the account. General Ledger Account Dimension is the equivalent dimension table for this.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unpaid Premium Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the unpaid premium amount. This is applicable in case of credit default swaps where a premium is paid by the protection buyer to the protection seller. This is helpful in calculation of Potential Future Exposure, PFE, of the protection seller. PFE of the protection provider of a credit derivative is capped at the net present value of the amount of unpaid premiums.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unpaid Premium Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the derivative contract has an unpaid premium or not. This is applicable in case of credit default swaps where a premium is paid by the protection buyer to the protection seller. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unrealized Gain Or Loss",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the unrealized gain or loss on exposure. Profit and Losses are classified into realized and unrealized profit or loss. Realized gain refers to the gain realized by selling or buying a security. Unrealized gain or loss refers to notional gain or loss which is not yet realized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Us Indicia Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Flag indicates if the account has US Indicia. US Indicia indicates presence of any of the following: US Citizenship or lawful or permanent resident, US birth place, US address, Instructions to transfer funds to US Accounts or directions regularly received from a US address etc. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Value Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the value date of the contract. Value Date is a securities industry term describing the date on which a trade, bonds, equities, foreign exchange, commodities, etc., settles. That is, the actual day on which transfer of cash or assets is completed, or the settlement amount is calculated. \nIn case of FX swap instrument Refers to the settlement date for spot or near leg. Also considered as the date on which the contract becomes effective.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Write Off General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds write off amount. The write off impacts the Profit and Loss account of the enterprise. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [
                {
                    "dqId": "DQLOV31758",
                    "btLogicalName": "Account Or Contract Closed Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31759",
                    "btLogicalName": "Backed By Bullion Liability Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31760",
                    "btLogicalName": "Claim Foreign Currency And Bank Funding Currency Same Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31761",
                    "btLogicalName": "Double Default Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31762",
                    "btLogicalName": "Eligible Protection Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31763",
                    "btLogicalName": "Failed Trade Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31764",
                    "btLogicalName": "International Banking Facility Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31765",
                    "btLogicalName": "Nettability Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31766",
                    "btLogicalName": "Non Deposit Taking Systemically Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31767",
                    "btLogicalName": "One Way Cash Payment Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31768",
                    "btLogicalName": "Past Due Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31769",
                    "btLogicalName": "Purchased Or Originated Credit Impaired Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31770",
                    "btLogicalName": "Securitized Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31771",
                    "btLogicalName": "Unconditionally Cancellable Indicator",
                    "dqDesc": "Should have list of values as C,N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31772",
                    "btLogicalName": "Us Indicia Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31773",
                    "btLogicalName": "New Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31774",
                    "btLogicalName": "Purchase Contract Cancelled Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31775",
                    "btLogicalName": "Risk Weight By Discretion Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31776",
                    "btLogicalName": "Squared Off Position Trading Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31777",
                    "btLogicalName": "Term Out Option Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31778",
                    "btLogicalName": "Trade Related Obligations Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31779",
                    "btLogicalName": "Unpaid Premium Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31780",
                    "btLogicalName": "Buy Or Sell Indicator",
                    "dqDesc": "Should have list of values as B,S",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31781",
                    "btLogicalName": "Capital Market Exposure Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31782",
                    "btLogicalName": "Claim And Funding Liability Similar Currency Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31783",
                    "btLogicalName": "Exposure Funding Currency Same Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31784",
                    "btLogicalName": "Office Of Foreign Asset Control Reason Indicator",
                    "dqDesc": "Should have list of values as D,F,N,O,P,V",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31785",
                    "btLogicalName": "Secured Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31786",
                    "btLogicalName": "Standing Instructions To Us Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31787",
                    "btLogicalName": "Account Defaulted Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31788",
                    "btLogicalName": "Banking Book Exposure Or CCR Hedge Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31789",
                    "btLogicalName": "Central Counterparty Rejection Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31790",
                    "btLogicalName": "Contract Walk Away Clause Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31791",
                    "btLogicalName": "Materiality Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31792",
                    "btLogicalName": "Participation Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31793",
                    "btLogicalName": "Preferential Treatment Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31794",
                    "btLogicalName": "Revolving Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31795",
                    "btLogicalName": "Seniority Claim Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31796",
                    "btLogicalName": "Fiduciary Relationship Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31797",
                    "btLogicalName": "External Customer Branch International Banking Facility Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31798",
                    "btLogicalName": "Global Relationship Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31799",
                    "btLogicalName": "Operational Relationship Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31800",
                    "btLogicalName": "Superannuation Or Maximum Benefit Limits Covered Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31801",
                    "btLogicalName": "Automatic Cancellation Of Commitment Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31802",
                    "btLogicalName": "Delivery Versus Payment Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31803",
                    "btLogicalName": "Exposure One To Four Family Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31804",
                    "btLogicalName": "Instrument Short Term Qualification Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31805",
                    "btLogicalName": "Long Settlement Transaction Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31806",
                    "btLogicalName": "Power Of Attorney Or Signatory Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31807",
                    "btLogicalName": "Reciprocal Cross Holding Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31808",
                    "btLogicalName": "Remaining Tenor Unit",
                    "dqDesc": "Should have list of values as D,M,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31809",
                    "btLogicalName": "Solvency Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31810",
                    "btLogicalName": "Account Under Enforcement Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31811",
                    "btLogicalName": "Available For Sale Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31812",
                    "btLogicalName": "Borrower Capital Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31813",
                    "btLogicalName": "Borrower Cash Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31814",
                    "btLogicalName": "Embedded Option Type Indicator",
                    "dqDesc": "Should have list of values as N,S",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31815",
                    "btLogicalName": "Exposure Ongoing Finance Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31816",
                    "btLogicalName": "Guaranteed By Sovereign Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31817",
                    "btLogicalName": "Recalcitrant Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31818",
                    "btLogicalName": "Asset Financing Company Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31819",
                    "btLogicalName": "Exempted Capital Market Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31820",
                    "btLogicalName": "Explicit Adjustment For Effective Maturity Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31821",
                    "btLogicalName": "Exposure Held At Fair Value Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31822",
                    "btLogicalName": "Foreclosure Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31823",
                    "btLogicalName": "Qualifying Reference Obligation Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31824",
                    "btLogicalName": "Regulatory Capital Investment Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQLOV31825",
                    "btLogicalName": "Swing Line Contract Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35822",
                    "btLogicalName": "Adjustment Effective Date",
                    "dqDesc": "Reference Check for Adjustment Effective Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35823",
                    "btLogicalName": "Adjustment Effective Date",
                    "dqDesc": "Reference Check for Adjustment Effective Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35824",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35825",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35826",
                    "btLogicalName": "Closed Date",
                    "dqDesc": "Reference Check for Closed Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35827",
                    "btLogicalName": "Closed Date",
                    "dqDesc": "Reference Check for Closed Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35828",
                    "btLogicalName": "Effective Maturity Date",
                    "dqDesc": "Reference Check for Effective Maturity Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35829",
                    "btLogicalName": "Effective Maturity Date",
                    "dqDesc": "Reference Check for Effective Maturity Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35830",
                    "btLogicalName": "Expiry Date",
                    "dqDesc": "Reference Check for Expiry Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35831",
                    "btLogicalName": "Expiry Date",
                    "dqDesc": "Reference Check for Expiry Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35832",
                    "btLogicalName": "Fatca Reporting Period End Date",
                    "dqDesc": "Reference Check for Fatca Reporting Period End Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35833",
                    "btLogicalName": "Fatca Reporting Period End Date",
                    "dqDesc": "Reference Check for Fatca Reporting Period End Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35834",
                    "btLogicalName": "Issue Date",
                    "dqDesc": "Reference Check for Issue Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35835",
                    "btLogicalName": "Issue Date",
                    "dqDesc": "Reference Check for Issue Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35836",
                    "btLogicalName": "Maturity Date",
                    "dqDesc": "Reference Check for Maturity Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35837",
                    "btLogicalName": "Maturity Date",
                    "dqDesc": "Reference Check for Maturity Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35838",
                    "btLogicalName": "Original Maturity Date",
                    "dqDesc": "Reference Check for Original Maturity Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35839",
                    "btLogicalName": "Original Maturity Date",
                    "dqDesc": "Reference Check for Original Maturity Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35840",
                    "btLogicalName": "Origination Date",
                    "dqDesc": "Reference Check for Origination Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35841",
                    "btLogicalName": "Origination Date",
                    "dqDesc": "Reference Check for Origination Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35842",
                    "btLogicalName": "Next Reprice Date",
                    "dqDesc": "Reference Check for Next Reprice Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35843",
                    "btLogicalName": "Next Reprice Date",
                    "dqDesc": "Reference Check for Next Reprice Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35844",
                    "btLogicalName": "Start Date",
                    "dqDesc": "Reference Check for Start Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35845",
                    "btLogicalName": "Start Date",
                    "dqDesc": "Reference Check for Start Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35846",
                    "btLogicalName": "Value Date",
                    "dqDesc": "Reference Check for Value Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35847",
                    "btLogicalName": "Value Date",
                    "dqDesc": "Reference Check for Value Date in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35848",
                    "btLogicalName": "Account Classification Code",
                    "dqDesc": "Reference Check for Account Classification Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35849",
                    "btLogicalName": "Account Manager Code",
                    "dqDesc": "Reference Check for Account Manager Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35850",
                    "btLogicalName": "Account Purpose Code",
                    "dqDesc": "Reference Check for Account Purpose Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35851",
                    "btLogicalName": "Account Type",
                    "dqDesc": "Reference Check for Account Type in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35852",
                    "btLogicalName": "Interest Accrued General Ledger Code",
                    "dqDesc": "Reference Check for Interest Accrued General Ledger Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35853",
                    "btLogicalName": "Accrual Status Code",
                    "dqDesc": "Reference Check for Accrual Status Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35854",
                    "btLogicalName": "Account Status Code",
                    "dqDesc": "Reference Check for Account Status Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35855",
                    "btLogicalName": "Accounting Standard Code",
                    "dqDesc": "Reference Check for Accounting Standard Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35856",
                    "btLogicalName": "Adjustment Type",
                    "dqDesc": "Reference Check for Adjustment Type in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35857",
                    "btLogicalName": "Amortization Method For Premium Discount And Fees Code",
                    "dqDesc": "Reference Check for Amortization Method For Premium Discount And Fees Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35858",
                    "btLogicalName": "Acquisition Channel Code",
                    "dqDesc": "Reference Check for Acquisition Channel Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35859",
                    "btLogicalName": "Attrition Reason Code",
                    "dqDesc": "Reference Check for Attrition Reason Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35860",
                    "btLogicalName": "Behavior Type",
                    "dqDesc": "Reference Check for Behavior Type in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35861",
                    "btLogicalName": "Book Type",
                    "dqDesc": "Reference Check for Book Type in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35862",
                    "btLogicalName": "Branch Code",
                    "dqDesc": "Reference Check for Branch Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35863",
                    "btLogicalName": "Business Domain",
                    "dqDesc": "Reference Check for Business Domain in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35864",
                    "btLogicalName": "Business Unit Code",
                    "dqDesc": "Reference Check for Business Unit Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35865",
                    "btLogicalName": "Campaign Identifier",
                    "dqDesc": "Reference Check for Campaign Identifier in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35866",
                    "btLogicalName": "ISO Currency Code",
                    "dqDesc": "Reference Check for ISO Currency Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35867",
                    "btLogicalName": "Mitigant Currency Code",
                    "dqDesc": "Reference Check for Mitigant Currency Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35868",
                    "btLogicalName": "Commission General Ledger Code",
                    "dqDesc": "Reference Check for Commission General Ledger Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35869",
                    "btLogicalName": "Commitment Contract Code",
                    "dqDesc": "Reference Check for Commitment Contract Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35870",
                    "btLogicalName": "Common Chart Of Account Code",
                    "dqDesc": "Reference Check for Common Chart Of Account Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35871",
                    "btLogicalName": "Account Or Contract Number",
                    "dqDesc": "Reference Check for Account Or Contract Number in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35872",
                    "btLogicalName": "Country Code",
                    "dqDesc": "Reference Check for Country Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35873",
                    "btLogicalName": "Country Code Of Risk",
                    "dqDesc": "Reference Check for Country Code Of Risk in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35874",
                    "btLogicalName": "Credit Participation Tranche Identifier Code",
                    "dqDesc": "Reference Check for Credit Participation Tranche Identifier Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35875",
                    "btLogicalName": "Credit Quality Type",
                    "dqDesc": "Reference Check for Credit Quality Type in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35876",
                    "btLogicalName": "Credit Status Code",
                    "dqDesc": "Reference Check for Credit Status Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35877",
                    "btLogicalName": "Data Source Code",
                    "dqDesc": "Reference Check for Data Source Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35878",
                    "btLogicalName": "Day Count Indicator",
                    "dqDesc": "Reference Check for Day Count Indicator in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35879",
                    "btLogicalName": "Delinquency Status Code",
                    "dqDesc": "Reference Check for Delinquency Status Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35880",
                    "btLogicalName": "Exposure Reporting Currency Code",
                    "dqDesc": "Reference Check for Exposure Reporting Currency Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35881",
                    "btLogicalName": "Fee General Ledger Code",
                    "dqDesc": "Reference Check for Fee General Ledger Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35882",
                    "btLogicalName": "General Ledger Account Code",
                    "dqDesc": "Reference Check for General Ledger Account Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35883",
                    "btLogicalName": "Hedge Status Code",
                    "dqDesc": "Reference Check for Hedge Status Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35884",
                    "btLogicalName": "Holding Type",
                    "dqDesc": "Reference Check for Holding Type in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35885",
                    "btLogicalName": "Holiday Rolling Convention Code",
                    "dqDesc": "Reference Check for Holiday Rolling Convention Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35886",
                    "btLogicalName": "Industry Code",
                    "dqDesc": "Reference Check for Industry Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35887",
                    "btLogicalName": "Instrument Code",
                    "dqDesc": "Reference Check for Instrument Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35888",
                    "btLogicalName": "Instrument Type",
                    "dqDesc": "Reference Check for Instrument Type in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35889",
                    "btLogicalName": "Internal Customer Branch Code",
                    "dqDesc": "Reference Check for Internal Customer Branch Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35890",
                    "btLogicalName": "Issuer Identifier",
                    "dqDesc": "Reference Check for Issuer Identifier in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35891",
                    "btLogicalName": "Issuer Identifier",
                    "dqDesc": "Reference Check for Issuer Identifier in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35892",
                    "btLogicalName": "Legal Entity Code",
                    "dqDesc": "Reference Check for Legal Entity Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35893",
                    "btLogicalName": "Lead Bank Party Identifier",
                    "dqDesc": "Reference Check for Lead Bank Party Identifier in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35894",
                    "btLogicalName": "Line Code",
                    "dqDesc": "Reference Check for Line Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35895",
                    "btLogicalName": "Line Of Business Code",
                    "dqDesc": "Reference Check for Line Of Business Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35896",
                    "btLogicalName": "Location Code",
                    "dqDesc": "Reference Check for Location Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35897",
                    "btLogicalName": "Loss Share Agreement Code",
                    "dqDesc": "Reference Check for Loss Share Agreement Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35898",
                    "btLogicalName": "Netting Agreement Code",
                    "dqDesc": "Reference Check for Netting Agreement Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35899",
                    "btLogicalName": "Offer Code",
                    "dqDesc": "Reference Check for Offer Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35900",
                    "btLogicalName": "Organization Unit Code",
                    "dqDesc": "Reference Check for Organization Unit Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35901",
                    "btLogicalName": "Original Account Number",
                    "dqDesc": "Reference Check for Original Account Number in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35902",
                    "btLogicalName": "Ownership Type",
                    "dqDesc": "Reference Check for Ownership Type in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35903",
                    "btLogicalName": "Parent Account Number",
                    "dqDesc": "Reference Check for Parent Account Number in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35904",
                    "btLogicalName": "Partner Code",
                    "dqDesc": "Reference Check for Partner Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35905",
                    "btLogicalName": "Party Identifier",
                    "dqDesc": "Reference Check for Party Identifier in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35906",
                    "btLogicalName": "Product Code",
                    "dqDesc": "Reference Check for Product Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35907",
                    "btLogicalName": "Provision General Ledger Code",
                    "dqDesc": "Reference Check for Provision General Ledger Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35908",
                    "btLogicalName": "Realized General Ledger Code",
                    "dqDesc": "Reference Check for Realized General Ledger Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35909",
                    "btLogicalName": "Referral Line Of Business Code",
                    "dqDesc": "Reference Check for Referral Line Of Business Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35910",
                    "btLogicalName": "Region Code",
                    "dqDesc": "Reference Check for Region Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35911",
                    "btLogicalName": "Repayer Industry Code",
                    "dqDesc": "Reference Check for Repayer Industry Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35912",
                    "btLogicalName": "Repayment Type",
                    "dqDesc": "Reference Check for Repayment Type in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35913",
                    "btLogicalName": "Retention Offer Type",
                    "dqDesc": "Reference Check for Retention Offer Type in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35914",
                    "btLogicalName": "Revocable Status Code",
                    "dqDesc": "Reference Check for Revocable Status Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35915",
                    "btLogicalName": "Sales Representative Identifier",
                    "dqDesc": "Reference Check for Sales Representative Identifier in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35916",
                    "btLogicalName": "Securitization Pool Identifier",
                    "dqDesc": "Reference Check for Securitization Pool Identifier in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35917",
                    "btLogicalName": "Securities Guarantor Identifier",
                    "dqDesc": "Reference Check for Securities Guarantor Identifier in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35918",
                    "btLogicalName": "Seniority Code",
                    "dqDesc": "Reference Check for Seniority Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35919",
                    "btLogicalName": "Service Representative Identifier",
                    "dqDesc": "Reference Check for Service Representative Identifier in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35920",
                    "btLogicalName": "Treatment Code",
                    "dqDesc": "Reference Check for Treatment Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35921",
                    "btLogicalName": "Underlying Currency Code",
                    "dqDesc": "Reference Check for Underlying Currency Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35922",
                    "btLogicalName": "Underlying Type Code",
                    "dqDesc": "Reference Check for Underlying Type Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35923",
                    "btLogicalName": "Undrawn General Ledger Code",
                    "dqDesc": "Reference Check for Undrawn General Ledger Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                },
                {
                    "dqId": "DQREF35924",
                    "btLogicalName": "Write Off General Ledger Code",
                    "dqDesc": "Reference Check for Write Off General Ledger Code in Stage Letter Of Credit Contracts",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:27.0",
                    "modifiedDate": "2024-11-04 04:39:31.0"
                }
            ],
            "useCases": [
                {
                    "ucId": "ALM",
                    "ucName": "Asset Liability Management"
                },
                {
                    "ucId": "LLFP",
                    "ucName": "Oracle Loan Loss Forecasting and Provisioning"
                },
                {
                    "ucId": "LRM",
                    "ucName": "Liquidity Risk Management"
                },
                {
                    "ucId": "BASEL",
                    "ucName": "Regulatory Capital Adequency"
                },
                {
                    "ucId": "BSP",
                    "ucName": "Balance Sheet Planning"
                },
                {
                    "ucId": "CIRCA",
                    "ucName": "Customer Analytics"
                },
                {
                    "ucId": "FTP",
                    "ucName": "Funds Transfer Pricing"
                },
                {
                    "ucId": "PFT",
                    "ucName": "Profitability Management"
                }
            ]
        }
    ]
}