{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "Account Charges Recovery Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of charge that has been recovered.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Classification Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to classification code of the account. The list of values of account classification can be Fair Value, Amortized Cost, Available for Sale, Held till Maturity etc. Account Classification Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Close Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the account is closed. Account can be an active or closed, this column will remain blank till account is active. Accounts can be closed upon maturity, transfer or death of a customer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Purpose Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the purpose for which account has originated, purpose or special use of this account. Account purpose dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Remaining Tenor Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the remaining term unit is used in conjunction with remaining term to determine the remaining term of an account as on processing date. List of values are D, W, M, Y.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the status of the account. List of values can be Active, Inactive, in foreclosure, Re negotiated, Dispute, Frozen, Past Due, Closed etc. Account Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Total Write Off Inception Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total amount written off on that account from inception till date. Write offs are done by the bank to account for bad debts. When the asset account improve, the bank may write back an amount to the extent of plausible recovery amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accounting Standard Code",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the accounting standard or the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. E.g. GAAP, IFRS etc. Generally Accepted Accounting Principles, GAAP. GAAP are the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. The Generally Accepted Accounting Principles exist to ensure that accountants are using the same or almost the same standards so that comparison of financial statements between or within a company is easy and accurate. They also promote transparency in accounting. However, GAAP provides broad guidelines, there is room for companies to follow an approach within a guideline.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accrual Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the accrual status codes. Accrual Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Agency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the agency code that describes the type of the Issuing Agency . List of values are NON  Non Agency, FNMA_  Fannie Mae, FNMA_GNMA  Fannie Mae or Ginnie Mae, FRED_75  Freddie Mac 75, FRED_GOLD  Freddie Mac Gold, FRED_GNMA  Freddie Mac or Ginnie Mae, GNMA_  Ginnie Mae, NONAGENCY_SUBPRIME  Non Agency Subprime, NONAGENCY_PRIME  Non Agency Prime, NONAGENCY_OTHER  Non Agency Other.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Alternative Home Liquidation Loss Mitigation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the most recent Alternative Home Liquidation Loss Mitigation strategy was executed, when the program was completed. Alternative Home Liquidation Loss Mitigation Strategies include the new and evolving strategies that are designed to minimize loan losses and avert loan foreclosures. These strategies include, but are not limited to, other alternative programs intended to limit the costs and losses related to the sale of the home, deed in lieu, or foreclosure, but which result in the borrower forfeiting ownership of the home. These new strategies are in addition to traditional home liquidation loss mitigation strategies, such as short sales and deeds in lieu of foreclosure. This line item should only be populated for loans with a value of 12 in Line item 77, Workout Type Completed, indicating a workout type of “Other'. Note: This line item should be used only for programs that cannot be coded under any other plan. Loans coded in traditional plans should not be coded here as well.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Alternative Home Retention Loss Mitigation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the most recent Alternative Home Retention Loss Mitigation strategy was executed, when the program was completed. Alternative Home Retention Strategies include the various new and evolving loss mitigation strategies that are designed to minimize loan losses, avert loan foreclosures, and enable borrowers to retain their residence. These strategies include, but are not limited to, short refinances, servicer facilitates a loan refinance, with the investor accepting a short payoff of the existing first mortgage, and other refinance or alternative programs intended to prevent the sale of the home, a deed in lieu, or a foreclosure. Note: This line item should be used only for programs that cannot be coded under any other plan. Loans coded in traditional plans should not be coded here. If alternative loss mitigation does not apply to the loan, leave this line item blank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Term",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the amortization term is used in conjunction with amortization term unit to define the term over which the payment is amortized, depreciated. Amortization term identifies whether a record is a balloon and is used in calculation of payment amounts. It is also used when recalculating payment amounts for User Defined Payment Pattern records that are defined as percentage of Current Payment and have more than one payment frequency defined in the Payment Pattern interface.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to Thea Amortization type code, which is defined as the method by which the principal and interest of an account are amortized. List of values are conventional fixed, Balloon, Adjustable conventional, Adjustable negative amortizing, Simple interest, Rule of 78, Payment schedules, level principal, default value and user defined payment patterns. Amortization Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortizing Locked Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Amount of credit line that has been locked and is now amortizing. For lines of credit, populate this field with the total dollar amount of the outstanding principal balance that has been “locked’ and is now amortizing under independent loan terms. Important: Leave NULL for any home equity loan. Also leave NULL for any line of credit that does not have a lockout feature. If a line of credit has a lockout feature and no balance is locked, the field should contain a zero.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amount Disbursed Month Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total amount disbursed in the given month for the segment as of month end in reporting currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amount Drawn Or Disbursed Month Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount disbursed or drawn in the current month till date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Annual Percentage Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the current annual percentage rate, APR, associated with the account. Annual percentage rate is the annualized interest rate applicable to the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Arm Negative Amortization Limit Percent",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the ARM negative amortization percentage limit. Represents negative amortization limit expressed as a percent of original loan amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Arm Periodic Pay Cap Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to cap on monthly payments for adjustable rate mortgages. Note: The periodic pay cap refers to the maximum percentage point increase over the previous payment. So for a 1,000 principal and interest payment in the previous month, a 7.5 percentage pay cap implies that the principal and interest payment next month cannot exceed 1,075 at the adjustment. Note that the 7.5 percent pay cap should be reported as a fraction, in this case 0.0750.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Arm Periodic Pay Floor Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to floor on monthly payments for adjustable rate mortgages.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Arm Periodic Rate Cap",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the period rate cap applicable for a given account. ARM periodic rate cap Periodic interest rate cap for adjustable rate loans Absolute rate cap, not spread from original.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Arm Periodic Rate Floor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the period rate floor applicable for a given account. ARM Periodic Rate Floor Periodic interest rate floor for adjustable rate loans Absolute rate floor, not spread from original.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "As Of Date",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bankruptcy Chapter Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of the bankruptcy chapter filed by customer of the said account. Bankruptcy Chapter dimension table is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Benchmark Base Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the benchmark base rate for a given combination of Tenor, Currency and Product Type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Benchmark Index Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the primary currency associated with the benchmark of the interest rate. This is applicable in case of adjustable rate instruments. For example, if the interest rate benchmark is LIBOR USD, the currency will be USD and the benchmark code will be LIBOR.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Borrower Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Borrower of the loan sold by bank to other party.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Branch Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the branch code. A branch, banking center or financial center is a retail location where a financial institution offers a wide array of face to face and automated services to its customers. This column Refers to the unique branch code assigned by the financial institution. A branch may specialize to offer certain type of products to customers. Branch needs approval from the regulators.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Capitalization Amount Modified Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether a delinquent amount, PITI or fees, were capitalized and added to the outstanding principal balance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Card Exposure Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the Risk Exposure Type for Corporate Cards is captured. Indicative values are Business Card  Not Scored, Business Card  Scored, Corporate Card  Individual, Corporate Card  Institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Carrying Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the carrying value.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Census Tract Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the Census Tract Code of the property. Census Tracts are small, relatively permanent statistical subdivisions of a county or equivalent entity that are updated by local participants prior to each decennial census as part of the Census Bureaus Participant Statistical Areas Program. The Census Bureau delineates census tracts in situations where no local participant existed or where state, local, or tribal governments declined to participate. The primary purpose of census tracts is to provide a stable set of geographic units for the presentation of statistical data.\nCensus tracts are identified by an up to four digit integer number and may have an optional two digit suffix, for example 1457.02 or 23. The census tract codes consist of six digits with an implied decimal between the fourth and fifth digit corresponding to the basic census tract number but with leading zeroes and trailing zeroes for census tracts without a suffix. The tract number examples above would have codes of 145702 and 002300, respectively.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Charge Off Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the charge off amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Charges Write Off Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the charges write off amount. Indicates the amount Charges that has been written or Charged off.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Country Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the country code associated with the account or instrument or party or location. There are several popular country codes as part of ISO 3166 standard published by the International Organization for Standardization. ISO 3166 defines codes for the names of countries, dependent territories, special areas of geographical interest and their principal subdivisions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Card Lending Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique reference to the credit card type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Class Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the credit class type code assigned to the given account. Credit Class Type Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Enhanced Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to total amount of credit enhancement received that offset the loss. Could come from mortgage insurance proceeds, pool arrangements in deals, or other features of securities structures.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Line Committed Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount committed and communicated to customer as a part of credit facility agreement.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Line Frozen Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Refers to whether the accounts credit line is involuntarily frozen and authorizations are prohibited on the account in the current reporting month.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Rating Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the credit rating associated with the issuer of the contract. Credit Rating Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Score",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the credit score of the customer. In case of retail customers, this can be FICO score. A credit score is commonly used by financial institutions to assess the credit worthiness of a prospect or customer. Generally a customer with a higher credit score gets better terms in terms of interest rates, repayment schedule etc. In case score is reported at account granularity then it will store the credit score of the primary customer associated with the account.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Credit Score Source",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source of the credit score. Credit score is a metric commonly employed to assess the credit strength or credit worthiness of an individual or corporation. Credit score sources can be institutions like Fair Issac, FICO, Experian, TransUnion etc. FICO score is a credit score given to individuals. Experian and TransUnion are credit bureaus that assign credit score based on their proprietary models.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the current performance status of the account. List of values are Delinquent, Foreclosed, Impaired, Closed, Disposed, Transferred, Bankrupt etc. Credit Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Status Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to date on which the current of Credit Status is updated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cumulative Charge Off Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the cumulative write off amount as of date for said credit facility.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cumulative Recovery Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the cumulative, total, recoveries made from the account in natural currency till date. This is the total amount received from the account during recovery process.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Combined Loan To Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the current Combined Loan to value ration for a given account. The current combined loan to value, CLTV, ratio is the current first loan amount and any junior liens at the time of origination divided by the lesser of the selling price or the appraised value of the property securing the mortgage. This field may be provided on a best efforts basis for loans serviced for others and loans acquired through mergers and acquisition.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Debt To Income Back End",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the Debt to Income, DTI, This ratio is the percent of total monthly debt payments of the borrower, including proposed housing expenses, divided by his or her gross monthly income, used to determine the mortgage amount that qualifies a borrower. The total debt to income, or back end, ratio, shows how much of your gross income would go toward all of your debt obligations, including mortgage, car loans, child support and alimony, credit card bills, student loans and condominium fees. In general, your total monthly debt obligation should not exceed 36 percent of your gross income. To calculate your debt to income ratio, multiply your annual salary by 0.36, then divide by 12, months. The answer is your maximum allowable debt to income ratio Example: Furthermore, the lender says the total debt payments each month should not exceed 36 percent, which comes to 1,200 USD., 40,000 times 0.36 equals 14,400, and 14,400 divided by 12 months equals 1,200..",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Debt To Income Front End",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the DTI Ratio, Front end, at origination – Report the Front end DTI, PITI Housing Ratio, at origination of the mortgage Front end DTI ratios give the percentage of the monthly income of borrower, that would go toward housing expenses, mortgage payment, real estate taxes, insurance of the homeowner, association dues, etc., The housing expense, or front end, ratio shows how much of your gross, pretax, monthly income would go toward the mortgage payment. As a general guideline, your monthly mortgage payment, including principal, interest, real estate taxes and homeowners insurance, should not exceed 28 percent of your gross monthly income. To calculate your housing expense ratio, multiply your annual salary by 0.28, then divide by 12, months. The answer is your maximum housing expense ratio. \nExample: Take a homebuyer who makes 40,000 UDS a year. The maximum amount for monthly mortgage related payments at 28 percent of gross income is 933 USD., 40,000 times 0.28 equals 11,200, and 11,200 divided by 12 months equals 933.33..",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Escrow Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the scheduled escrow amount, including taxes and insurance, due from the borrower scheduled for the reporting month. For non escrow loans, report a value of zero.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to current annualized gross rate of an account. This rate would be different in case of a consortium funding. When conventionally amortizing a records balance with the Model with Gross Rates option selected, the cash flow engine uses the current gross rate as the customer rate. If the option is not selected, then the cash flow engine uses current net rate as the customer rate for amortization calculation. Also to determine the prepayment rate, the current customer rate must be compared to the market rate. If the Model with Gross Rates option is selected, then the customer rate is represented by the current gross rate. If the Model with Gross Rates option is not selected, the current net rate is used as the current customer rate. When this is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Net Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Long",
                    "gcd": "Refers to the current interest rate or Current nominal interest rate is used to derive the interest cash flow, income or expense, that is due to the financial institution, referred to as net. All term accounts require a valid current interest rate. For non interest earning or bearing accounts, current interest rate equal to 0. For transaction accounts where the rate changes daily based upon average balances, current interest rate should be the spot rate at the time the extract program is run. For interest bearing accounts, current interest rate is greater than or equal to 0.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Payment Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the current period payment made. Current Payment is the installment amount received from the customer. Current payment in the case of asset products represents the current periodic payment made to repay the outstanding balance. For standard amortization types, those that are not non patterned and non scheduled, Transfer Pricing Application, remaining term methods, uses the current payment from the detail record for the life of the record until a payment recalculation occurs. This will same as maturity amount in case of repo contracts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Principal Outstanding",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the principal component of the current end of period balance of the account or contract. Each account will have principal and interest component, this column will capture the outstanding principal component at the end of the month. This is different from End of period balance because the end of period balance has the accrued interest and this column does not have accrued interest.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Write Off Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount written off once the loan or receivable has turned bad. This is done when no recovery is possible and the due date of repayment has elapsed a while ago. The write off amount is for the current period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source system from where data is extracted. Data can be sourced from multiple sources, this column will Refers to the source code from where the data is extracted for this extraction date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Debt Amount At Termination",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total debt at the time of any involuntary termination. Total debt should be reported at gross, not net values, and is comprised of:1, Unpaid Principal Balance,2, Interest pass through Amount, interest paid to the Investor to purchase loan out of pool or any prior years interest charged off at non accrual status,3, Total Corporate Advance, incl. Property Preservation and Attorney’s fees,4, Total Escrow Advance, taxes and insurance paid, Note: Any involuntary termination includes REO, short sale, deed in lieu of foreclosure, third party sale or charge off. Do not include any write downs prior to termination. If a loan goes through a foreclosure sale and comes into REO, report the aggregate of the various stages of the process. This line item is a required line item for portfolio loans and best.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delinquency Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of days the account has remained delinquent in the current delinquency period. The account could have been delinquent a number of time earlier, but Refers to the current delinquency days.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delinquency Workout Program Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to code for the loss or delinquency work out program. Delinquency Workout Program Dimension is the is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delinquent Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount corresponding to account that are delinquent. Amount which is due for payment with respect to the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delinquent Amount Capitalized",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the delinquent amount which is unpaid and is capitalized i.e. added to outstanding principal of the account, for the MIS period. The delinquent amount capitalized can comprise of Principal, Interest, Charges, Fees and Other Expenses which were posted to the account and classified as delinquent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delinquent Life Times",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of times the account has been delinquent on installment payment during the life of the account. An account can be in and out of delinquency a number of times during its life.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Designated Maturity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the maturity in days of the associated benchmark. This is applicable in case of floating rate instruments. If the benchmark is a 30 day LIBOR, 30 is stored and if it is a 3M LIBOR, 90 is stored.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discretion To Reprice Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates as per contract, Bank has the discretion to reprice and decide the date from which the rate is applicable.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Draw Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date till which the borrower has the ability to make withdrawals against the loan.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Maturity Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the effective maturity date of the contract. Effective maturity takes into account that certain instruments like bonds have a callable feature which can likely shorten the maturity of these instruments.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Encumbrance Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Encumbrance Source Code. An asset will be treated as encumbered if it has been pledged or if it is subject to any form of arrangement to secure, collateralize or credit enhance any instrument from which it cannot be freely withdrawn.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to end of period balance which includes accrued interest. All the calculations such as interest, prepayment amounts etc. are based on this amount. This is used in all the calculations performed by cash flow engine. In Case of LC Contracts, EOP Balance should be populated when LC Is executed. Till LC is executed, LC amount sanctioned should be hold in Total Commitment Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Principal Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the outstanding principal balance at the end of the month. Each account will have principal and interest component, this column will capture the outstanding principal component at the end of the month.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Escrow Amount After Modification",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the escrow amount in the month after loan modification. This should be the escrow portion of the monthly payment and not the full escrow balance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Escrow Amount Before Modification",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the escrow amount in the month prior to loan modification. This should be the escrow portion of the monthly payment and not the full escrow balance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Ever Ninety Plus Days Past Due In Past Twelve Months Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the card holder was ever in 90 or more days past due bucket in the twelve months ending in the reference month.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fiduciary Relationship Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account is held with the bank under a fiduciary capacity. Fiduciary capacity means trustee, executor, administrator, registrar of stocks and bonds, transfer agent, guardian, assignee, receiver, or custodian under a uniform gifts to minors act investment adviser, if the bank receives a fee for its investment advice any capacity in which the bank possesses investment discretion on behalf of another or any other similar capacity that the regulator authorizes. For example deposits that are placed with a bank by a national bank for which the bank is a fiduciary.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Finance Charge Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the balance on which finance charge was calculated. Finance charge is a fee charged for the use of credit or the extension of existing credit. May be a flat fee or a percentage of borrowings, with percentage based finance charges being the most common. A finance charge is often an aggregated cost, including the cost of the carrying the debt itself along with any related transaction fees, account maintenance fees or late fees charged by the lender.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "First Mortgage Serviced In House Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag identifies any instance where the first mortgage associated with the home equity loan or line is serviced by the origination bank. List of Values Y, yes, N, no, NULL.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "First Payment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the first payment was made on the account. In case of lease contracts, the first payment amount is the first time a lessee makes a lease rent payment to the lessor. This field may be provided on a best efforts basis for loans serviced for others and loans acquired through mergers and acquisitions. The payment schedules fixed by the financial institution may change under certain circumstances like restructuring, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Floating Rate Spread",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "The column stores the spread or margin that is added, in case of asset it will be a positive spread and for liability it will be a negative spread, to the benchmark floating rate for all adjustable rate instruments, this is the rate that is offered to the customer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forbearance And Renegotiation Status Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the Forbearance or Renegotiation Status Date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Forbearance Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to Forbearance Status Code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Foreclosure Referral Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to foreclosure referral date – Report the date that the mortgage was referred to an attorney for the purpose of initiating foreclosure proceedings. This date should reflect the referral date of currently active foreclosure process. Loans cured from foreclosure should not have a referral date. Note: If a loan is not in foreclosure, then the Foreclosure Sale Date line item, Line item 61, Foreclosure Referral Date line item, Line item 62, should be blank, i.e. null value. Do not populate this line item with a 0 date value, or with any other value.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Foreclosure Sale Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Indicates the date that the foreclosure sale occurs on the subject property. This is typically the end of the foreclosure process, unless the borrower is in a state that allows for the right of redemption.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Foreclosure Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Indicates the foreclosure process status. Foreclosure Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Foreclosure Suspended Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if foreclosure sale has been suspended or not. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Full Recourse Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates full recourse flag. Underlying mortgages of RMBS, received as Mitigant, are considered as “full recourse’’ if in the case of foreclosure the mortgage owner remains liable for any shortfall in sales proceeds from the property i.e. the lender can go after the borrowers personal assets to collect if the loan is defaulted. Default value should be N. Specific to RMBS. This is one of the criteria which is used to qualify mitigant as high quality liquid asset. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Guarantor Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the identifier of the Party who guaranteed the program.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "HAMP Loan Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique Loan number under Home Affordable Modification Program, HAMP. The Home Affordable Modification Program, HAMP, is designed to help financially struggling homeowners avoid foreclosure by modifying loans to a level that is affordable for borrowers now and sustainable over the long term. The program provides clear and consistent loan modification guidelines that the entire mortgage industry can use. The Home Affordable Modification Program includes incentives for borrowers, servicers and investors.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holding Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holding intent of the account. Holding Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Home Affordable Refinance Program Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag identifies if a loan was originated under the Home Affordable Refinance program. 'Home Affordable Refinance” Program Flag  Identify all loans originated as part of the Home Affordable Refinance Program announced March 4, 2009. Loans should be flagged as such regardless of whether the loan was serviced in house prior to refinance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "ISO Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Income Documentation Program Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "This column stores the code of the income documentation related to particular account or customer. Income Documentation Program Dimension can be referred for the list of values.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Initial Disbursement Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total principal amount funded or Disbursement Amount at origination.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Insurer Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This stores unique identifier of the Insurer entity, this is only applicable when there are no multiple Insurers or Insurance participation. In case of participated contracts, this is expected to be populated with lead Insurer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Accrued Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the accrued interest amount associated with the contract. This is the interest that has accumulated on an instrument since the last interest payment up to, but not including, the settlement date. Accrued Interest is defined as Interest earned but not received, realized. For example, bonds usually pay interest every six months, therefore interest accrues between one interest payment and the next. The buyer of a bond pays its market value plus the interest earned up to the settlement date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest After Modification Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the outstanding interest amount in the month after loan modification.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Before Modification Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the outstanding interest amount in the month before loan modification.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Only In Reporting Month Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the loan is currently an IO loan or not. Identifies whether the minimum mortgage payment in the reporting month represents only the interest due on the loan. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Only Locked Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Amount of credit line that has been locked., Interest Only,\nFor lines of credit, populate this field with the total dollar amount of the outstanding principal balance that has been locked as an interest only loan operating under independent terms. Important: Leave NULL for any home equity loan. Also leave NULL for any line of credit that does not have a lockout feature. If a line of credit has a lockout feature and no balance is locked, the field should contain a zero.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate After Modification",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Stored the interest rate in the month after loan modification has to be reported.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Before Modification",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the interest rate in the month before loan is under modification program.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Frozen Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if Interest Rate for a given account is frozen at a lower rate than the rate it is allowed to be reset to. Such an action is made by the lender to avoid a loan loss and as a loss mitigation act. For e.g. If a loan with interest rate 4Percent is to be reset to 6Percent, the lender chooses not to do so and holds the interest or freezes interest rate at 4 Percent, it is called as Interest Rate Frozen. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the type of interest rate paid on this transaction., For instance Fixed Or Floating.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Recovered Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the interest component of the amount recovered. Recovery refers to the process of collecting overdue amount. Recovery can be applicable to loans or debt in several categories like current, delinquent, non performing, sub standard, doubtful, bad.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Type At Origination",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the interest type at the time of origination of the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Type Conversion Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the interest type change code for a given loan. Indicates whether the interest type was converted from ARM to Fixed through loss mitigation, and the duration of the fixed rate period. Interest Type Conversion Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Write Off Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount Interest that has been written or Charged off. This amount includes only overdue interest on that account. Asset write offs happen when a loan repayment is delayed and any efforts by the collection and recovery department of the financial institution are unsuccessful or partially successful.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Write Off Charged To Allowance For Loan And Lease And Losses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Interest Write off amount charged to Allowance for Loan and lease losses.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Investor Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the investor id of the investor who has invested in the instrument issued by the legal entity.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Joining Credit Score",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the credit score of the customer at the time of joining the financial institution for this relationship. Credit scores are defined as a statistically derived numeric expression of a persons creditworthiness that is used by lenders to access the likelihood that a person will repay his or her debts. A credit score is based on, among other things, a persons past credit history. It is a number between 300 and 850  the higher the number, the more creditworthy the person is deemed to be.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Last Delinquent Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date when the loan was last delinquent. This is the most recent data when the account was in delinquent state. The last delinquent date represent the previous time the loan was delinquent even though the loan is in Current or in Performing status.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Latest Record Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag identifies the latest records for a particular combination of primary keys. List of values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Legal Entity Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the entity code of the legal entity to which the account will be attributed in the general ledger.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Lien Performance Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the performance code of the lien associated with the loan account. Lien Performance dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Lien Position Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of underlying note on the loan. This is also known as the lien position. First mortgage is a mortgage in a first lien position on the property that secures the mortgage. A first mortgage has priority over all other liens or claims on a property in the event of default. If the loan to value, LTV, ratio of a first mortgage is greater than 80 percent, lenders generally require private mortgage insurance, PMI. In such a case, it can sometimes be economical for a borrower to limit the size of the first mortgage to an 80 percent LTV and use secondary financing to borrow the remaining amount needed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Liquidation Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of liquidation status to convey the way account was liquidated. Liquidation Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Load Identifier",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Numeric",
                    "gcd": "Refers to the load run identifier. Load run identifier enables user to load multiple versions intraday or post back dated adjustment entries to the table. Refers to the Load run identifier of the equivalent record in product processor that needs to be adjusted. Default value of  1 indicates that the latest load run is being adjusted.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Modification Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the loan that is currently operating under modified terms and identifies the specific terms that were altered through loss mitigation efforts.\nThis field is independent of investor and speaks only to the nature of the program. For example, a FNMA loan may be modified under either a FDIC or proprietary modification program where in these cases this field would be populated with either the FDIC or proprietary codes while the Investor field would identify the modification as being performed on a FNMA loan.\n0. Loan has not been modified \n6. ASF Streamline \n8. FHFA Streamline which is Specific to program announced on 12.15.08\n9. FDIC Streamline which is Mod in a Box\n10. Proprietary Systematic Program \n11. Proprietary Other \n12. Home Affordable Modification and\n0. Not Modified\n7. 2MP\n8. Proprietary Systematic\n9. Proprietary Other\n10. HAMP.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Purpose",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code for the purpose of the loan. For example, New purchase, Refinancing and so on.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Recourse Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to loan recourse type. A loan with recourse type would provide the financial institution to pursue recovery of any specific component of the unpaid debt from the personal assets of the customer. A mortgage or auto loan is backed by the asset that is financed, upon default, the asset is sold to make good the amount due from the customer. If the amount is insufficient to cover a component which has been agreed under the recourse, then the lender can is empowered by pursuing against any other asset that the customer may hold to recover the amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Repurchase Request Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which request for loan repurchase for the asset that has been sold.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Source Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the loan source type code. Loan Source Type Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Lockout Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates the loan that contains a “lock  out” feature whereby a portion of the outstanding principal balance on a line may be locked into an amortizing or interest only loan with separate terms. List of values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Managed Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if particular account is managed or not. Here “managed” refers to loans originated by the Bank Holding Company, including securitized loans put back on the books due to ASC Topics 860 which deals with transfers and servicing arrangements and 810 which deal with consolidation of entity. However it does not include loans that were originated by a third party and only serviced by the BHC. List of values are Y,N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maximum Contractual Exposure Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the column Refers to Maximum contractual probable contractual exposure arising from sale with recourse.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mitigant Last Property Valuation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the mitigant was last valued.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mitigant Property Location Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the Location code of the property. Location code is defined as the code which will represent the address of the property from zip code onwards like which city, country, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mitigant Sale Price",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the price which one can get if the mitigant is sold in the market.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mortgage Servicing Rights Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code reference to the Mortgage Servicing Rights bought by said Bank holding company.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Negative Amortization Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicate that the referenced loan, lease or overdraft that have or potentially can have a feature that allows the borrower to pay an amount that is less than the interest accruing on the loan or overdraft, resulting in negative amortization. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Net Finance Charge Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the dollar amount of the net finance charges assessed on the reporting months statement.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Next Payment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the Due date of the next scheduled payment. Otherwise known as cash flow date or date of runoff. Otherwise known as cash flow date or date of runoff. NEXT PAYMENT DATE is used to define the next scheduled, forecasted, payment date. If REMAINING NO PAYMENTS > 1, NEXT PAYMENT DATE < MATURITY DATE, If REMAINING NUMBER OF PAYMENTS = 1, NEXT PAYMENT DATE = MATURITY DATE. If next payment date is unknown, set to either: CALENDAR PERIOD + PMT FREQ, or MATURITY DATE.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Next Reprice Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which interest rate will be reprice for the instrument. It is applicable for adjustable rate accounts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Number Of Interest Only Months",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of months from origination the loan is interest only.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Number Of Times Loan Terms Modified In Twenty Four Months",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of times where the loan was modified in last 24 months. The value expected is a integer number which denotes the count.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Occupancy Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code that indicates the occupancy of the property at origination or purchase of the loan in case of product processor tables and current occupancy in the Mitigants table. This is applicable for real estate loans. DIM OCCUPANCY TYPE is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the original account number held by the source system. If there are multiple source systems without unique account numbers, we expect the account number and source system to be concatenated as part of the primary key, while this column will store the original account number as generated by the source system.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Original Adjustable Rate Mortgage Option Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates the payment Option ARM which is a nontraditional mortgage that allows the borrower to choose from a number of different payment options. For example, each month, the borrower may choose: a minimum payment option based on a ‘‘start’’ or introductory interest rate, an interest only payment option based on the fully indexed interest rate, or a fully amortizing principal and interest payment option based on a 15 year or 30 year loan term, plus any required escrow payments.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Annual Percentage Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the original Annual Percentage Rate. The annual rate that is charged for borrowing, or made by investing, expressed as a single percentage number that represents the actual yearly cost of funds over the term of a loan. This includes any fees or additional costs associated with the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Combined Loan To Value Ratio",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Store original Combined Loan to value ration for a given account. The original combined loan to value, CLTV, ratio is the original first loan amount and any junior liens at the time of origination divided by the lesser of the selling price or the appraised value of the property securing the mortgage at origination. This field may be provided on a best efforts basis for loans serviced for others and loans acquired through mergers and acquisitions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Credit Score Source",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the Original External Credit score source of the given account. List the vendor of the commercially available credit bureau score reported . If the vendor of the commercially available credit score reported is not among those listed, please select “Other” and report the vendor. List the version of the credit score in item 135. Note that scores which do not meet the definition of a commercially available credit bureau score as set forth in the General Instructions may be treated as missing data by the Federal Reserve 1=FICO 2=Vantage Score 3=Other.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Debt To Income Back End",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to original Debt to Income, DTI, Back End at Origination. Debt to Income, DTI, This ratio is the percent of a borrowers total monthly debt payments, including proposed housing expenses, divided by his or her gross monthly income, used to determine the mortgage amount that qualifies a borrower. The total debt to income, or back end, ratio, shows how much of your gross income would go toward all of your debt obligations, including mortgage, car loans, child support and alimony, credit card bills, student loans and condominium fees. In general, your total monthly debt obligation should not exceed 36 percent of your gross income. To calculate your debt to income ratio, multiply your annual salary by 0.36, then divide by 12, months. The answer is your maximum allowable debt to income ratio Example: Furthermore, the lender says the total debt payments each month should not exceed 36 percent, which comes to USD 1,200., USD 40,000 times 0.36 equals 14,400, and 14,400 divided by 12 months equals 1,200.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Debt To Income Front End",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to original Debt to Income, DTI, Front End at Origination. DTI Ratio, Front end, at origination – Report the Front end DTI, PITI Housing Ratio, at origination of the mortgage Front end DTI ratios give the percentage of a borrowers monthly income that would go toward housing expenses, mortgage payment, real estate taxes, homeowners insurance, association dues, etc., The housing expense, or front end, ratio shows how much of your gross, pretax, monthly income would go toward the mortgage payment. As a general guideline, your monthly mortgage payment, including principal, interest, real estate taxes and homeowners insurance, should not exceed 28 percent of your gross monthly income. To calculate your housing expense ratio, multiply your annual salary by 0.28, then divide by 12, months. The answer is your maximum housing expense ratio. Example: Take a homebuyer who makes USD 40,000 a year. The maximum amount for monthly mortgage related payments at 28 percent of gross income is 933 USD., USD 40,000 times 0.28 equals 11,200, and 11,200 divided by 12 months equals 933.33.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Escrow Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the escrow amount, including taxes and insurance, due from the borrower at origination of the loan, included in the first payment. For non escrow loans, report a value of zero.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Fico Score",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Store the original Fair Isaac Corporation, FICO, score of the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Gross Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the book balance at the time of origination. Original gross book balance is the sum total of End of Period Balance Plus Deferred Balance, represented as a negative amount to depict the unamortized portion. This is used while calculating amortization. The book balance is the term financial institutions use to describe the amount of money available before any adjustments have been made for deposits in transit, checks that have not yet been cleared, reserve requirements and interest received from 'float funds' hence is generally greater than end of period balance, Also called as 'gross balance'.\nIt also excludes any deferred balance that is unamortized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to contractual interest rate at origination date whereas the interest rate field would store the interest rate applicable to the instrument as on As of Date. This is used for computing Effective Interest Rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Lien Position Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the lien position code at origination. Refers to the type of underlying note on the loan. This is also known as the lien position. First mortgage is a mortgage in a first lien position on the property that secures the mortgage. A first mortgage has priority over all other liens or claims on a property in the event of default. If the loan to value, LTV, ratio of a first mortgage is greater than 80 percentage, lenders generally require private mortgage insurance, PMI. In such a case, it can sometimes be economical for a borrower to limit the size of the first mortgage to an 80 percentage LTV and use secondary financing to borrow the remaining amount needed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Loan To Value Ratio",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the original loan to value ratio of the account. This is computed as the ratio of Loan amount sanctioned to the value of the collateral against which the loan is granted. The loan to value measure is critical for credit decisioning, the ratio reduces as the loan account moves towards maturity.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Maturity Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the original maturity date of the reference issue, typically debt securities. It would be used to derive residual maturity and original maturity of the reference issue. Original maturity date is the contractual date on which the principal balance of an earning asset or debt instrument is due and payable to the holder.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Mitigant Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the mitigant value when the mitigant is recorded in record of financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Term",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to contractual term as on origination date. Original Term is used in conjunction with original term unit to define the contractual term at origination date. Transfer Pricing cash flow methodologies use original term when calculating the current payment for adjustable rate accounts and in transfer pricing fixed rate accounts. For adjustable rate accounts, the cash flow engine compares original term against amort term, checking to see if the account is a balloon type account. If original term < amort term, the engine recognizes the record as a balloon. The cash flow engine amortizes the outstanding principal balance over the calculated number of payments, based upon the amortization maturity date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Term Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the unit of the original term such in D days, M months or Y year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Valuation Method Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the original property valuation method. Indicates the way the value of the property was determined. Options are\n1. Full appraisal – Prepared by a certified appraiser\n2. Limited appraisal – Prepared by a certified appraiser\n3. Broker Price Opinion as BPO.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Origination Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the Date on which current institution originated or acquired the instrument. For rolled instruments the greater of date last rolled or date acquired.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Overdue Interest Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the overdue interest amount of the account. A installment has got two components principal and interest, Refers to the interest component of the unpaid installment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Overdue Principal Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the overdue principal amount as of extraction date. Overdue principal refers to the principal which was due for payment but not paid yet. This is not applicable for overdraft account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Overdue Total Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to total amount of the principal, interest and any fee or charges payment outstanding at the FIC MIS date, which is contractually due and has not been paid, past due.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Ownership Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the organization defined code for the ownership type of the account. Expected values are IND  Individual, JOINT  Joint Tenant or Community Property, TRUST  Trust, CUST  Custodian, CORP  Corporate, FIRM  Firm Owned and OTHER  Other.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Past Due Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the account was declared past due. The past due date represent the date on which the loan became past due during the current default period, this occurs when the loan is in default status only.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Past Due Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to Indicate whether the exposure is past due or not. If delinquency days are greater than 90 then its past due. If the value is updated as Y means the exposure is past due and if the value is updated as N means the exposure is not past due. List of Values are Y,N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Payment frequency is used in conjunction with PAYMENT FREQUENCY UNIT to define the payment frequency of an account. Using this, the Next Payment Dates are calculated. For a repo since there is only one payment at maturity, this column can be defaulted to number of days between Maturity and Original date. \nTransfer Pricing Application cash flow methodologies reference PAYMENT FREQ for calculating and processing payments and prepayments. The engine forecasts future next payment dates by incrementing NEXT PAYMENT DATE forward by PAYMENT FREQUENCY. PAYMENT FREQUENCY is referenced by the cash flow transfer pricing methodologies when deriving discounted cash flows. PAYMENT FREQUENCY > 0 in all cases. PAYMENT FREQUENCY = 0 can cause incorrect calculations to occur. Note that PAYMENT FREQUENCY = 1 and PAYMENT FREQUENCY MULT = D requires the cash flow engine to perform cash flow calculations for every day of the modeling horizon.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Post Workout Account Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the status code of the workout program post successful execution of the said program.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Prepayment Penalty Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicate whether the credit facility has a prepayment penalty clause in effect or not. List of values are Y, N. Y  Use this value if the credit facility has a prepayment penalty clause in effect which may include yield maintenance. N  Use this value if the credit facility had a prepayment penalty clause that has since expired, If the facility does not have a prepayment penalty clause, leave the column as Null.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Principal After Modification Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the outstanding principle amount in the month after loan modification.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Principal Deferred Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the principal deferred amount, reports the total amount in dollars of the principal that was deferred through loss mitigation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Principal Outstanding Before Modification",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the outstanding principle amount in the month before loan modification.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Principal Recovery Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the principal component of the amount recovered during the current month. Recovery refers to the process of collecting overdue amount. Recovery can be applicable to loans or debt in several categories like current, delinquent, non performing, sub standard, doubtful, bad.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Principal Write Off Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount written off as bad debt. This amount includes only overdue principal on that account. Asset write offs happen when a loan repayment is delayed and any efforts by the collection and recovery department of the financial institution are unsuccessful or partially successful.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Principal Write Off Amount Inception To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Account Principal Write off Amount Inception to date that has been written or Charged off.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Principal Write Off Charged To Allowance For Loan And Lease And Losses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Principle Write off amount charged to Allowance for Loan and lease losses.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Product Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code assigned to each of the Products offered by the Bank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Program Activity Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the program activity status code. Program Activity Status Dimension is the equivalent seeded dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Project Finance Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Indicated Project Finance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Prominent Mitigant Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the prominent mitigant associated with the credit facility or the account. Prominence can be arrived by various criteria like value, liquidity of collateral etc.,",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Property Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the property type code associated with given account. Property Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Purchase Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the purchase price of an asset. This amount is not the same as the Balance Outstanding. It is an accounting rule that mandates that during the purchase of loans that have evidence of credit deterioration since origination, the net investment in loans is recorded. The net investment in loans is the lower of the acquisition cost of the loan or the estimated fair value at the date of acquisition.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Cap Life",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Rate cap life refers to maximum interest rate allowed during life of an adjustable rate instrument. If Forecast Rate Plus Margin > Rate Cap Life, then the rate specified in Rate Cap Life is used.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Floor Life",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Rate floor life refers to Minimum interest rate allowed during the life of an adjustable rate instrument. If Forecast Rate + Margin < Rate Floor Life, then the rate specified in Rate Floor Life is used.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Recourse To General Credit Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Refers to the recourse to general credit flag which identifies the liabilities for which creditors do not have the recourse to the general credit of the holding company. The list of values are Y when the creditor has the rights to seize the assets other than the protection pledged and N when the creditor does not have the rights to seize the assets other than the protection pledged .",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Recourse To Guarantee Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicate whether the bank relied on a sponsor or guarantor as a source of repayment when considering the credit for approval. List of values are Y N.\nA value Y indicates that the contract is recourse to guarantee, and N indicates that the contract is not recourse to guarantee.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Recovery Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "This is the date on which the party recovered from the medical condition.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Renewal Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the account was renewed. Renewal is defined as the action of extending the period of validity of a license, subscription, or contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repayment Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the loan repayment plan status code. This tracks the performance of repayment and step to mod plans. If a repayment plan or step to mod was completed successfully during the month it should be coded as such in the work out type completed field, this field is only to be populated for repayment plans that were active as of the end of the month or broken during the month. Broken plans should only be reported in the month the plan breaks. Repayment Status dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repricing Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to reprice Frequency is used in conjunction with Repricing Frequency Unit to define the frequency of rate change of an account. Repricing Frequency is used to identify whether records are adjustable or not. If Repricing Frequency> 0, the record is considered adjustable. If Reprice Frequency = 0, the record is fixed rate. It is used to compute the re price dates after the next_reprice_date. REPRICE_FREQ must be either 0 or positive.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Revolving Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account is a term or revolving account. Revolving credit is a type of loan or credit that does not have a fixed number of payments. The revolving limit is similar to a credit limit against which a customer can draw funds for financing. Revolving amount is applicable to products like credit cards, revolving loans or line of credit etc. Term products are those products that have pre scheduled payments or maturity. Examples of term products are term loans, term deposits or Certificate of deposit etc. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Run Identifier",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the run identifier for a set of Records participating in the particular Run with the Run Execution identifier. This is a combination of Run Main Identifier and Run Execution Identifier.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sale Cost",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the costs of sales e.g., sales commissions and buyer concessions of the property sale during the termination of the loan.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sanctioned Limit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the credit limit that was sanctioned for this account which was originally allocated to the customer at the time of joining. The maximum amount for which a particular borrower is approved is known as the credit limit. If the limit is not revised the original limit and credit limit are the same.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Scheduled Interest Balance Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the scheduled Interest balance amount should reflect the balance outstanding based on the scheduled payment which is due from the borrower in the reporting month, not the actual payment made by the borrower.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Scheduled Principal Balance Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the scheduled principal balance amount should reflect the balance outstanding based on the scheduled payment which is due from the borrower in the reporting month, not the actual payment made by the borrower. There will be a difference in the scheduled versus actual only in cases of delinquency or curtailments.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Secured Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account or contract number is secured with a collateral or not. The collaterals to be considered here will be the collaterals other than margins. In case of deposits, this indicates it is Collateralized or Secured Deposit. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securitization Pool Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Unique identifier of the organization defined codes for a securitization pool. Securitize refers to a pooled group of financial assets that together create a new security, which is then marketed and sold to investors. The value and cash flows of the new security are based off of the underlying value and cash flows of the assets used in the securitization process. Companies will securitize illiquid assets into liquid assets in order to increase their overall liquidity and generate immediate proceeds from their assets.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securitization Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the securitization type codes. For example, TRD for Tradition securitization, SYN for synthetic securitization etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Seniority Claim Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is a senior claim. In case of Purchase Receivables, if the purchasing bank is unable to decompose EL into its PD and LGD components in a reliable manner, the risk weight is determined from the corporate risk weight function using the following specifications, if the bank can demonstrate that the exposures are exclusively senior claims to corporate borrowers, an LGD of 45Percent can be used, otherwise an LGD of 100Percent is used. List of values are Y and N, A value Y indicates that the exposure is a senior claim, and N indicates that the exposure is not a senior claim.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Service Charges",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the service charges levied by the Financial Institution on that account. Service charge refers to a type of fee charged to cover services related to the primary product or service being purchased. For example a fee for using the ATM machine of the financial institution or a fee for using the credit card in any of the financial institution etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Serviced Loan Account Number",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the service account or service contract held by the customer. Account number is defined as numbers, letters or alphanumeric code assigned to every significant customer, supplier and lender for ease of reference in accounting records of a financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Servicer Delinquent Advances Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total delinquent advances made by the servicer on past due mortgages. Include both corporate, including maintenance and property preservation costs, and escrow advances in this amount. Servicer Advances Report the total delinquent advances made by the servicer on past due mortgages. Include both corporate, including maintenance and property preservation costs, and escrow advances in this amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Negotiated Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the column stores the settlement amount, portion of the outstanding UPB, agreed to be paid by the customer.\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sold With Recourse Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the asset has been sold with or without recourse. A value Y means sold with recourse. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Overdue Fee Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total over due fees levied for an account. It excludes the fees due as of date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Write Back Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total amount written back on an account. When a payment is received on a written off account or a partially written off account, write back is said to have occurred. Write back, in general is the increase in value of an asset after a previously made write down. Write backs may have implications related to capital gain taxes.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Write Down Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total write down amount of the account. Write down refers to the reduction in book value of assets. Write downs can also happen on physical assets like property, plant and equipment, PPE. \nIf the financial institution accrues interest on defaulted exposure, the outstanding payable by the customer grows which is an artificial amount and is most likely irrecoverable as well. Hence, firms decide to write down or depreciate the value of outstanding on the loan.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Troubled Debt Restructure Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the loan was classified as Troubled Debt Restricted loan or account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Troubled Debt Restructure Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates the exposure is a troubled debt which the lender or the bank has considered for restructuring. A troubled debt restructuring is a process where the bank modifies or relaxes the terms of a loan agreement to minimize the eventual loss by accommodating a borrower who for some economic or legal reasons related is in financial difficulties and is financially incapable of meeting the obligation. This is applicable in the case of certain banking products. This is also applicable in the case of certain investment products, wherein the particular instrument has been issued as part of the troubled debt restructuring process. These assets are also called as stressed or distressed assets, or restructured assets due to distress conditions. List of values are Y, N or NULL. A value of Y indicates that the exposure is a troubled debt which the lender or the bank has considered for restructuring, or has been issued as part of the troubled debt restructuring process. A value of N or Null indicates that this exposure is not considered for the troubled debt restructuring.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Undrawn Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the undrawn amount till date. In case of borrowings, it is computed as Sanctioned Limit  Drawn Amount. In case of cards, it is computed as Sanctioned Limit  EOP Balance. In case of facility it is derived by subtracting the committed amount if any from the facility amount and also by reducing the total amount exposures from the facility amount. In case of commitment contract it is the difference between the committed amount and the drawn or utilized amount in the loan exposures.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Units Of Property",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of units provided as a mitigant. Applicable for real estate only. List of Values are1 = one unit 2 = two units 3 = three units 4 = four units U = Unknown Y = Other",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Valuation Method Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code identifying the method used when valuing assets. The four most common methods used are Discounted cash flow i.e. DCF analysis, Comparable transactions method, Multiples method and Market valuation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Value Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the value date of the contract. Value Date is a securities industry term describing the date on which a trade, bonds, equities, foreign exchange, commodities, etc., settles. That is, the actual day on which transfer of cash or assets is completed, or the settlement amount is calculated. \nIn case of FX swap instrument Refers to the settlement date for spot or near leg. Also considered as the date on which the contract becomes effective.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Write Down Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the asset is written down, depreciated, in order to reflect its true value. Write down is reducing the book value of an asset because it is overvalued compared to the market value. A write down typically occurs on a financial statement of the company, when the carrying value of the asset can no longer be justified as fair value and the likelihood of receiving the cost, book value, is unlikely.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Write Off Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the asset was written off from the books of the financial institution. Asset write offs happen when a loan repayment is delayed and any efforts by the collection and recovery department of the financial institution are unsuccessful or partially successful.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Write Off Reason Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the write off reason in case of accounts with write offs. Common reasons for write offs include bankruptcy, legal issues, death of the customer etc.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [
                {
                    "dqId": "DQLOV32931",
                    "btLogicalName": "Fiduciary Relationship Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32932",
                    "btLogicalName": "Discretion To Reprice Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32933",
                    "btLogicalName": "Full Recourse Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32934",
                    "btLogicalName": "Interest Rate Frozen Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32935",
                    "btLogicalName": "Negative Amortization Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32936",
                    "btLogicalName": "Original Adjustable Rate Mortgage Option Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32937",
                    "btLogicalName": "Original Term Unit",
                    "dqDesc": "Should have list of values as D,M,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32938",
                    "btLogicalName": "Recourse To Guarantee Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32939",
                    "btLogicalName": "Revolving Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32940",
                    "btLogicalName": "Foreclosure Suspended Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32941",
                    "btLogicalName": "Recourse To General Credit Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32942",
                    "btLogicalName": "Secured Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32943",
                    "btLogicalName": "Sold With Recourse Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32944",
                    "btLogicalName": "Past Due Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32945",
                    "btLogicalName": "Account Remaining Tenor Unit",
                    "dqDesc": "Should have list of values as D,M,W,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32946",
                    "btLogicalName": "Credit Line Frozen Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32947",
                    "btLogicalName": "Interest Only In Reporting Month Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32948",
                    "btLogicalName": "Ever Ninety Plus Days Past Due In Past Twelve Months Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32949",
                    "btLogicalName": "First Mortgage Serviced In House Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32950",
                    "btLogicalName": "Troubled Debt Restructure Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32951",
                    "btLogicalName": "Prepayment Penalty Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32952",
                    "btLogicalName": "Managed Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32953",
                    "btLogicalName": "Seniority Claim Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32954",
                    "btLogicalName": "Home Affordable Refinance Program Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32955",
                    "btLogicalName": "Lockout Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQLOV32956",
                    "btLogicalName": "Capitalization Amount Modified Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38490",
                    "btLogicalName": "Account Close Date",
                    "dqDesc": "Reference Check for Account Close Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38491",
                    "btLogicalName": "Account Close Date",
                    "dqDesc": "Reference Check for Account Close Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38492",
                    "btLogicalName": "Alternative Home Liquidation Loss Mitigation Date",
                    "dqDesc": "Reference Check for Alternative Home Liquidation Loss Mitigation Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38493",
                    "btLogicalName": "Alternative Home Liquidation Loss Mitigation Date",
                    "dqDesc": "Reference Check for Alternative Home Liquidation Loss Mitigation Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38494",
                    "btLogicalName": "Alternative Home Retention Loss Mitigation Date",
                    "dqDesc": "Reference Check for Alternative Home Retention Loss Mitigation Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38495",
                    "btLogicalName": "Alternative Home Retention Loss Mitigation Date",
                    "dqDesc": "Reference Check for Alternative Home Retention Loss Mitigation Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38496",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38497",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38498",
                    "btLogicalName": "Credit Status Date",
                    "dqDesc": "Reference Check for Credit Status Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38499",
                    "btLogicalName": "Credit Status Date",
                    "dqDesc": "Reference Check for Credit Status Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38500",
                    "btLogicalName": "Draw Till Date",
                    "dqDesc": "Reference Check for Draw Till Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38501",
                    "btLogicalName": "Draw Till Date",
                    "dqDesc": "Reference Check for Draw Till Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38502",
                    "btLogicalName": "Effective Maturity Date",
                    "dqDesc": "Reference Check for Effective Maturity Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38503",
                    "btLogicalName": "Effective Maturity Date",
                    "dqDesc": "Reference Check for Effective Maturity Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38504",
                    "btLogicalName": "First Payment Date",
                    "dqDesc": "Reference Check for First Payment Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38505",
                    "btLogicalName": "First Payment Date",
                    "dqDesc": "Reference Check for First Payment Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38506",
                    "btLogicalName": "Forbearance And Renegotiation Status Date",
                    "dqDesc": "Reference Check for Forbearance And Renegotiation Status Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38507",
                    "btLogicalName": "Forbearance And Renegotiation Status Date",
                    "dqDesc": "Reference Check for Forbearance And Renegotiation Status Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38508",
                    "btLogicalName": "Foreclosure Referral Date",
                    "dqDesc": "Reference Check for Foreclosure Referral Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38509",
                    "btLogicalName": "Foreclosure Referral Date",
                    "dqDesc": "Reference Check for Foreclosure Referral Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38510",
                    "btLogicalName": "Foreclosure Sale Date",
                    "dqDesc": "Reference Check for Foreclosure Sale Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38511",
                    "btLogicalName": "Foreclosure Sale Date",
                    "dqDesc": "Reference Check for Foreclosure Sale Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38512",
                    "btLogicalName": "Last Delinquent Date",
                    "dqDesc": "Reference Check for Last Delinquent Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38513",
                    "btLogicalName": "Last Delinquent Date",
                    "dqDesc": "Reference Check for Last Delinquent Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38514",
                    "btLogicalName": "Mitigant Last Property Valuation Date",
                    "dqDesc": "Reference Check for Mitigant Last Property Valuation Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38515",
                    "btLogicalName": "Mitigant Last Property Valuation Date",
                    "dqDesc": "Reference Check for Mitigant Last Property Valuation Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38516",
                    "btLogicalName": "Loan Repurchase Request Date",
                    "dqDesc": "Reference Check for Loan Repurchase Request Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38517",
                    "btLogicalName": "Loan Repurchase Request Date",
                    "dqDesc": "Reference Check for Loan Repurchase Request Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38518",
                    "btLogicalName": "Next Payment Date",
                    "dqDesc": "Reference Check for Next Payment Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38519",
                    "btLogicalName": "Next Payment Date",
                    "dqDesc": "Reference Check for Next Payment Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38520",
                    "btLogicalName": "Next Reprice Date",
                    "dqDesc": "Reference Check for Next Reprice Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38521",
                    "btLogicalName": "Next Reprice Date",
                    "dqDesc": "Reference Check for Next Reprice Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38522",
                    "btLogicalName": "Original Maturity Date",
                    "dqDesc": "Reference Check for Original Maturity Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38523",
                    "btLogicalName": "Original Maturity Date",
                    "dqDesc": "Reference Check for Original Maturity Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38524",
                    "btLogicalName": "Origination Date",
                    "dqDesc": "Reference Check for Origination Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38525",
                    "btLogicalName": "Origination Date",
                    "dqDesc": "Reference Check for Origination Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38526",
                    "btLogicalName": "Past Due Date",
                    "dqDesc": "Reference Check for Past Due Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38527",
                    "btLogicalName": "Past Due Date",
                    "dqDesc": "Reference Check for Past Due Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38528",
                    "btLogicalName": "Recovery Date",
                    "dqDesc": "Reference Check for Recovery Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38529",
                    "btLogicalName": "Recovery Date",
                    "dqDesc": "Reference Check for Recovery Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38530",
                    "btLogicalName": "Renewal Date",
                    "dqDesc": "Reference Check for Renewal Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38531",
                    "btLogicalName": "Renewal Date",
                    "dqDesc": "Reference Check for Renewal Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38532",
                    "btLogicalName": "Troubled Debt Restructure Date",
                    "dqDesc": "Reference Check for Troubled Debt Restructure Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38533",
                    "btLogicalName": "Troubled Debt Restructure Date",
                    "dqDesc": "Reference Check for Troubled Debt Restructure Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38534",
                    "btLogicalName": "Value Date",
                    "dqDesc": "Reference Check for Value Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38535",
                    "btLogicalName": "Value Date",
                    "dqDesc": "Reference Check for Value Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38536",
                    "btLogicalName": "Write Down Date",
                    "dqDesc": "Reference Check for Write Down Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38537",
                    "btLogicalName": "Write Down Date",
                    "dqDesc": "Reference Check for Write Down Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38538",
                    "btLogicalName": "Write Off Date",
                    "dqDesc": "Reference Check for Write Off Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38539",
                    "btLogicalName": "Write Off Date",
                    "dqDesc": "Reference Check for Write Off Date in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38540",
                    "btLogicalName": "Account Classification Code",
                    "dqDesc": "Reference Check for Account Classification Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38541",
                    "btLogicalName": "Account Purpose Code",
                    "dqDesc": "Reference Check for Account Purpose Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38542",
                    "btLogicalName": "Accrual Status Code",
                    "dqDesc": "Reference Check for Accrual Status Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38543",
                    "btLogicalName": "Account Status Code",
                    "dqDesc": "Reference Check for Account Status Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38544",
                    "btLogicalName": "Accounting Standard Code",
                    "dqDesc": "Reference Check for Accounting Standard Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38545",
                    "btLogicalName": "Agency Code",
                    "dqDesc": "Reference Check for Agency Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38546",
                    "btLogicalName": "Amortization Type",
                    "dqDesc": "Reference Check for Amortization Type in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38547",
                    "btLogicalName": "Bankruptcy Chapter Code",
                    "dqDesc": "Reference Check for Bankruptcy Chapter Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38548",
                    "btLogicalName": "Benchmark Index Currency Code",
                    "dqDesc": "Reference Check for Benchmark Index Currency Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38549",
                    "btLogicalName": "Branch Code",
                    "dqDesc": "Reference Check for Branch Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38550",
                    "btLogicalName": "Borrower Code",
                    "dqDesc": "Reference Check for Borrower Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38551",
                    "btLogicalName": "Card Exposure Type",
                    "dqDesc": "Reference Check for Card Exposure Type in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38552",
                    "btLogicalName": "Country Code",
                    "dqDesc": "Reference Check for Country Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38553",
                    "btLogicalName": "Credit Card Lending Type",
                    "dqDesc": "Reference Check for Credit Card Lending Type in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38554",
                    "btLogicalName": "Credit Class Type",
                    "dqDesc": "Reference Check for Credit Class Type in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38555",
                    "btLogicalName": "Credit Rating Code",
                    "dqDesc": "Reference Check for Credit Rating Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38556",
                    "btLogicalName": "Credit Score Source",
                    "dqDesc": "Reference Check for Credit Score Source in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38557",
                    "btLogicalName": "Credit Score Source",
                    "dqDesc": "Reference Check for Credit Score Source in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38558",
                    "btLogicalName": "Credit Status Code",
                    "dqDesc": "Reference Check for Credit Status Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38559",
                    "btLogicalName": "Data Source Code",
                    "dqDesc": "Reference Check for Data Source Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38560",
                    "btLogicalName": "Delinquency Workout Program Code",
                    "dqDesc": "Reference Check for Delinquency Workout Program Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38561",
                    "btLogicalName": "Encumbrance Source Code",
                    "dqDesc": "Reference Check for Encumbrance Source Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38562",
                    "btLogicalName": "Forbearance Status Code",
                    "dqDesc": "Reference Check for Forbearance Status Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38563",
                    "btLogicalName": "Foreclosure Status Code",
                    "dqDesc": "Reference Check for Foreclosure Status Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38564",
                    "btLogicalName": "Guarantor Identifier",
                    "dqDesc": "Reference Check for Guarantor Identifier in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38565",
                    "btLogicalName": "HAMP Loan Number",
                    "dqDesc": "Reference Check for HAMP Loan Number in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38566",
                    "btLogicalName": "Holding Type",
                    "dqDesc": "Reference Check for Holding Type in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38567",
                    "btLogicalName": "Income Documentation Program Code",
                    "dqDesc": "Reference Check for Income Documentation Program Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38568",
                    "btLogicalName": "Insurer Identifier",
                    "dqDesc": "Reference Check for Insurer Identifier in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38569",
                    "btLogicalName": "Interest Type Conversion Code",
                    "dqDesc": "Reference Check for Interest Type Conversion Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38570",
                    "btLogicalName": "Interest Rate Type",
                    "dqDesc": "Reference Check for Interest Rate Type in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38571",
                    "btLogicalName": "Investor Identifier",
                    "dqDesc": "Reference Check for Investor Identifier in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38572",
                    "btLogicalName": "ISO Currency Code",
                    "dqDesc": "Reference Check for ISO Currency Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38573",
                    "btLogicalName": "Lien Performance Code",
                    "dqDesc": "Reference Check for Lien Performance Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38574",
                    "btLogicalName": "Lien Position Code",
                    "dqDesc": "Reference Check for Lien Position Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38575",
                    "btLogicalName": "Liquidation Status Code",
                    "dqDesc": "Reference Check for Liquidation Status Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38576",
                    "btLogicalName": "Loan Modification Type",
                    "dqDesc": "Reference Check for Loan Modification Type in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38577",
                    "btLogicalName": "Loan Purpose",
                    "dqDesc": "Reference Check for Loan Purpose in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38578",
                    "btLogicalName": "Loan Recourse Type",
                    "dqDesc": "Reference Check for Loan Recourse Type in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38579",
                    "btLogicalName": "Loan Source Type",
                    "dqDesc": "Reference Check for Loan Source Type in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38580",
                    "btLogicalName": "Legal Entity Code",
                    "dqDesc": "Reference Check for Legal Entity Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38581",
                    "btLogicalName": "Mortgage Servicing Rights Code",
                    "dqDesc": "Reference Check for Mortgage Servicing Rights Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38582",
                    "btLogicalName": "Occupancy Code",
                    "dqDesc": "Reference Check for Occupancy Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38583",
                    "btLogicalName": "Interest Type At Origination",
                    "dqDesc": "Reference Check for Interest Type At Origination in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38584",
                    "btLogicalName": "Original Lien Position Code",
                    "dqDesc": "Reference Check for Original Lien Position Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38585",
                    "btLogicalName": "Original Valuation Method Code",
                    "dqDesc": "Reference Check for Original Valuation Method Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38586",
                    "btLogicalName": "Original Account Number",
                    "dqDesc": "Reference Check for Original Account Number in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38587",
                    "btLogicalName": "Ownership Type",
                    "dqDesc": "Reference Check for Ownership Type in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38588",
                    "btLogicalName": "Post Workout Account Status Code",
                    "dqDesc": "Reference Check for Post Workout Account Status Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38589",
                    "btLogicalName": "Product Code",
                    "dqDesc": "Reference Check for Product Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38590",
                    "btLogicalName": "Program Activity Status Code",
                    "dqDesc": "Reference Check for Program Activity Status Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38591",
                    "btLogicalName": "Prominent Mitigant Code",
                    "dqDesc": "Reference Check for Prominent Mitigant Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38592",
                    "btLogicalName": "Mitigant Property Location Code",
                    "dqDesc": "Reference Check for Mitigant Property Location Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38593",
                    "btLogicalName": "Property Type",
                    "dqDesc": "Reference Check for Property Type in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38594",
                    "btLogicalName": "Repayment Status Code",
                    "dqDesc": "Reference Check for Repayment Status Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38595",
                    "btLogicalName": "Securitization Pool Identifier",
                    "dqDesc": "Reference Check for Securitization Pool Identifier in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38596",
                    "btLogicalName": "Securitization Type",
                    "dqDesc": "Reference Check for Securitization Type in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38597",
                    "btLogicalName": "Serviced Loan Account Number",
                    "dqDesc": "Reference Check for Serviced Loan Account Number in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38598",
                    "btLogicalName": "Valuation Method Code",
                    "dqDesc": "Reference Check for Valuation Method Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                },
                {
                    "dqId": "DQREF38599",
                    "btLogicalName": "Write Off Reason Code",
                    "dqDesc": "Reference Check for Write Off Reason Code in Stage Loans Serviced",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:37.0",
                    "modifiedDate": "2024-11-04 04:39:40.0"
                }
            ],
            "useCases": []
        }
    ]
}