{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "Accounting Standard Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the accounting standard or the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. E.g. GAAP, IFRS etc. Generally Accepted Accounting Principles, GAAP. GAAP are the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. The Generally Accepted Accounting Principles exist to ensure that accountants are using the same or almost the same standards so that comparison of financial statements between or within a company is easy and accurate. They also promote transparency in accounting. However, GAAP provides broad guidelines, there is room for companies to follow an approach within a guideline.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "As Of Date",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Balance Month Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the monthly Average balance. There are different ways to compute monthly average balance. A simple method would be, Opening balance Plus Closing Balance, divided by 2. A complex method would be find out for how many days the balance was with the Financial Institution and then compute the average balance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Balance Month To Date In Local Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the monthly average balance in local currency. There are different ways to compute monthly average balance. A simple method would be, Opening balance Plus Closing Balance, divided by 2. A complex method would be find out for how many days the balance was with the Financial Institution and then compute the average balance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Balance Quarter To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the quarterly average balance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Balance Quarter To Date In Local Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the quarterly average balance in local currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Balance Year To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the annual average balance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Balance Year To Date In Local Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the annual average balance in local currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Balance Month To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the balance month to date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Balance Month To Date In Local Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the balance month to date in local currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Balance Quarter To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the balance from the starting of quarter till date for the same financial year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Balance Quarter To Date In Local Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the balance from the starting of quarter till date for the same financial year in local currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Balance Year To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the year to date balance is the time between the beginning of the fiscal year and the current day. The fiscal year may or may not match with the calendar year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Balance Year To Date In Local Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the year to date balance in local currency is the time between the beginning of the fiscal year and the current day. The fiscal year may or may not match with the calendar year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Code Combination Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the code combinations received from accounting hub",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Movement Month to Date In Entered Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the credit movement month to date in entered currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Movement Month to Date In Functional Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the credit movement month to date in functional currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Movement Quarter to Date In Entered Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the credit movement quarter to date in entered currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Movement Quarter to Date In Functional Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the credit movement quarter to date in functional currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Movement Year to Date In Entered Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the credit movement year to date in entered currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Movement Year to Date In Functional Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the credit movement year to date in functional currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Debit Movement Month to Date In Entered Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the debit movement month to date in entered currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Debit Movement Month to Date In Functional Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the debit movement month to date in functional currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Debit Movement Quarter to Date In Entered Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the debit movement quarter to date in entered currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Debit Movement Quarter to Date In Functional Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the debit movement quarter to date in functional currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Debit Movement Year to Date In Entered Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the debit movement year to date in entered currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Debit Movement Year to Date In Functional Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the debit movement year to date in functional currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Date",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the effective date of the account or contract or interest rate or exchange rate from which it is effective.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "General Ledger Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the general ledger type of the GL account code. Indicative values LOS Loss, GNS Gains, EXP Expense, REV Revenue, OWNEQ Owners Equity, LIAB Liability, AST Asset, ALL . General Ledger Account Dimension is the equivalent dimension of this attribute.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "ISO Currency Code",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Currency",
                    "gcd": "ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Local Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to a unique ISO code representing a particular local currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Management Ledger Code Combination Identifier",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Numeric_Long",
                    "gcd": "Refers to the management ledger chart of accounts code combination identifier.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Processing Run Identifier",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the processing area run identifier. This attribute should be part of result area or integration entities used for publishing processed data from specific service to result area.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Run Identifier",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the run identifier for a set of Records participating in the particular Run with the Run Execution identifier. This is a combination of Run Main Identifier and Run Execution Identifier.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Version Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number used for versioning computed or processed data.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [],
            "useCases": []
        }
    ]
}