{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "ATM Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the ATM expense, typically based on number of ATM transactions multiply with unit cost.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Classification Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to classification code of the account. The list of values of account classification can be Fair Value, Amortized Cost, Available for Sale, Held till Maturity etc. Account Classification Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Close Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the account is closed. Account can be an active or closed, this column will remain blank till account is active. Accounts can be closed upon maturity, transfer or death of a customer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Customer Net Revenue",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to total revenue less the loss or expenses and taxes incurred for that account at customer level. \nIn case of Investments, Leases, Merchant Cards, Options, Swaps and Trusts: It is the sum of Total Commitment Amount Plus Fee Amount Plus Communication Charges Plus Other Charges Plus Other Party Charges Minus Allocated Cost.\nIn case of Casa, Cards, OD, TD, LC and Commitment contracts: Interest earned + Fees + Charges + Commission, Interest rate paid + Expenses.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Display Name",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description",
                    "gcd": "Refers to account name which should be displayed in the account. This is often the name of the primary customer on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Group Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the account group to which this account is assigned. Account group is a grouping of accounts based on certain criteria. Examples of account group types include household, statement bundling etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Officer Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to unique identifier assigned to the account officer. Account officer may receive and pay out money and assist customers with loans, foreign currency exchange and investments, He will be involved in identifying customer needs and refer customers to appropriate banking services and specialists.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Or Contract Number",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of the account or contract held by the customer. Account number is defined as numbers, letters or alphanumeric code assigned to every significant customer, supplier and lender for ease of reference in accounting records of the financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Outstanding Cash Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount outstanding priced at cash advance APR at the end of the cycle. At the end refers to the balance as of statement date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the status of the account. List of values can be Active, Inactive, in foreclosure, Re negotiated, Dispute, Frozen, Past Due, Closed etc. Account Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Status Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the current account status became effective.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Sub Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Account Sub Type Code that is sub classified as per the banking source system for their internal operational purpose.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Account Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Account Type Code that is classified as per the banking source system for their internal operational purpose. \nIn case of ALM FTP applications, Account type are fixed set of values.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accounting Standard Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the accounting standard or the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. E.g. GAAP, IFRS etc. Generally Accepted Accounting Principles, GAAP. GAAP are the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. The Generally Accepted Accounting Principles exist to ensure that accountants are using the same or almost the same standards so that comparison of financial statements between or within a company is easy and accurate. They also promote transparency in accounting. However, GAAP provides broad guidelines, there is room for companies to follow an approach within a guideline.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accrued Gross Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the accrued gross amount computed for the period last payment date of interest and As of Date and is used for determining Exposure At Default.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accrued Transfer Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the accrued transfer amount computed for the period last payment date of interest and As of Date and is used for determining Exposure At Default.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Acquisition Channel Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the channel through which customer was acquired.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjustment Effective Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the adjustment Effective Date for determining the reference date for the IRC rate lookup.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjustment Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier for adjustment type dimension at an account. Examples can be CONTRA,NEW etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Advice Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of written confirmation received on the account, for example debit, credit or payment etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Agent Bank Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the an organization defined code for the agent organization associated with the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amortization Method For Premium Discount And Fees Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the amortization method used for premium, discount and fees. Indicative values are STRAIGHTLINE or LEVELYIELD, LEVELYIELD being the default one.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Amount Due In Next Twelve Months",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Amount Due In Next 12 Months.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Annual Fee Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of an organization defined code for the annual fee amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Annual Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the period fee amount. Generally most cards pay annual renewal fee. So this will in that case become annual fee amount. This fees can be charged by some providers to pay for costs of maintaining account of the merchant.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Application Analyst Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the identifier of the person who analyzed the application.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Application Final Score",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the final score of the application.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Application Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the application number that was filled by the customer that formed the basis for the contract. Application is a document that provides the essential financial and other information about the borrower on which the lender bases the decision to lend.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Application Override Reason Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the organization defined code for the reason application score of the account was overridden.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Application Score",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the current score of the application.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "As Of Date",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Attrition Reason Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the reason code for which customer has canceled the contract or the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Authorization Device Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the type of authorization device used in merchant card processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Authorization Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total organization cost for authorizations on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Authorization Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of authorization fees charged to the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Available Limit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the available limit is the limit available to customer to carry out purchase transaction or originate additional loans, this limit is reduced by the amount of loans that are originated using the credit cards and any other outstanding payment on purchase transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Gross Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the average book balance for the latest month. The book balance is the term financial institutions use to describe the amount of money available before any adjustments have been made for deposits in transit, checks that have not yet been cleared, reserve requirements and interest received from 'float funds' hence is generally greater than end of period balance, Also called as 'gross balance'.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Net Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the average net book balance for latest month. Book balance includes deferred expense or income on that account and hence is generally greater than the EOP balance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Ticket Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to average ticket amount of the account in the current update period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bank Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code or identifier of the financial institution which owns the transaction, assigned by the central bank. Bank identifier can be one of the following identifier or code: BIC Code, Bank Identifier Codes, ABA Code, Routing transfer number, IFSC Code, Indian Financial System Code, BCHH etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Batch Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total organization cost for processing the account as part of a batch.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Batch Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the batch fee, also known as a batch header fee, can be charged to a merchant whenever the merchant 'settles' their terminal. Settling a terminal, also known as 'batching', is when a merchant sends their completed transactions for the day to their acquiring bank for payment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Behavior Score",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the behavior score. This is defined in multiple ways. For example  Behavioral Credit Scoring denotes a credit scoring system for existing clients, as opposed to new clients. Also it can be defined as a score which is an internal, proprietary scoring system used by some credit card issuers to supplement the credit scores they purchase from credit bureaus.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Billing Method Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the method used to bill the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bonus Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the usage bonus amount of the account. Amount of bonus applicable in case of bonus forward. If at expiry, the market rate is at or above the Protected Rate, you are obliged to buy currency at the Protected Rate. However if the market is below the Protected Rate, you can receive a “Bonus Rate” unless the market trades at or below a pre agreed “Limit Rate”.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Branch Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the branch code. A branch, banking center or financial center is a retail location where a financial institution offers a wide array of face to face and automated services to its customers. This column Refers to the unique branch code assigned by the financial institution. A branch may specialize to offer certain type of products to customers. Branch needs approval from the regulators.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Branch Platform Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the fixed cost per product or number of transactions multiply with unit cost.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Branch Teller Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Branch Teller Expense is typically based on the number of teller transactions multiply with unit cost.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Domain",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of the business domain., such as Institutional or Retail Brokerage. This is used to control access to data across distinct business operations.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Risk",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the level of risk associated with this account with respect to business characteristics. List of values are in the range of 0 10 with increasing values denoting increasing risk levels.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Calculation Option Display Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the choice between Just shifting the dates for holiday calendar and recalculating the payments based on the new dates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Call Center Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the call center expense, typically based on number of calls multiply with unit cost.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Campaign Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the campaign under which the account was acquired. Campaign is defined as Specific activities designed to promote a product, service or business. A marketing campaign is a coordinated series of steps that can include promotion of a product through different mediums like television, radio, print, online using a variety of different types of advertisements. The campaign doesn't have to rely solely on advertising, and can also include demonstrations, word of mouth and other interactive techniques. Campaigns are created or started by financial institutions to promote sales, improve visibility of the brand or product and create opportunities for addon sales and cross selling.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Card Renewal Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the credit card was renewed. Credit card expiration dates are placed on credit cards for normal wear and tear. The magnetic strip on the card can become worn and plastic can break. After a certain amount of time, your credit card company will send you out a new card. Other reasons for expiration dates include consumer security, opportunities for marketing and a plateau where the terms of the credit card can be re evaluated based on credit worthiness. This column will store the date on which the same account is renewed and new card is provided.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cash Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the Interest Rate for Accrual of Cash Advance Balance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Charge Back Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total organization cost of chargeback on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Charge Back Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Chargeback fee charged to the account, If a merchant encounters a chargeback they may be assessed a fee by their acquiring bank. A potential chargeback is presented on behalf of bank of the card holder to the credit card processing bank of the merchant. A reason code is established by the card issuer to properly identify the type of potential chargeback based on the complaint of the card holder.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Charge Off Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the charge off amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Charge Off Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which obligation due was charged off, written off, from the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Charge Off Reason Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the charge off reason code. A charge off or charge off is the declaration by a creditor, usually a credit card account, that an amount of debt is unlikely to be collected. This occurs when a consumer becomes defaults on a debt. Traditionally, creditors will make this declaration at the point of six months without payment. List of values include delinquent, fraud customer etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Common Chart Of Account Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the chart of accounts is a listing of the names of the accounts that a financial institution has identified and made available for recording transactions in its general ledger. A financial institution has the flexibility to define its chart of accounts as per requirement, including adding accounts as needed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contribution After Capital Change",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the contribution after capital charge. This is typically calculated as Allocated Equity multiply with hurdle rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Correction Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of correction fees charged to the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Corrections Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total organization cost of corrections on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Country Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the country code associated with the account or instrument or party or location. There are several popular country codes as part of ISO 3166 standard published by the International Organization for Standardization. ISO 3166 defines codes for the names of countries, dependent territories, special areas of geographical interest and their principal subdivisions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Balance Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the interest rate applicable for credit balances on that account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Score",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the credit score of the customer. In case of retail customers, this can be FICO score. A credit score is commonly used by financial institutions to assess the credit worthiness of a prospect or customer. Generally a customer with a higher credit score gets better terms in terms of interest rates, repayment schedule etc. In case score is reported at account granularity then it will store the credit score of the primary customer associated with the account.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Credit Score Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date from when the credit score is valid. Credit Score is a statistically derived numeric expression of creditworthiness of person that is used by lenders to access the likelihood that a person will repay his or her debts. A credit score is based on, among other things, past credit history of a person.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Credit Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the current performance status of the account. List of values are Delinquent, Foreclosed, Impaired, Closed, Disposed, Transferred, Bankrupt etc. Credit Status Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Credit Limit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the current credit limit allowed for the account. This could vary from the original sanctioned limit depending upon whether the account has been downgraded or upgraded. The maximum amount for which a particular borrower is approved is known as the credit limit.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Deferred Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to deferred current balance refers to Current un amortized deferred balance representing future income or expense such as premium or discount. Deferred Current Balance holds the discount or premium associated with an instrument. A discount loan or instrument is one with interest deducted from the face value of the loan at its origination. The discount amount is the difference between the loans current market price and its stated par value. The deferred current balance, which represents income, will be amortized over the life of the instrument according to a constant yield calculation. Therefore, as the instrument approaches maturity, the book balance approaches the face value or par balance. For discounted instruments, the deferred current balance is a negative balance. This indicates to the cash flow engine that the balance is income.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Deferred Premium Or Discount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the current Deferred Premium or Discount refers to Current non amortized deferred balance representing future income or expense such as premium or discount. Deferred Current Balance holds the discount or premium associated with an instrument. A discount loan or instrument is one with interest deducted from the face value of the loan at its origination. The discount amount is the difference between the loans current market price and its stated par value. The deferred current balance, which represents income, will be amortized over the life of the instrument according to a constant yield calculation. Therefore, as the instrument approaches maturity, the book balance approaches the face value or par balance. For discounted instruments, the deferred current balance is a negative balance. This indicates to the cash flow engine that the balance is income.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of fees accrued and outstanding for the current reporting period. Current fees may include over the limit fees, wire transfer fees, cheque book issued, bankers draft etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Gross Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the current gross book balance. Current gross book balance is the sum of total of End of Period Balance + Deferred Balance, represented as a negative amount to depict the unamortized portion. This is used while calculating amortization. The book balance is the term financial institutions use to describe the amount of money available before any adjustments have been made for deposits in transit, checks that have not yet been cleared, reserve requirements and interest received from float funds hence is generally greater than end of period balance, Also called as gross balance.\nIt also excludes any deferred balance that is unamortized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Gross Yield",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the current gross yield on the investment. Gross yield is defined as the yield on an investment before the deduction of taxes and expenses. Gross yield is expressed in percentage terms. Current yield is calculated as interest received plus total fees and charges, all are annual, divided by the principal.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to current annualized gross rate of an account. This rate would be different in case of a consortium funding. When conventionally amortizing a records balance with the Model with Gross Rates option selected, the cash flow engine uses the current gross rate as the customer rate. If the option is not selected, then the cash flow engine uses current net rate as the customer rate for amortization calculation. Also to determine the prepayment rate, the current customer rate must be compared to the market rate. If the Model with Gross Rates option is selected, then the customer rate is represented by the current gross rate. If the Model with Gross Rates option is not selected, the current net rate is used as the current customer rate. When this is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Net Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Long",
                    "gcd": "Refers to the current interest rate or Current nominal interest rate is used to derive the interest cash flow, income or expense, that is due to the financial institution, referred to as net. All term accounts require a valid current interest rate. For non interest earning or bearing accounts, current interest rate equal to 0. For transaction accounts where the rate changes daily based upon average balances, current interest rate should be the spot rate at the time the extract program is run. For interest bearing accounts, current interest rate is greater than or equal to 0.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Over All Stochastic",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the average spread over all stochastic rate paths that equate the discounted sum of future cash flows to the target balance at the As Of Date, computed by the TP engine.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Payment Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the current period payment made. Current Payment is the installment amount received from the customer. Current payment in the case of asset products represents the current periodic payment made to repay the outstanding balance. For standard amortization types, those that are not non patterned and non scheduled, Transfer Pricing Application, remaining term methods, uses the current payment from the detail record for the life of the record until a payment recalculation occurs. This will same as maturity amount in case of repo contracts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Static Spread",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the Static spread, as calculated from the as of date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Transfer Pricing Period Average Daily Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to average Daily Balance for Current Transfer Pricing Repricing Period  used in selected TP or FTP methods  with Mid Period Repricing option. When processing with the mid period repricing option, Transfer Pricing application references CUR_TP_PER_ADB as the average daily balance at the time of the last repricing event. This field is used in conjunction with the PRIOR_TP_PER_ADB field. If the last reprice date occurred during the processing period, the rate that would be applied would be the repriced rate on the balance held by the customer, instead a weighted average is calculated individually on balance prior to reprice and balance after reprice.\nExample: if the data extracted is for the month of Dec 2012, and the interest rate has been repriced on 15 Dec 2012, a normal scenario would require the repriced rate on the entire end of period balance, instead the FTP engine calculates a weighted average of both the rates to arrive at a weighted average rate to be applied.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Customer Information File Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the original CIF key for the account from the source Customer Information File system.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Customer Service Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the customer service fee can be charged by some providers to pay for the cost of customer service. Also referred to as a maintenance fee, merchant support fee, customer support fee, or simply service fee by some merchant providers.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cycle Day Of The Month",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the Day of the month on which account is cycled, processed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Jurisdiction",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the mantas classification associated with this record. This can be a jurisdiction which represents geographical or legal entity monitoring on data restrictions. Values can be AMEA, INDV, CORP etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Processing Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the data processing expense. This is typically based on the number of transactions. It is calculated by multiplying the number of transactions with unit cost.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source system from where data is extracted. Data can be sourced from multiple sources, this column will Refers to the source code from where the data is extracted for this extraction date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Day Count Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the day count indicator. Expected values are A/360, A/365, A/A, 30/360, 30/360 EUROPEAN, 30/A. Suggested default value are 1=30/360 for amortizing transactions OR 3=Act/Act. for non amortization.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Deferred Costs",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the deferred financing costs or debt issuance costs is an accounting concept meaning costs associated with debt issuing process, such as various fees and commissions paid to investment banks, law firms, auditors, regulators, and so on.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Deferred Fees Unamortized Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the current deferred fees amount, reflecting the unamortized portion. Fees that are amortized through the life of the loan such as Closing Fees or Amendment Fees.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delinquency Days",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of days the account has remained delinquent in the current delinquency period. The account could have been delinquent a number of time earlier, but Refers to the current delinquency days.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delinquency Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Captures the unique identifier of delinquency status. Indicative values are Charge off, Redeemed, Doubtful, Bad Debt, Sub Standard, Non Performing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delinquent Life Times",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of times the account has been delinquent on installment payment during the life of the account. An account can be in and out of delinquency a number of times during its life.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Delinquent Year Times",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "It Refers to the number of times the account has been delinquent on installment payment during a year of the account. An account can be in and out of delinquency a number of times during its life. Any account which is past due is a delinquent account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Deposit Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the organization defined code for the type of deposit to the account, for example check or cash.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discount Margin",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Discount Margin is average expected return earned over a given reference rate, that is additional to given reference rate, for a floating rate security. Column is applicable for instruments like Floating Rate Note. Refers to the margin or spread that must be added to discount rate obtained from interest rate curve to get the final discount rate that is used to calculate present value of an instrument. This is an optional input and is specified as a rate or price, see Discount Rate Margin Type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discount Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the discount rate that is applied to a future value of a bill. If a bill has to be discounted, the negotiating bank or confirming bank would have to accept the documents submitted by the exporter. This is used to calculated price or yield of T bill. It is not required if market Price or Bond Equivalent Yield has been given.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discount Rate Margin Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Indicates the form in which Discount Margin is given. Indicative Values are RATE, Rate Spread, PRICE, Price of instrument per 100. When it is given as PRICE then engine solves it to obtain a rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discounted Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of Discounted fees for the service.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Early Termination Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the early termination fee that can be charged by some providers if the merchant ends the contract before the end of the contract term.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Interest Rate Effective Initial Spread Calculation Instruction Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether EIR, Effective Interest Rate, or EIS, Effective Initial Spread Calculation, needs to be calculated by the application. This can also be interpreted as 'New account Flag' as well. The application would compute based on the input. If the flag is Blank and there are no value given as download, then application will look for rates in inception rate table. If found it will be used else it will be calculated by application and flag will be updated as A.\nIf the flag is Y, then application would update the inception rate table with the calculated new EIR or EIS corresponding to latest ACCOUNT START DATE. This value would be picked for the successive RUN.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Interest Rate For Hedge Management",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Medium",
                    "gcd": "Refers to the effective interest rate of the instrument for Hedge Management application.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Effective Maturity Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the effective maturity date of the contract. Effective maturity takes into account that certain instruments like bonds have a callable feature which can likely shorten the maturity of these instruments.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Electronic Banking Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the electronic banking expense, typically based on number of electronic transactions multiply with unit cost.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Embedded Options Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the security has an embedded option within it. Embedded option refers to a provision in a security that is an inseparable part of the instrument. An embedded option is a special condition attached to a security, and in particular, a bond that gives the holder or the issuer the right to perform a specified action at some point in the future. An embedded option is part of another security, and as such does not trade by itself. Nevertheless, it can affect the value of the security of which it is a component. A security is not limited to one embedded option, as there may be several embedded options in one security.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to end of period balance which includes accrued interest. All the calculations such as interest, prepayment amounts etc. are based on this amount. This is used in all the calculations performed by cash flow engine. In Case of LC Contracts, EOP Balance should be populated when LC Is executed. Till LC is executed, LC amount sanctioned should be hold in Total Commitment Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Equity Credit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the equity credit for the account. This is calculated as the product of allocated equity and the equity credit rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Expiration Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the expiration date of the account or contract. Expiration date is defined as a date after which the account or contract is no longer in effect.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Exposure Held At Fair Value Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the exposure is held at fair value. Fair value is applicable to exposures involving less liquid and physical assets. In case of actively traded instruments, the market value is the fair value. This is in the context of Financial Accounting standards board.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fatca Pool Report Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the FATCA Pool Report Code. List of values are FATCA201  Recalcitrant account holders with US Indicia, FATCA202  Recalcitrant account holders without US Indicia, FATCA203  Dormant Accounts, FATCA204  Non participating foreign financial institutions, FATCA205  Recalcitrant account holders that are US persons and FATCA206  Recalcitrant account holders that are passive Non Financial Foreign Entities.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fatca Reporting Period End Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the FATCA reporting period end date. This date is the date on which the net worth is reported at the account level for FATCA purpose. This is used in conjunction with the column FATCA Reporting Period Net Worth Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fatca Reporting Period Net Worth Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the FATCA Reporting Period Net worth amount. This is the total net value of all assets associated with this account expressed in base currency as of the end of the last reporting period. This is the aggregate value of all holdings in this account, with a reduction for any margin loans or other debts owed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fatca Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the FATCA Status Code. List of values are INDETER  Indeterminate, RECALC  Recalcitrant, USP  US Person, NPFFI  Non Participating Foreign Financial Institution, PAS NFFE  Passive Non Financial Foreign Entity, ACT NFFE  Active Non Financial Foreign Entity, PFFI  Participating Foreign Financial Institution, EXC NFFE  Excepted Non Financial Foreign Entity, OWNER.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fee Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the fees charged or paid by the Financial Institution in originating or acquiring the given instrument or account. Incase of investments, It Refers to the fee receivable i.e. current fee which has been assessed internally but not yet due to be charged for the account. It is used to calculate the Amortized Cost. If Amortized cost is not sourced in the Investments table, then it is derived from EOP balance + Current Deferred Premium Or Discount  Accrued interest  Fees  Deferred Fees Unamortized Amount. In case of bills, it refers to the fees charged by the financial institution in purchasing the bill and paying the amount to the exporter.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fee Charge Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which fee was charged on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fee General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds fee amount. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fees For Effective Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the consolidated current un amortized, portion of the, fees which is or are applicable for, or are integral part of, Effective Interest Rate computation as per IFRS 9. This value will be used within the Cash Flow Engine.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Finance Charge Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the balance on which finance charge was calculated. Finance charge is a fee charged for the use of credit or the extension of existing credit. May be a flat fee or a percentage of borrowings, with percentage based finance charges being the most common. A finance charge is often an aggregated cost, including the cost of the carrying the debt itself along with any related transaction fees, account maintenance fees or late fees charged by the lender.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fixed Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total organization cost for fixed expenses for the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Float Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total organization cost for float expenses on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Float Management Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of float fees charged to the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "General Ledger Account Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique general ledger account code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Geography Risk",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the level of geographical risk associated with this account. List of values are in the range of 0 10 with increasing values denoting increasing risk levels.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Gross Fee Income",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the fee income of the financial institution before offering any waivers. Fee income is charged for service rendered by financial institutions. Components that generate fee income include annual fee, over the limit fees, wire transfer fees, cheque book issued, bankers draft etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Gross Margin",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to contractual spread above or below pricing index applied to CUR_GROSS_RATE. However, cur_net_rate and cur_gross_rate would be different only in case of consortium funding. Otherwise, it would be the same. This is applicable for floating rate accounts, which are typically funded by a consortium. The current net rate = Applicable rate from the IRC Plus margin. This is used along with Current Gross Rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Hedge Portfolio Set Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique hedge portfolio set code or Hedge identification number, hedge ID, under which this account is covered.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holiday Display Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holiday calendar code as per the holiday calendar defined through the UI.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holiday Rolling Convention Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holiday rolling convention code, based on which the date on which cash flow has to happen is decided. This includes  Following business day, Modified following business day, Previous business day, Modified previous business day etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "ISO Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Imprint Machine Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total organization cost for imprint machines for the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Initial Fees For IFRS Nine Effective Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the consolidated initial, un amortized, fees which is or are applicable for, or are integral part of, Effective Interest Rate computation as per IFRS 9. This value will be used to compute the Effective Interest rate as of account inception date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of instrument type, which is defined as code identifying the instrument category of the customer account. Instrument Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interchange Discount Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total organization cost for interchange discounts on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interchange Expense Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total organization cost for interchange discounts on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Accrued Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the accrued interest amount associated with the contract. This is the interest that has accumulated on an instrument since the last interest payment up to, but not including, the settlement date. Accrued Interest is defined as Interest earned but not received, realized. For example, bonds usually pay interest every six months, therefore interest accrues between one interest payment and the next. The buyer of a bond pays its market value plus the interest earned up to the settlement date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Calculation Method",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the method of computing interest. Expected values are Simple and Compounded.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Income",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the interest income earned from the account by the financial institution for the period. Interest income is calculated as the sum of the interest component of the payments received from customers. This does not include other fees or revenues such as processing revenue, maintenance fee etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the interest rate code that identifies the index to which adjustable rate accounts are tied. Transfer Pricing references interest rate code when calculating option costs and uses the relevant interest rate from the defined interest rate code, IRC, together with the margin to determine the reprice rate for the instrument. The value populated in this column for each account record must be synchronized with the actual interest rate code values defined in Transfer Pricing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Margin Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of Margin. Margin can be provided as Rate or Percentage. If provided as Rate then current net rate is Applicable rate from the IRC plus margin. If Percentage, Margin is calculated using IRC and Margin provided as percent. If it is Rate and input is 2 percent, then 2 needs to be provided in spread or margin column. If it is Percent and input is 5 percent of IRC, then 5 needs to be provided in spread or margin column. This column has been added to support Tiered Balance Interest Rates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the type of interest rate paid on this transaction., For instance Fixed Or Floating.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Internal Customer Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the customer is an internal customer. This identifies if the contract is between one of the financial institutions subsidiaries. This is used in capital consolidation. The List of values are Y, N or NULL.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "International Banking Facility Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account or transaction is belongs to an international banking facility. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "International Interchange Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total organization cost for international interchange charges on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Investor Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the investor number for accounts that have been securitized or has been offered as part of syndicate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Item Processing Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the item processing expense. This is typically a set expense for the type or item. Processing expenses are usually the expenses associated with creating or opening an account or contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Joint Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the account is jointly held by two or more individuals which means if the value is updated as Y the account is held by two or more people and if the value is updated as N the account is held by single entity.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Largest Outstanding Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Largest balance borrowed historically on this card.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Credit Line Change Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the immediate past date on which the credit line was changed on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Payment Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of the last payment made by the customer on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Rejected Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the immediate past date on which the proposal to increase credit line was rejected.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Reprice Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the adjustable instruments last repriced or the date on which the current interest rate changed. For a repo contract this will generally be same as origination date. For an adjustable rate straight term transfer priced record, Transfer Pricing uses the Last reprice date to identify the assignment date, Yield Curve Date. The assignment date of the Interest Rate Code just before, or equal to, the last reprice date of the record is used as the transfer pricing yield curve. For example, if the last reprice date of the record is 15th Jan 2006 and the Historical Rate interest rate code, IRC, is defined at monthly intervals and only at month end, the assignment date would be 31st Dec 2005. The reprice frequency is then matched to the same term on the transfer pricing yield curve, IRC, defined in the Historical Rates in Transfer Pricing. For fixed rate records, the last reprice date and next reprice date are not referenced. Origination date and maturity dates are used instead. This column has been added to support Tiered Balance Interest Rates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Statement Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the immediate past date on which the last account statement was generated on this account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Transaction Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the last transaction was recorded on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Legal Entity Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the entity code of the legal entity to which the account will be attributed in the general ledger.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Line Of Business Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to line of business, LOB, is a functional unit that offers the products to the customer by the financial entity. Example: Corporate Finance, Trade Services, Private Wealth Management, Treasury Services, Retail Banking, Cards services etc. Refers to the unique code of the line of business applicable to the respective product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Loss Provision",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the loan loss provision amount for the account. This is an expense set aside as an allowance for bad or doubtful loans. This is calculated as the product of average balance and the product specific loan loss provision percent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Loss Reserve",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the loan loss reserve amount for the account. This is an expense set aside as an allowance for bad or doubtful loans. This is calculated as the product of average balance and the product specific loan reserve percent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mantas Account Holder Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Mantas defined internal or external customer type that uses this account. This will be used for identifying Mantas defined customer types relevant to financial crime compliance based on set of rules. Expected values are  CR - Retail Customer CI - Institutional Customer IA - Investment Advisor CO - Correspondent Financial Institution EE - Employee or Family Member FP - Firm Trading FO - Firm Owned, Non-Trading FA - Firm Administrative FE - Firm Error or Suspense DC - Clearing Organization IS - Issuer or Writer.\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Manual Interchange Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total organization cost for manual interchange charges on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Manual Intrachange Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total organization cost for manual intrachange charges on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margin Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the margin is the contractual spread that is added to the pricing index and results in the financial institutions retention, net, rate, for adjustable rate accounts. It is used as current net rate = Applicable rate from the Interest Rate Curve Plus margin. The gross rate, CUR_GROSS_RATE, is equal to the index to which the record is tied to plus a spread, which is defined by the MARGIN_GROSS field.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Segment Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the code of the market segment to which the customer belongs.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mater Card Merchant Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to identify if the merchant is a MasterCard merchant.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mater Card Transaction Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to identify if the merchant accepts MasterCard transactions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maturity Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the contractual date on which the principal balance is expected to fully amortize and the balance payable would be nil. This is applicable for term loan products but not for revolving credit or overdraft type of account. In case of insurance policy, for some whole life insurance products the maturity date is aligned to maximum attained age and the policy is payable upon the earlier of the maturity date or the death of the insured. In case of Term Life insurance policies the maturity date is determined as policy issue date plus Term of the contract. In case of an annuity it is the date from which the annuitant has chosen to take the payouts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Member Dues",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the membership dues of the account for the current update period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Membership Anniversary Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the anniversary date of the membership.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Membership Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total organization cost for the accounts membership.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Merchandise Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Current outstanding merchandise balance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Merchandise Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the Interest rate for accrual of merchandise balance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Merchant Chain Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the organization defined codes for the chain that the merchant belongs to.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Merchant Charges",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the merchant charges for the current update period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Merchant Class Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the organizations classification of the merchant.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Merchant System Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the POS, Point of Sale, device issued to the merchant.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Minimum Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the monthly minimum fee is a way to ensure that merchants pay a minimum amount in fees each month to cover costs from the provider to maintain the account. If a merchants fees do not equal or exceed the monthly minimum they will be charged the difference up to the monthly minimum.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Negative Amortization Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to total amount of principal increase due to payments, which do not cover the entire interest component. This is used while calculating current payment for floating rate accounts.\nNegative amortization can occur if the installment payment is insufficient to cover the interest portion of the installment as per amortization schedule.\nNegative amortization can also result from the financial institution offering artificially reduced rate of interest contractually agreed between the financial institution and the customer over a period of time which results in accruing of interest as per market rate during the period the concessional rate is in vogue.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Negative Amortization Equalization Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the negative amortization occurs when the loan installment payment is insufficient to cover the interest portion of the installment, resulting in the residual interest amount getting capitalized to the loan amount. Date on which a negative amortization type account fully re amortizes, regardless of payment caps and floors. The Oracle Transfer Pricing adjustable type cash flow methodologies reference NEG_AMRT_EQ_DATE when calculating the current payment for negative amortization type accounts. NEG_AMRT_EQ_DATE is only relevant for adjustable rate accounts. On the NEG_AMRT_EQ_DATE, the payment for a negatively amortizing record is recalculated. On this date, the CUR_PAYMENT for the record is fully re amortized. NEG_AMRT_EQ_DATE ignores payment decrease or increase limits per period and payment decrease or increase limits for the life of the record. Therefore, after the payment recalculation of a NEG_AMRT_EQ_DATE, the record is no longer negatively amortizing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Negative Amortization Equalization Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the negative amortization equalization frequency. This is used in conjunction with Negative amortization equalization frequency unit to define the frequency that negatively amortizing accounts are fully re amortized. Negative amortization occurs when the loan installment payment is insufficient to cover the interest portion of the installment, resulting in the residual interest amount getting capitalized to the loan amount. Date on which a negative amortization type account fully re amortizes, regardless of payment caps and floors.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Negative Amortization Equalization Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the negative amortization equalization frequency unit. This is used in conjunction with Negative amortization equalization frequency to define the frequency that negatively amortizing accounts are fully re amortized. Negative amortization occurs when the loan installment payment is insufficient to cover the interest portion of the installment, resulting in the residual interest amount getting capitalized to the loan amount. Date on which a negative amortization type account fully re amortizes, regardless of payment caps and floors. List of values for the unit.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Negative Amortization Limit Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the maximum negative amortization allowed as a percentage of the original balance. Transfer Pricing applications cash flow methodologies reference NEG_AMRT_LIMIT to determine if the NEG_AMRT_AMT is exceeding its defined limits, if the negative amortization limit is exceeded, the engine recalculates current payment, cur_payment.\n\nWhile calculating a payment event, payment date, if the cash flow engine calculates negative principal runoff, the cash flow engine also checks the negative amortization limit, NEG_AMRT_LIMIT, in order to ensure that the current NEG_AMRT_AMT is not exceeding its limit. NEG_AMRT_LIMIT is defined as a percentage of the original principal balance. For example, NEG_AMRT_LIMIT = 25 means that the negative amortization amount should never exceed 25 percent of the original principal balance, principal balance should never exceed 125 percent of the original balance. The formula for this check is:\n, 1 * calculated, negative, principal runoff + negative amortization balance > NEG_AMRT_LIMIT divided by 100 * ORG_PAR_BAL,\nIf NEG_AMRT_AMT is exceeding this limit, the cash flow engine recalculates the payment amount in order to fully amortize the instrument.\nWhen deriving the recalculated payment amount after exceeding the NEG_AMRT_LIMIT, the cash flow engine also applies payment decrease or increase limits per period, PMT_DECR_CYCLE, PMT_INCR_CYCLE, and payment decrease or increase limits for the life of the record, PMT_DECR_LIFE,\nPMT_INCR_LIFE. Because these fields limit how much the CUR_PAYMENT can be changed, it is possible that the record continues to negatively amortize even after\na NEG_AMRT_LIMIT has been exceeded. If negative amortization does continue, the NEG_AMRT_AMT continues to grow.\nRefers to the maximum loan balance permitted under the negative amortization for the loan. Negative amortization is an increase in the principal balance of a loan caused by a failure to make payments that cover the interest due. The remaining amount of interest owed is added to the principal of the loan.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Net Fee Income",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to net fee income generated from an instrument and is computed as Gross Fee Income  Waived Fees. This can be NULL for a repo contract as generally no fee applicable.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Net Interest Margin",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the net interest margin. The net interest margin is a measure of the difference between the interest income generated and the interest expense or funding expense. This is typically calculated as Transfer Charge or Credit + Interest Income or Expense  Loan Loss Provision.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Net Margin Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the net margin. This defines the relationship between current gross rate and current net rate. The values for net margin code are Floating Net Rate, NET_MARGIN_CD = 0, Fixed Net Rate, NET_MARGIN_CD = 1. The default value for net margin code is 0. The account will reprice at relevant reprice dates as described by next reprice date value. The value of Net_Margin_Cd=1 is used by financial institutions that maintain the loans of other financial institutions. For example, Bank A may service, operate and process, the loans of Bank B. Bank B pays Bank A fixed spread or margin as payment for maintaining the loans. Because Bank A receives a guaranteed fixed spread, only Bank B gains or loses when the actual loan reprices. For this reason, if the record reprices, Bank A should not experience any change in interest income.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Next Payment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the Due date of the next scheduled payment. Otherwise known as cash flow date or date of runoff. Otherwise known as cash flow date or date of runoff. NEXT PAYMENT DATE is used to define the next scheduled, forecasted, payment date. If REMAINING NO PAYMENTS > 1, NEXT PAYMENT DATE < MATURITY DATE, If REMAINING NUMBER OF PAYMENTS = 1, NEXT PAYMENT DATE = MATURITY DATE. If next payment date is unknown, set to either: CALENDAR PERIOD + PMT FREQ, or MATURITY DATE.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Next Reprice Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which interest rate will be reprice for the instrument. It is applicable for adjustable rate accounts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Non Performing Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the non performing type. Performing or Non performing Types are Performing, Substandard, Doubtful, Loss etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notification Letter Suppression Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether the account information change letter has been suppressed for this account means the customer does not want to receive notification for the changes done on the account. If the Y, then the customer should not be notified of changes to account information such as address or phone number and if the value is N means the customer should be notified of any changes on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Number Of Float Days Year Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the Number of float days for year to date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Number Of Return Items",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of return items. This is an informational column to convey the number of returned cheques in the reporting period. This is used for allocation of cost to determine charged fees or waived fees. There are several reasons why cheques can return. Common reasons are  Insufficient balance in the account to clear or honor the cheque, Drawer Signature illegible, Stop payment by drawer, Instrument mutilated etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Offer Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the offer. An offer is defined as an abstract, physical and or monetary benefit attached to a product for a predetermined period of time with a view to increase the sales of a product. Offer dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Open Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Indicates if the account is open. Accounts are in open status for all active accounts and accounts in dormant state. Account is considered to be closed if the account has reached maturity date with Nil end of period balance or if the customer has prematurely closed the account in the case of fixed term accounts or has notified in writing for closure of the account in the case of CASA or Overdraft account. \nA CASA or OD type of account can have a Nil end of period balance and still be open.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Organization Unit Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the cost center to which the account belongs to. Organization Unit dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the original account number held by the source system. If there are multiple source systems without unique account numbers, we expect the account number and source system to be concatenated as part of the primary key, while this column will store the original account number as generated by the source system.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Original Credit Line",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the credit limit sanctioned for the account at the time of origination.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Deferred Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the original non amortized income or expense, such as premiums discounts, fees, charges but it does not includes deferred cost incurred by bank which is not directly associated at account level. Unamortized income or expense are the unrealized income or expense on the account and would begin to accrue after issue of the security. The discounted bonds are sold at a price lower than the par value and would amortize to mature at par. Likewise, the premium bonds are sold at a premium over the par value of the bond as it may be offering a higher coupon rate compared to market. The premium paid is amortized over the period to mature at par value on the maturity date. Commitment contracts charge a commitment fee, which is amortized over a period based on the drawdown from the commitment contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Deferred Premium Or Discount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the original premium or discount which is the original non amortized income or expense, such as premiums or discounts. Unamortized income or expense are the unrealized on the account and would begin to accrue after issue of the security. The discounted bonds sells at a price lower than the par value and would amortize to mature at par. Likewise, the premium bond sells at premium over the par value of the bond as it may be offering a higher coupon rate compared to market. The premium paid amortizes over the period to mature at par value on the maturity date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Gross Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the book balance at the time of origination. Original gross book balance is the sum total of End of Period Balance Plus Deferred Balance, represented as a negative amount to depict the unamortized portion. This is used while calculating amortization. The book balance is the term financial institutions use to describe the amount of money available before any adjustments have been made for deposits in transit, checks that have not yet been cleared, reserve requirements and interest received from 'float funds' hence is generally greater than end of period balance, Also called as 'gross balance'.\nIt also excludes any deferred balance that is unamortized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Gross Par Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the par balance at the time of origination. Original par balance represents the starting balance from which all fixed rate transfer pricing cash flows are generated, including principal run off, prepayments, and interest cash flows. ORG_PAR_BAL = ORG_BOOK_BAL  DEFERRED_ORG_BAL .",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to contractual interest rate at origination date whereas the interest rate field would store the interest rate applicable to the instrument as on As of Date. This is used for computing Effective Interest Rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Net Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the original net book value  net of participations. Percent Sold is a column used to calculate net balance when the instrument is partially participated out to another financial institution. In the case of a participated loan, the bank partially owns the loan. A bank would participate out the balance of the loan to another financial institution if it was not able to lend the entire amount or if lending the entire amount would exceed the banks legal lending limits. By selling most of the financing to another financial institution, the bank would earn fee income from servicing the loan and would be able to retain other banking relationships, such as checking accounts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Net Par Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the par value net of participations at date of origination. Percent Sold is a column used to calculate net balance when the instrument is partially participated out to another financial institution. In the case of a participated loan the bank partially owns the loan. A bank would participate out the balance of the loan to another financial institution if it was not able to lend the entire amount or if lending the entire amount would exceed the banks legal lending limits. By selling most of the financing to another financial institution the bank would earn fee income from servicing the loan and would be able to retain other banking relationships such as checking accounts. In case of accounts with tiered interest rate this amount is required for each tiered separately.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Next Payment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Store the next payment date is the due date of the next scheduled payment. Otherwise known as cash flow date or date of runoff. Original next payment date Refers to the next payment date from the account start date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Origination Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the Date on which current institution originated or acquired the instrument. For rolled instruments the greater of date last rolled or date acquired.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Other Account Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the other account expenses. This is a catch all bucket to capture all the miscellaneous expenses for which no specific head exists.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Other Processing Expense",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the other account expenses. This is a catch all bucket to capture all the miscellaneous expenses for which no specific head exists.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Over Limit Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the over limit balance in the account. When cardholders attempt to make purchases that will put them over limit, card issuers used to routinely decline the transactions. In recent years, many card issuers changed their policies and automatically enrolled consumers in programs that allowed the transaction, but then added hefty fees. This column will store the balance which has crossed the limit and would entitled for the over limit fees.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Over Limit Current Cycle",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "The number of times the account has been over the credit limit in the current billing cycle.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Over Limit Life Time",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of times account was over credit limit throughout life of account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Ownership Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the organization defined code for the ownership type of the account. Expected values are IND  Individual, JOINT  Joint Tenant or Community Property, TRUST  Trust, CUST  Custodian, CORP  Corporate, FIRM  Firm Owned and OTHER  Other.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Partner Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code to identify a partner. Partners assist in origination of accounts. Partner dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Party Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier for the party. Party is defined as an entity or a person who takes part or is involved in an agreement, lawsuit, or transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Pay Ahead Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the organization defined code indicating the time period the account is paid ahead.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Adjustment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date of next payment adjustment on an adjustable rate instrument, in case of negative amortization type of accounts. This attribute is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment. Date of next payment adjustment for adjustable rate, negative amortization type accounts. Transfer Pricing cash flow methodologies reference Payment Adjust Date when processing and calculating the current payment for negative amortization type accounts. This is only relevant for adjustable rate accounts where account is negatively amortizing. The cash flow engine recalculates negatively amortizing payment amounts on a Payment Adjust Date. Just like a payment recalculation for a Negative Amortization Limit, a payment recalculation on the Payment Adjust Date takes into account the effects of payment decrease or increase limits per period and payment decrease or increase limits for the life of the record. This allows for additional negative amortization to occur even after the Payment Adjust Date has recalculated the payment amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Change Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the frequency at which the payment adjusts. This is used to compute current payment for negatively amortized accounts and is not applicable for fixed term accounts. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Change Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the units D days or M months or Y years of Pmt_chg_freq. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Decrease Cycle",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum payment decrease allowed during the payment change cycle of an adjustable rate instrument. \nTransfer Pricing cash flow methodologies reference payment decrease cycle when recalculating the current payment for negative amortization events such as negative amortization limit, payment adjust date and payment change frequency and is relevant for negatively amortizing accounts. \nFor negative amortization type accounts, the cash flow engine uses payment decrease cycle to calculate the maximum decrease in the payment amount allowed from the previous payment change to the next.\n\nPMT_DECR_CYCLE is defined in terms of a percentage. The engine performs the following check:\nPrevious Current Payment  Newly calculated payment >, PMT_DECR_CYCLE Divided by 100 * Previous Current Payment,\nIf the newly calculated payment satisfies the above equation, the engine limits the decrease to the amount =, PMT_DECR_CYCLE * Previous Current Payment.\nFor example, if PMT_DECR_CYCLE = 5.00, the calculated current payment is not allowed to decrease by more than 5 Percent of the previous current payment. If PMT_DECR_CYCLE = 0, the cash flow engine assumes that there is no payment decrease limit per payment change period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Decrease Life",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum payment decrease allowed during the life of an adjustable rate instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Payment frequency is used in conjunction with PAYMENT FREQUENCY UNIT to define the payment frequency of an account. Using this, the Next Payment Dates are calculated. For a repo since there is only one payment at maturity, this column can be defaulted to number of days between Maturity and Original date. \nTransfer Pricing Application cash flow methodologies reference PAYMENT FREQ for calculating and processing payments and prepayments. The engine forecasts future next payment dates by incrementing NEXT PAYMENT DATE forward by PAYMENT FREQUENCY. PAYMENT FREQUENCY is referenced by the cash flow transfer pricing methodologies when deriving discounted cash flows. PAYMENT FREQUENCY > 0 in all cases. PAYMENT FREQUENCY = 0 can cause incorrect calculations to occur. Note that PAYMENT FREQUENCY = 1 and PAYMENT FREQUENCY MULT = D requires the cash flow engine to perform cash flow calculations for every day of the modeling horizon.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Payment frequency unit is used in conjunction with PAYMENT FREQUENCY to define the payment frequency of an account. Expected values are D Day, M Month and Y Year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment History",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the organization defined code for the payment history on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Increase Cycle",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum payment increase allowed during a repricing cycle on an adjustable rate instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Increase Life",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum payment increase allowed during the life of an adjustable rate instrument.\nCash flow methodologies of Transfer Pricing application, reference payment increase cycle when recalculating the current payment for negative amortization events such as negative amortization limit, payment adjust date and payment change frequency.\n\nFor negative amortization type accounts, the cash flow engine uses payment increase cycle to calculate the maximum increase in the payment amount allowed from the previous payment change to the next.\n\nPMT_INCR_CYCLE is defined in terms of a percentage. The cash flow engine performs the following check:\nNewly Calculated Payment  Previous Current Payment >, PMT_INCR_CYCLE Divided by 100* Previous Current Payment,\nIf the newly calculated payment satisfies the above equation, the cash flow engine limits the increase to the amount =, PMT_INCR_CYCLE * Previous Current Payment.\nFor example, if PMT_INCR_CYCLE = 5.00, the calculated current payment is not allowed to increase by more than 5 percent of the previous current payment. \n\nIf PMT_INCR_CYCLE = 0, the cash flow engine assumes that there is no payment\nincrease limit per payment change period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Percentage Sold",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to percent of balance sold to investors, not owned by the bank. This is used compute Current Net Balance, Current Payment Net, Original Net Balance, etc. This is related to syndication, where there are several financial institution that participate in the syndication. The percent sold refers to the portion of exposure that is participated by other financial institutions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Power Of Attorney Or Signatory Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether this account has power of attorney or signatory authority granted to a person with a US address. . This is required for FATCA purpose. List of values are Y, N. If the value is updated as Y means this account has power of attorney granted to a person with a US address and if the value is updated as N means the power of attorney is not granted to a person with US address or this account does not have any power of attorney.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Prime Brokerage Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account is associated with prime brokerage services. Prime brokerage is the generic name for a bundled package of services offered by investment banks and securities firms to hedge funds and other professional investors. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Prior Transfer Pricing Period Average Daily Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Average Daily Balance as of the prior transfer period. When processing with the mid period repricing option, Transfer Pricing application references PRIOR_TP_PER_ADB as the average daily balance at the time of the last repricing event. This field is used in conjunction with the CUR_TP_PER_ADB field. If the last reprice date occurred during the processing period, the rate that would be applied would be the repriced rate on the balance held by the customer, instead a weighted average is calculated individually on balance prior to reprice and balance after reprice.\nExample: if the data extracted is for the month of Dec 2012, and the interest rate has been repriced on 15 Dec 2012, a normal scenario would require the repriced rate on the entire end of period balance, instead the FTP engine calculates a weighted average of both the rates to arrive at a weighted average rate to be applied.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Product Bundle Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of product bundle code. Bundling is a marketing strategy that joins products or services together in order to sell them as a single combined unit. Bundling allows the convenient purchase of several products and or services from the same financial institution. The products and services are usually related, but they can also consist of dissimilar products which appeal to one group of customers. For example Credit card product is bundled with savings account product or loan product is bundled with a CASA account. There are certain interest cost advantages that are available as part of product bundle, should the customer close a product which is part of the bundle, the financial institution could review the advantage provided to other accounts as part of the bundle.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Product Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code assigned to each of the Products offered by the Bank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Cap Life",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Rate cap life refers to maximum interest rate allowed during life of an adjustable rate instrument. If Forecast Rate Plus Margin > Rate Cap Life, then the rate specified in Rate Cap Life is used.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Change Minimum",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the minimum change in the repricing index that is required for a corresponding change to the interest rate and is used by FTP engine to calculate option cost. \nFor adjustable rate records, the cash flow engine will match the REPRICE_ FREQ, INTEREST_RATE_CODE, and the reprice date to the information generated by the monte carlo rate engine. The margin will then be added to this forecasted rate. Any rounding will be applied, followed by a check of the RATE_CHG_MIN, when determining the fully indexed rate. Rate caps or floors and tease periods will be applied, and the resulting rate will be used as the records repriced rate.\n\nIf the absolute value of, forecasted rate + margin,, previous rate + margin,] <RATE_CHG_MIN, the engine will set the new forecasted rate = previous rate. The cash flow engine will not change the previous rate to the new forecasted rate. The previous rate is defined as either the rate on the detail record, CUR_ NET_RATE or CUR_GROSS_RATE, or the previous forecasted rate from the monte carlo engine.\n\nAfter the RATE_CHG_MIN is calculated any other cap or floor, rounding, and tease periods will then be applied to calculate option cost.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Change Rounding Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Rate change round code is defined as the method used for rounding of the interest rate change. The cash flow engine uses RATE_CHG_RND_CODE to determine the rounding method that is applied to the current rate after a repricing event. RATE_CHG_ RND_CODE is used in conjunction with RATE_CHG_RND_FAC. List of values are Truncate, Round Up, Round down and Round nearest.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Change Rounding Factor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the value to which forecasted interest rates are rounded. The rate change factor is read with rate change round code. Truncate rate change round code would not have any factor as the decimal is ignored by the engine.\n\nRound Up rate change code  will round the interest to the nearest integer by the factor mentioned in the column. Example, if the unrounded forecasted rate is 8.65 and the RATE_CHG_RND_FAC = 0.5, the rounded forecasted rate = 9.00.\n\nRound down rate change code  will round down by the factor mentioned in the column to the nearest integer. Some instance it can round it to the nearest 0.5 as well. Example, if the unrounded forecasted rate is 8.65 and the RATE_CHG_RND_FAC = 0.25, the rounded forecasted rate = 8.50\n\nRound Nearest  The cash flow engine rounds the rate to the nearest multiple of RATE_CHG_RND_FAC. For example, if the unrounded forecasted rate is 8.65 and the RATE_CHG_RND_FAC = 0.25, the rounded forecasted rate = 8.75.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Decrease In A Year",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum interest rate decrease allowed during a year for an adjustable rate instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Floor Life",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Rate floor life refers to Minimum interest rate allowed during the life of an adjustable rate instrument. If Forecast Rate + Margin < Rate Floor Life, then the rate specified in Rate Floor Life is used.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Increase In A Year",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum interest rate increase allowed during a year for an adjustable rate instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Recalcitrant Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether this account is considered to be a recalcitrant account. A Recalcitrant account is defined as an account that, 1, fails to comply with reasonable requests for information pursuant to IRS mandated verification and due diligence procedures to identify US Accounts,, 2, fails to provide a name, address and taxpayer identification number or, 3, fails to provide a bank secrecy waiver upon request. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Count",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of records aggregated to the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Region Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the geographical grouping of the market based on certain common characteristics like language, ethnicity, country, continent, city and state. The region can vary based on the definition of market. Global market vs local market can have different definition of region.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remaining Tenor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the remaining tenor of the account. Tenor is the term to maturity. The remaining tenor is computed as Maturity Date  As Of Date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remaining Tenor Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Remaining term unit is used in conjunction with remaining term to determine the remaining term of an account as on processing date. List of values are D Day, M Month and Y Year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Reporting Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the reporting currency code. Usually, it is the currency code of the country in which the financial institution that owns the account operates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repricing Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to reprice Frequency is used in conjunction with Repricing Frequency Unit to define the frequency of rate change of an account. Repricing Frequency is used to identify whether records are adjustable or not. If Repricing Frequency> 0, the record is considered adjustable. If Reprice Frequency = 0, the record is fixed rate. It is used to compute the re price dates after the next_reprice_date. REPRICE_FREQ must be either 0 or positive.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repricing Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to reprice frequency unit is used in conjunction with Repricing Frequency to store the unit of frequency of rate change for an account. List of values are D, M and Y for Days, Months and Years respectively. Example  if the rate adjustment is 6 months, the repricing frequency will be 6 and repricing frequency unit will be M.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Reserve Charge Credit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the charge or credit for funds based on the loan loss reserve balance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Retail Operations Expense",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to retail operations expense, typically a fixed cost per product or number of transactions multiply with unit cost.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Return On Equity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the return on equity which is calculated as Net Income divided by Total Equity.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Revised Renewal Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the revised date on which the contract has to be renewed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sales Representative Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the sales representative associated with the account. A product offering of a bank is usually sold via multiple channels. Sales representatives are usually employed to sell certain types of products like insurance policies, mutual funds etc. DIM_SALES_REPRESENTATIVE is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Servicing Agent Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the servicing agent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the account number to which merchant transactions are settled. The funds from the trades done by the merchant are accumulated in the merchant account, which is then transferred to a designated account within or outside the bank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Solicit Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source of business for the credit card program.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Standing Instructions To Us Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether there are standing instructions to transfer funds from this account to an account maintained in the United States. This is required for FATCA purpose. If the value is updated as Y means there are standing instructions to transfer funds to US account and if the value is updated as N means there are no instructions to transfer funds from the account to US account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Statement Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the statement fee is a monthly fee associated with the monthly statement that is sent to the merchant at the end of each monthly processing cycle. This statement shows how much processing was done by the merchant during the month and what fees were incurred as a result.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Statement Suppression Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether the distribution of statements is suppressed for this account. Normally it is done to switch to paperless where customer will always have access to his records online. If the value is updated as Y means the distribution of statement is suppressed and if the value is updated as N means the distribution of statement is not suppressed for the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Tape Processing Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total organization cost for tape processing on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Tax Exempt Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to percent of interest income that is tax exempt. For instance, if 40 percent of interest income is exempt from tax and the balance is taxable, then this field would store 40 percent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Tax Expense",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the tax amount associated with this account. This is the actual tax amount withheld by the financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Terminal Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total organization cost for terminals for the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Third Party Transaction",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the third party transactions are the transaction amount that are passed directly to third party service providers for processing or funding, or both. Common third parties include American express and Discover.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Account Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the sum of all expenses incurred on the account during the period. Types of expenses include administrative, collections and recovery expenses, legal expenses etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Charges",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total number of charges to the account in the current Update period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Distribution Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the sum of distribution related expenses for the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total cost to the organization for the account for the current Update period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Fees And Charges",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total fees and charges collected or levied by the bank. This includes penal charges, fees, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Process Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the expenses pertaining to data processing, item processing, retail operations, deposit insurance etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Submitted Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the column should store the total amount submitted by the merchant for which he is expecting the payment for the cycle.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Transactions",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to total number of transactions done in that account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the transaction fee is charged when financial institution accept your authorization. This fee only applies to an authorization that is accepted without error.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transfer Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the transfer rate that is applicable for the contract. In case of fixed rate instruments, this is the rate that ALM cash flow engine uses to calculate certain transfer rate related FEs. For adjustable or floating or administered rate instruments, this is the initial rate that is picked up by ALM cash flow engine for transfer pricing the record till the first reprice event, after which it picks the TP rate from the TP IRC for future reprice dates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Treatment Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identification code for a treatment. Treatment is defined which is channel specific instance of an offer. Treatment Refers to the message associated with the offer. Treatment dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Us Indicia Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Flag indicates if the account has US Indicia. US Indicia indicates presence of any of the following: US Citizenship or lawful or permanent resident, US birth place, US address, Instructions to transfer funds to US Accounts or directions regularly received from a US address etc. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "VIP Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the member is categorized as a VIP by the financial institution.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Visa Merchant Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to identify if the merchant is a Visa merchant and accepts Visa transactions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Volume Rebate Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the volume rebate to the account in the current update period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Waived Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the fees that is waived by the financial intuition during the download period. Waivers are provided on processing fee, annual fee, joining fee or any other fee that may be levied.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Warning Bulletins Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total organization cost for warning bulletins for the account YTD.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [
                {
                    "dqId": "DQCLREF248",
                    "btLogicalName": "Current Fees",
                    "dqDesc": "Should Be Greater Than or equal to 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQCLREF249",
                    "btLogicalName": "Current Payment Amount",
                    "dqDesc": "Should Be Greater Than or equal to 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQCLREF250",
                    "btLogicalName": "Discounted Fees",
                    "dqDesc": "Should Be Greater Than or equal to 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQCLREF251",
                    "btLogicalName": "Discount Rate",
                    "dqDesc": "Should Be Greater Than or equal to 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQCLREF252",
                    "btLogicalName": "Finance Charge Balance",
                    "dqDesc": "Should Be Greater Than or equal to 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQCLREF253",
                    "btLogicalName": "Fixed Expenses",
                    "dqDesc": "Should Be Greater Than or equal to 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQCLREF254",
                    "btLogicalName": "Fees For Effective Interest Rate",
                    "dqDesc": "Should Be Greater Than or equal to 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQCLREF255",
                    "btLogicalName": "Margin Rate",
                    "dqDesc": "Should have values greater than 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQCLREF256",
                    "btLogicalName": "Gross Margin",
                    "dqDesc": "Should Be Greater Than or equal to 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQCLREF257",
                    "btLogicalName": "Original Gross Book Balance",
                    "dqDesc": "Should Be Greater Than or equal to 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQCLREF258",
                    "btLogicalName": "Percentage Sold",
                    "dqDesc": "Should have values greater than or equal 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQCLREF259",
                    "btLogicalName": "Delinquency Days",
                    "dqDesc": "Should be greater than or equal to 0",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQCLREF260",
                    "btLogicalName": "Effective Interest Rate For Hedge Management",
                    "dqDesc": "Should Be Greater Than or equal to 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQCLREF261",
                    "btLogicalName": "Float Expenses",
                    "dqDesc": "Should Be Greater Than or equal to 0.",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQCLREF45",
                    "btLogicalName": "Current Credit Limit",
                    "dqDesc": "Should Be Greater Than Or Equal To End Of Period Balance",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQCLREF46",
                    "btLogicalName": "Credit Score Date",
                    "dqDesc": "Should be less than As Of Date",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQCLREF47",
                    "btLogicalName": "Charge Off Date",
                    "dqDesc": "Should be less than or equal to As Of Date",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQCLREF48",
                    "btLogicalName": "Fee Charge Date",
                    "dqDesc": "Should be Less Than Or Equal To As Of Date",
                    "dqType": "Column Reference or Specific Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32557",
                    "btLogicalName": "Exposure Held At Fair Value Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32558",
                    "btLogicalName": "International Banking Facility Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32559",
                    "btLogicalName": "Joint Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32560",
                    "btLogicalName": "Payment Change Frequency Unit",
                    "dqDesc": "Should have list of values as D,M,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32561",
                    "btLogicalName": "Notification Letter Suppression Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32562",
                    "btLogicalName": "Embedded Options Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32563",
                    "btLogicalName": "Prime Brokerage Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32564",
                    "btLogicalName": "Visa Merchant Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32565",
                    "btLogicalName": "Remaining Tenor Unit",
                    "dqDesc": "Should have list of values as D,M,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32566",
                    "btLogicalName": "Open Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32567",
                    "btLogicalName": "VIP Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32568",
                    "btLogicalName": "Effective Interest Rate Effective Initial Spread Calculation Instruction Flag",
                    "dqDesc": "Should have list of values as A,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32569",
                    "btLogicalName": "Internal Customer Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32570",
                    "btLogicalName": "Mater Card Merchant Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32571",
                    "btLogicalName": "Repricing Frequency Unit",
                    "dqDesc": "Should have list of values as D,M,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32572",
                    "btLogicalName": "Statement Suppression Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32573",
                    "btLogicalName": "Power Of Attorney Or Signatory Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32574",
                    "btLogicalName": "Standing Instructions To Us Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32575",
                    "btLogicalName": "Mater Card Transaction Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32576",
                    "btLogicalName": "Recalcitrant Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQLOV32577",
                    "btLogicalName": "Us Indicia Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQMNDTR263",
                    "btLogicalName": "Adjustment Effective Date",
                    "dqDesc": "Mandatory when Interest Rate Type equals Other Adjustable",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQMNDTR91",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQMNDTR92",
                    "btLogicalName": "Account Or Contract Number",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQMNDTR93",
                    "btLogicalName": "Current Interest Rate",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQMNDTR94",
                    "btLogicalName": "End Of Period Balance",
                    "dqDesc": "Mandatory",
                    "dqType": "NULL Value Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37508",
                    "btLogicalName": "Account Close Date",
                    "dqDesc": "Reference Check for Account Close Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37509",
                    "btLogicalName": "Account Close Date",
                    "dqDesc": "Reference Check for Account Close Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37510",
                    "btLogicalName": "Account Status Date",
                    "dqDesc": "Reference Check for Account Status Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37511",
                    "btLogicalName": "Account Status Date",
                    "dqDesc": "Reference Check for Account Status Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37512",
                    "btLogicalName": "Adjustment Effective Date",
                    "dqDesc": "Reference Check for Adjustment Effective Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37513",
                    "btLogicalName": "Adjustment Effective Date",
                    "dqDesc": "Reference Check for Adjustment Effective Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37514",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37515",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37516",
                    "btLogicalName": "Credit Score Date",
                    "dqDesc": "Reference Check for Credit Score Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37517",
                    "btLogicalName": "Credit Score Date",
                    "dqDesc": "Reference Check for Credit Score Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37518",
                    "btLogicalName": "Effective Maturity Date",
                    "dqDesc": "Reference Check for Effective Maturity Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37519",
                    "btLogicalName": "Effective Maturity Date",
                    "dqDesc": "Reference Check for Effective Maturity Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37520",
                    "btLogicalName": "Expiration Date",
                    "dqDesc": "Reference Check for Expiration Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37521",
                    "btLogicalName": "Expiration Date",
                    "dqDesc": "Reference Check for Expiration Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37522",
                    "btLogicalName": "Fatca Reporting Period End Date",
                    "dqDesc": "Reference Check for Fatca Reporting Period End Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37523",
                    "btLogicalName": "Fatca Reporting Period End Date",
                    "dqDesc": "Reference Check for Fatca Reporting Period End Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37524",
                    "btLogicalName": "Last Credit Line Change Date",
                    "dqDesc": "Reference Check for Last Credit Line Change Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37525",
                    "btLogicalName": "Last Credit Line Change Date",
                    "dqDesc": "Reference Check for Last Credit Line Change Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37526",
                    "btLogicalName": "Last Rejected Date",
                    "dqDesc": "Reference Check for Last Rejected Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37527",
                    "btLogicalName": "Last Rejected Date",
                    "dqDesc": "Reference Check for Last Rejected Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37528",
                    "btLogicalName": "Last Reprice Date",
                    "dqDesc": "Reference Check for Last Reprice Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37529",
                    "btLogicalName": "Last Reprice Date",
                    "dqDesc": "Reference Check for Last Reprice Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37530",
                    "btLogicalName": "Last Statement Date",
                    "dqDesc": "Reference Check for Last Statement Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37531",
                    "btLogicalName": "Last Statement Date",
                    "dqDesc": "Reference Check for Last Statement Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37532",
                    "btLogicalName": "Maturity Date",
                    "dqDesc": "Reference Check for Maturity Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37533",
                    "btLogicalName": "Maturity Date",
                    "dqDesc": "Reference Check for Maturity Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37534",
                    "btLogicalName": "Negative Amortization Equalization Date",
                    "dqDesc": "Reference Check for Negative Amortization Equalization Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37535",
                    "btLogicalName": "Negative Amortization Equalization Date",
                    "dqDesc": "Reference Check for Negative Amortization Equalization Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37536",
                    "btLogicalName": "Next Payment Date",
                    "dqDesc": "Reference Check for Next Payment Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37537",
                    "btLogicalName": "Next Payment Date",
                    "dqDesc": "Reference Check for Next Payment Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37538",
                    "btLogicalName": "Next Reprice Date",
                    "dqDesc": "Reference Check for Next Reprice Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37539",
                    "btLogicalName": "Next Reprice Date",
                    "dqDesc": "Reference Check for Next Reprice Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37540",
                    "btLogicalName": "Original Next Payment Date",
                    "dqDesc": "Reference Check for Original Next Payment Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37541",
                    "btLogicalName": "Original Next Payment Date",
                    "dqDesc": "Reference Check for Original Next Payment Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37542",
                    "btLogicalName": "Origination Date",
                    "dqDesc": "Reference Check for Origination Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37543",
                    "btLogicalName": "Origination Date",
                    "dqDesc": "Reference Check for Origination Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37544",
                    "btLogicalName": "Payment Adjustment Date",
                    "dqDesc": "Reference Check for Payment Adjustment Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37545",
                    "btLogicalName": "Payment Adjustment Date",
                    "dqDesc": "Reference Check for Payment Adjustment Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37546",
                    "btLogicalName": "Revised Renewal Date",
                    "dqDesc": "Reference Check for Revised Renewal Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37547",
                    "btLogicalName": "Revised Renewal Date",
                    "dqDesc": "Reference Check for Revised Renewal Date in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37548",
                    "btLogicalName": "Account Classification Code",
                    "dqDesc": "Reference Check for Account Classification Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37549",
                    "btLogicalName": "Account Group Identifier",
                    "dqDesc": "Reference Check for Account Group Identifier in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37550",
                    "btLogicalName": "Account Or Contract Number",
                    "dqDesc": "Reference Check for Account Or Contract Number in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37551",
                    "btLogicalName": "Account Type",
                    "dqDesc": "Reference Check for Account Type in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37552",
                    "btLogicalName": "Reporting Currency Code",
                    "dqDesc": "Reference Check for Reporting Currency Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37553",
                    "btLogicalName": "Account Status Code",
                    "dqDesc": "Reference Check for Account Status Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37554",
                    "btLogicalName": "Accounting Standard Code",
                    "dqDesc": "Reference Check for Accounting Standard Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37555",
                    "btLogicalName": "Adjustment Type",
                    "dqDesc": "Reference Check for Adjustment Type in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37556",
                    "btLogicalName": "Amortization Method For Premium Discount And Fees Code",
                    "dqDesc": "Reference Check for Amortization Method For Premium Discount And Fees Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37557",
                    "btLogicalName": "Application Number",
                    "dqDesc": "Reference Check for Application Number in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37558",
                    "btLogicalName": "Attrition Reason Code",
                    "dqDesc": "Reference Check for Attrition Reason Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37559",
                    "btLogicalName": "Bank Code",
                    "dqDesc": "Reference Check for Bank Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37560",
                    "btLogicalName": "Branch Code",
                    "dqDesc": "Reference Check for Branch Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37561",
                    "btLogicalName": "Business Domain",
                    "dqDesc": "Reference Check for Business Domain in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37562",
                    "btLogicalName": "Campaign Identifier",
                    "dqDesc": "Reference Check for Campaign Identifier in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37563",
                    "btLogicalName": "ISO Currency Code",
                    "dqDesc": "Reference Check for ISO Currency Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37564",
                    "btLogicalName": "Acquisition Channel Code",
                    "dqDesc": "Reference Check for Acquisition Channel Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37565",
                    "btLogicalName": "Common Chart Of Account Code",
                    "dqDesc": "Reference Check for Common Chart Of Account Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37566",
                    "btLogicalName": "Country Code",
                    "dqDesc": "Reference Check for Country Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37567",
                    "btLogicalName": "Credit Status Code",
                    "dqDesc": "Reference Check for Credit Status Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37568",
                    "btLogicalName": "Data Source Code",
                    "dqDesc": "Reference Check for Data Source Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37569",
                    "btLogicalName": "Day Count Indicator",
                    "dqDesc": "Reference Check for Day Count Indicator in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37570",
                    "btLogicalName": "Delinquency Status Code",
                    "dqDesc": "Reference Check for Delinquency Status Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37571",
                    "btLogicalName": "Fee General Ledger Code",
                    "dqDesc": "Reference Check for Fee General Ledger Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37572",
                    "btLogicalName": "General Ledger Account Code",
                    "dqDesc": "Reference Check for General Ledger Account Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37573",
                    "btLogicalName": "Hedge Portfolio Set Code",
                    "dqDesc": "Reference Check for Hedge Portfolio Set Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37574",
                    "btLogicalName": "Holiday Rolling Convention Code",
                    "dqDesc": "Reference Check for Holiday Rolling Convention Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37575",
                    "btLogicalName": "Instrument Type",
                    "dqDesc": "Reference Check for Instrument Type in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37576",
                    "btLogicalName": "Interest Calculation Method",
                    "dqDesc": "Reference Check for Interest Calculation Method in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37577",
                    "btLogicalName": "Interest Rate Code",
                    "dqDesc": "Reference Check for Interest Rate Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37578",
                    "btLogicalName": "Interest Rate Type",
                    "dqDesc": "Reference Check for Interest Rate Type in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37579",
                    "btLogicalName": "Legal Entity Code",
                    "dqDesc": "Reference Check for Legal Entity Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37580",
                    "btLogicalName": "Line Of Business Code",
                    "dqDesc": "Reference Check for Line Of Business Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37581",
                    "btLogicalName": "Offer Code",
                    "dqDesc": "Reference Check for Offer Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37582",
                    "btLogicalName": "Organization Unit Code",
                    "dqDesc": "Reference Check for Organization Unit Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37583",
                    "btLogicalName": "Original Account Number",
                    "dqDesc": "Reference Check for Original Account Number in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37584",
                    "btLogicalName": "Ownership Type",
                    "dqDesc": "Reference Check for Ownership Type in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37585",
                    "btLogicalName": "Partner Code",
                    "dqDesc": "Reference Check for Partner Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37586",
                    "btLogicalName": "Party Identifier",
                    "dqDesc": "Reference Check for Party Identifier in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37587",
                    "btLogicalName": "Product Code",
                    "dqDesc": "Reference Check for Product Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37588",
                    "btLogicalName": "Region Code",
                    "dqDesc": "Reference Check for Region Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37589",
                    "btLogicalName": "Sales Representative Identifier",
                    "dqDesc": "Reference Check for Sales Representative Identifier in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                },
                {
                    "dqId": "DQREF37590",
                    "btLogicalName": "Treatment Code",
                    "dqDesc": "Reference Check for Treatment Code in Stage Merchant Cards",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:28.0",
                    "modifiedDate": "2024-11-04 04:39:32.0"
                }
            ],
            "useCases": [
                {
                    "ucId": "ALM",
                    "ucName": "Asset Liability Management"
                },
                {
                    "ucId": "LLFP",
                    "ucName": "Oracle Loan Loss Forecasting and Provisioning"
                },
                {
                    "ucId": "BSP",
                    "ucName": "Balance Sheet Planning"
                },
                {
                    "ucId": "FTP",
                    "ucName": "Funds Transfer Pricing"
                },
                {
                    "ucId": "PFT",
                    "ucName": "Profitability Management"
                }
            ]
        }
    ]
}