{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "Account Or Contract Number",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of the account or contract held by the customer. Account number is defined as numbers, letters or alphanumeric code assigned to every significant customer, supplier and lender for ease of reference in accounting records of the financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accounting Standard Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the accounting standard or the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. E.g. GAAP, IFRS etc. Generally Accepted Accounting Principles, GAAP. GAAP are the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. The Generally Accepted Accounting Principles exist to ensure that accountants are using the same or almost the same standards so that comparison of financial statements between or within a company is easy and accurate. They also promote transparency in accounting. However, GAAP provides broad guidelines, there is room for companies to follow an approach within a guideline.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjustment Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier for adjustment type dimension at an account. Examples can be CONTRA,NEW etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "As Of Date",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Unit Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the business unit code as defined by the organization. A business unit is generally a broader definition and represents all the units in an organization. Business Unit dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of fees accrued and outstanding for the current reporting period. Current fees may include over the limit fees, wire transfer fees, cheque book issued, bankers draft etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source system from where data is extracted. Data can be sourced from multiple sources, this column will Refers to the source code from where the data is extracted for this extraction date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to end of period balance which includes accrued interest. All the calculations such as interest, prepayment amounts etc. are based on this amount. This is used in all the calculations performed by cash flow engine. In Case of LC Contracts, EOP Balance should be populated when LC Is executed. Till LC is executed, LC amount sanctioned should be hold in Total Commitment Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the end of period book balance. It is the sum of total of End of Period Balance Plus Deferred Balance. This is used while calculating amortization. The book balance is the term financial institutions use to describe the amount of money available before any adjustments have been made for deposits in transit, checks that have not yet been cleared, reserve requirements and interest received from 'float funds' hence is generally greater than end of period balance, Also called as 'gross balance'. It also excludes any deferred balance that is unamortized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "End Of Period Principal Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the outstanding principal balance at the end of the month. Each account will have principal and interest component, this column will capture the outstanding principal component at the end of the month.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fiduciary Relationship Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account is held with the bank under a fiduciary capacity. Fiduciary capacity means trustee, executor, administrator, registrar of stocks and bonds, transfer agent, guardian, assignee, receiver, or custodian under a uniform gifts to minors act investment adviser, if the bank receives a fee for its investment advice any capacity in which the bank possesses investment discretion on behalf of another or any other similar capacity that the regulator authorizes. For example deposits that are placed with a bank by a national bank for which the bank is a fiduciary.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "General Ledger Account Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique general ledger account code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Gross Loss Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the gross loss amount. Gross loss amount is the difference between cost of sales and turnover, or net sales, when cost of sales is the greater item.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "ISO Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "International Banking Facility Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account or transaction is belongs to an international banking facility. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Legal Entity Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the entity code of the legal entity to which the account will be attributed in the general ledger.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Line Of Business Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to line of business, LOB, is a functional unit that offers the products to the customer by the financial entity. Example: Corporate Finance, Trade Services, Private Wealth Management, Treasury Services, Retail Banking, Cards services etc. Refers to the unique code of the line of business applicable to the respective product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Managed Asset Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if assets underlying the given account are managed or unmanaged. An account should be categorized as managed if the institution has investment discretion over the assets of the account. Investment discretion is defined as the sole or shared authority, whether or not that authority is exercised, to determine what securities or other assets to purchase or sell on behalf of the fiduciary related account. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Organization Unit Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the cost center to which the account belongs to. Organization Unit dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Parent Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the parent account number of the contract or account. For instance, if the asset is an underlying for a repurchase agreement, then the account number of the repo contract is expected in this column. Incase of Borrowings, it can also store the account as parent account which is help by the financial institution in fiduciary capacity. In case of cards, parent account number refers to corporate card master account number. Incase of OD Accounts, it should refer to the parent savings, checking account number or loan account number if the overdraft has arisen due to breach of limits or funds from those respective accounts. It will store loan account number as parent account number even for the cases where the overdraft has arisen in the escrow account for the payment of taxes and or insurance. It should be left NULL, if parent child relationship does not exist.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Party Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier for the party. Party is defined as an entity or a person who takes part or is involved in an agreement, lawsuit, or transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Product Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code assigned to each of the Products offered by the Bank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Run Identifier",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the run identifier for a set of Records participating in the particular Run with the Run Execution identifier. This is a combination of Run Main Identifier and Run Execution Identifier.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [
                {
                    "dqId": "DQLOV33676",
                    "btLogicalName": "Fiduciary Relationship Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                },
                {
                    "dqId": "DQLOV33677",
                    "btLogicalName": "Managed Asset Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                },
                {
                    "dqId": "DQLOV33678",
                    "btLogicalName": "International Banking Facility Account Flag",
                    "dqDesc": "Should have list of values as N,Y",
                    "dqType": "List of Values or Code Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                },
                {
                    "dqId": "DQREF40203",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Other Liabilities",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                },
                {
                    "dqId": "DQREF40204",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Other Liabilities",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                },
                {
                    "dqId": "DQREF40205",
                    "btLogicalName": "Account Or Contract Number",
                    "dqDesc": "Reference Check for Account Or Contract Number in Stage Other Liabilities",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                },
                {
                    "dqId": "DQREF40206",
                    "btLogicalName": "Accounting Standard Code",
                    "dqDesc": "Reference Check for Accounting Standard Code in Stage Other Liabilities",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                },
                {
                    "dqId": "DQREF40207",
                    "btLogicalName": "Adjustment Type",
                    "dqDesc": "Reference Check for Adjustment Type in Stage Other Liabilities",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                },
                {
                    "dqId": "DQREF40208",
                    "btLogicalName": "Business Unit Code",
                    "dqDesc": "Reference Check for Business Unit Code in Stage Other Liabilities",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                },
                {
                    "dqId": "DQREF40209",
                    "btLogicalName": "Data Source Code",
                    "dqDesc": "Reference Check for Data Source Code in Stage Other Liabilities",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                },
                {
                    "dqId": "DQREF40210",
                    "btLogicalName": "General Ledger Account Code",
                    "dqDesc": "Reference Check for General Ledger Account Code in Stage Other Liabilities",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                },
                {
                    "dqId": "DQREF40211",
                    "btLogicalName": "ISO Currency Code",
                    "dqDesc": "Reference Check for ISO Currency Code in Stage Other Liabilities",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                },
                {
                    "dqId": "DQREF40212",
                    "btLogicalName": "Line Of Business Code",
                    "dqDesc": "Reference Check for Line Of Business Code in Stage Other Liabilities",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                },
                {
                    "dqId": "DQREF40213",
                    "btLogicalName": "Legal Entity Code",
                    "dqDesc": "Reference Check for Legal Entity Code in Stage Other Liabilities",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                },
                {
                    "dqId": "DQREF40214",
                    "btLogicalName": "Organization Unit Code",
                    "dqDesc": "Reference Check for Organization Unit Code in Stage Other Liabilities",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                },
                {
                    "dqId": "DQREF40215",
                    "btLogicalName": "Parent Account Number",
                    "dqDesc": "Reference Check for Parent Account Number in Stage Other Liabilities",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                },
                {
                    "dqId": "DQREF40216",
                    "btLogicalName": "Party Identifier",
                    "dqDesc": "Reference Check for Party Identifier in Stage Other Liabilities",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                },
                {
                    "dqId": "DQREF40217",
                    "btLogicalName": "Product Code",
                    "dqDesc": "Reference Check for Product Code in Stage Other Liabilities",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:11.0",
                    "modifiedDate": "2024-11-04 04:39:05.0"
                }
            ],
            "useCases": []
        }
    ]
}