{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "As Of Date",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source system from where data is extracted. Data can be sourced from multiple sources, this column will Refers to the source code from where the data is extracted for this extraction date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Financial Institution Identification Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to Financial identification number of the party that represents a financial institution",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Financial Institution Identifier Type",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of the unique identifier used to reference the correspondent financial institution that owns this account. Expected values are FED  Federal Reserve Routing Number, BIC  Swift Bank Identifier Code, CHU  CHIPS Participant User Identifier, CHP  CHIPS Participant Identifier, EPN  Euroclear Participant Number, DTC Depository Trust Corporation Number, BLZ  German Bankleitzahl, IBAN  International Bank Account Number, ABLZ  Austrian Bankleitzahl, BCHH  Bank Code of Hong Kong, BSP  Australian Bank State Branch Code, CPAP  Canadian Payments Assn Payment Routing Number, HEBIC  Hellenic Bank Identification Code, IDIC  Italian Domestic Identification Code, IFSC  Indian Financial System Code, NSC  Irish National Clearing Code, PNCC  Portuguese National Clearing Code, RCBIC  Russian Central Bank Identification Code, SDIC  Spanish Domestic Interbanking Code, Swiss BC  Swiss Clearing Code, Swiss SIC  Swiss Clearing Code and UKDSC  UK Domestic Sort Code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Party Identifier",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier for the party. Party is defined as an entity or a person who takes part or is involved in an agreement, lawsuit, or transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Run Identifier",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the run identifier for a set of Records participating in the particular Run with the Run Execution identifier. This is a combination of Run Main Identifier and Run Execution Identifier.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [
                {
                    "dqId": "DQREF40506",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Party Financial Institution Identification Details",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:08.0",
                    "modifiedDate": "2024-11-04 04:39:02.0"
                },
                {
                    "dqId": "DQREF40507",
                    "btLogicalName": "As Of Date",
                    "dqDesc": "Reference Check for As Of Date in Stage Party Financial Institution Identification Details",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:08.0",
                    "modifiedDate": "2024-11-04 04:39:02.0"
                },
                {
                    "dqId": "DQREF40508",
                    "btLogicalName": "Data Source Code",
                    "dqDesc": "Reference Check for Data Source Code in Stage Party Financial Institution Identification Details",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:08.0",
                    "modifiedDate": "2024-11-04 04:39:02.0"
                },
                {
                    "dqId": "DQREF40509",
                    "btLogicalName": "Party Identifier",
                    "dqDesc": "Reference Check for Party Identifier in Stage Party Financial Institution Identification Details",
                    "dqType": "Referential Integrity Check",
                    "isCustom": "Seeded",
                    "status": "S",
                    "createdDate": "2024-10-26 04:46:08.0",
                    "modifiedDate": "2024-11-04 04:39:02.0"
                }
            ],
            "useCases": []
        }
    ]
}