{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "Accounting Classification",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This attribute will indicate if the account is classified as FVOCI, FVTPL or AMORTCOST in reference to IFRS9.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accounting Standard Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the accounting standard or the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. E.g. GAAP, IFRS etc. Generally Accepted Accounting Principles, GAAP. GAAP are the rules to which accountants adhere when preparing financial statements to ensure minimum level of consistency. The Generally Accepted Accounting Principles exist to ensure that accountants are using the same or almost the same standards so that comparison of financial statements between or within a company is easy and accurate. They also promote transparency in accounting. However, GAAP provides broad guidelines, there is room for companies to follow an approach within a guideline.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accrued Administration Charge As Of Valuation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is accrued administration charge as of valuation date , used for gaap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accrued Distribution Fee As Of Valuation Date Used For Accounting Standard",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the Accrued Distribution Fee As Of Valuation Date, Used For Gaap.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Acquired Firm Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the legacy entity code. Used when one entity acquires another one whereby current entity will be provided as part of DIM ORG STRUCTURE whereas old or acquired or merged entity is stored in Legacy Entity Code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Acquisition Channel Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the channel through which customer was acquired.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjusted Invested Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the adjusted invested amount. For nonqualified contracts in the payout stage, if the tax cost recovery method is limited to the adjusted investment in the contract, the adjusted investment amount must be entered when the exclusion amount or ratio is entered. The exclusion ratio is the comparison of the taxable portion of a nonqualified annuity payment to the tax free portion, expressed as a percentage. Nonqualified annuities are bought with after tax dollars, so the dollar amount that constitutes a return of principal is deducted, or excluded, from the total payment, and only the earnings are taxed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjusted Written Premium Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "The written premium amount adjusted for transactions like endorsements, cancellations, reinstatement of contracts, late payment of premium. Assume annual policies are written at a stable level through the year 2000, with the initial amount charged equaling 2 million dollar for each month. Assume the only adjustment necessary is to reflect the fact that half any month’s premium is booked one month late. Policy year 2000 at 12 31 2000.Written Premium is 23 mn dollars, Written Premium adjustment is 1 mn dollars, anticipated amount of premium from December 2000 effective month that will be booked in January 2001, Total ultimate Written premium is 24 million dollars. Written Premium through 12 31 2000 is 23 mn dollar.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjustment Effective Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the adjustment Effective Date for determining the reference date for the IRC rate lookup.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Adjustment Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier for adjustment type dimension at an account. Examples can be CONTRA,NEW etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Annual Deduction Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the Amount of family deductible. A deductible is a specific dollar amount the health insurance plan may require the policyholder to pay out of pocket toward covered medical care each year, before the health plan begins to pay for covered medical expenses.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Annualized Premium Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Annualized Premium Equivalent calculated for the policy at the inception in Natural currency. An insurance company comes up with many premium payment options. Premium can be paid monthly, quarterly, semi annually and annually. For instance, if the monthly premium is 100 dollars then the annualized premium is 1200 dollars.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Annuitant Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the said policy has annuitant. An annuitant is a person who is entitled to the income benefits from an annuity. This is also the person whose life expectancy determines the payment amounts. The annuitant is usually the annuity contract owner but can also be the spouse or a friend or relative of the annuity owner. A company or other such entity cannot be an annuitant.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Annuitization Option Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code that indicates whether or not the contract holder has elected to take the annuitization benefit. Annuitization provisions are standard base contract provisions that allow for contract holders to have an accumulated balance paid to them under a stream of payments. This is a very typical contract provision used with contracts whose fundamental purpose is to provide a savings vehicle, e.g., forms of deferred annuities.\nValues are \nANNUITY  100Percent Annuitization elected\nLUMPSUM  Lump sum withdrawal elected or no annuity\nPARTIAL  Some portion is withdrawn as lump sum and remain is annuitized.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Annuitization Option Exercise Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date when a stretch annuity contract is exercised when a 21 year old beneficiary e.g., a child of a deceased annuitant wants to have the death benefit paid by financial institution be processed as an ongoing annuity for the benefit of the child income and tax deferment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Annuitization Option Start Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date when a stretch annuity contract becomes effective when a 21 year old beneficiary e.g. a child of a deceased annuitant wants to have the death benefit paid by financial institution to be processed as an ongoing annuity for the benefit of partial tax deferment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Annuity Destination Transfer Amount Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Annuity Destination Transfer Amount Type, On Payout it is used to specify how the destination is to be handled. Sample values are TRANSAMTTYPEALL is All Allocations Acceptable, TRANSAMTTYPEAMT is Amounts, TRANSAMTTYPEGRANULAR is Granular level specification, TRANSAMTTYPEPCT is Percentage, TRANSAMTPRORATAALL is Pro to rata across ALL funds, TRANSAMTTYPEPRORATA is Pro to rata based on relative amount of selected fund, TRANSAMTVARIABLE is Prorate across all Variable funds, TRANSAMTTYPENOAMOUNT is Transfer, No Amount Type Specified, TRANSAMTTYPEUNITS is Units, TRANSAMTTYPESTAND is Use standing allocations, OTHER is Other, UNKNOWN is Unknown..",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Annuity Income Option Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Annuity Income Option type. It is the income option selected by the client. Sample values are DEPOSITINT is Deposit At interest, FIXSETTLMNTOPTENDORSMNT is Fixed Settlement Option Endorsement, LUMPANDCERT is Initial lump sum and period certain, NONSTANDARD is Non to Standard, DIVIDENDPAY is Dividend Payment, FIXEDPLUSINT is Fixed Amount Plus Interest, LIFEGIREFCERT is Greater Life w Installment Refund or Period Cert, LIFEGCRCERT is Greater Of Life w Cash Refund or Period Certain, CERTANDLIFE is Greater of Period Certain and Life, LIFELIREFCERT is Lesser Life w Installment Refund or Period Cert, OTHER is Other, UNKNOWN is Unknown..",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Annuity Payout Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the annuity payout type. Sample values are FIX is Level Annuities, With fixed annuities, the payout is a predetermined sum of money that does not change from the contract agreement. The fixed annuity is the most predictable and stable of all the annuity types. It carries the lowest risk, and possibly a lower return for the investor. VAR is Variable Annuities, With variable annuities, the money is invested in a fund of professionally managed investments like stocks, bonds or money market funds. Investors who purchase variable annuities can choose from a selection of subaccounts, which are mutual funds. ESC is Escalating Annuities, With Escalating Annuities, they tend to offer a much lower starting income, but the pay out increases each year – either by a set percentage, or in line with inflation as defined by the Retail Prices Index. They may end up paying more than a level annuity if you live for a long time.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Annuity Start Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the annuity start date. Annuity Starting Date, as defined by the IRC, which is defined as the greater of 1954 to 01 to 01, or the contract date, or the first day of the period payment mode which ends on the date of the first annuity payment. For example, if the contract date is 2005 to 01 to 01 and monthly payments beginning in three months is elected, the Annuity Start Date is 2005 to 03 to 01 and the income, payment Start Date is 2005 to 04 to 01.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Annuity Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the annuity type for the policies. Sample Values are LOA is Life Only Annuity, LAPC is Life Annuity with Period Certain, LAGT is Life Annuity with Guaranteed Term, JSA is Joint and Survivor Annuity.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Application Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the application number that was filled by the customer that formed the basis for the contract. Application is a document that provides the essential financial and other information about the borrower on which the lender bases the decision to lend.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "As Of Date",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Assumed Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the assumed interest rate for calculating the payout.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Attrition Reason Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the reason code for which customer has canceled the contract or the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Authorized Rollover Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Authorized Rollover Amount. Defines the net amount of a rollover of trustee to trustee transfer for one ROTH IRA to another ROTH IRA that is attributable to regular contributions, 60 day rollover where all or a portion of the amount distributed from the IRA is deposited into another IRA or retirement plan. Taxes are not applicable on amounts that are rolled over into another IRA or retirement plan. However taxes are applicable on the portion that is not rolled over into an IRA or retirement plan.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Automatic Renewal Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates automatic renewal. Renewal flag indicates the deposit would be renewed automatically on maturity only on identical terms.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Benchmark Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code of the benchmark code associated with the floating rate instrument. The floating rate loans have a benchmark interest rate such as London Inter bank Offer Rate ,LIBOR,, Euro Interbank Offered Rate ,EURIBOR, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Benchmark Index Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the primary currency associated with the benchmark of the interest rate. This is applicable in case of adjustable rate instruments. For example, if the interest rate benchmark is LIBOR USD, the currency will be USD and the benchmark code will be LIBOR.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Benchmark Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the interest benchmark rate applicable to that account. This is applicable when the account carries floating rate of interest. In that case, prevailing rate is derived from the Interest Rate Curve and margin, if specified, is added to compute the applicable rate of interest for an account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Benchmark Tenor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric_Long",
                    "gcd": "Refers to the Benchmark Tenor. Tenor is the corresponding Tenor of Benchmark Yield Curve rate which is used for floating rate of return. For example 3M.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Benchmark Tenor Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Indicates the unit of underlying IR index tenor, possible values are D for days, BD for business days, W for Weeks, M for month, y for Year. This is applicable for Index Annuities or Annuity contracts where benefit payment is linked to benchmark like 1 year USD Treasury yield, 3 month GBP LIBOR etc. This column store unit part of the 1 year or 3 month in above example.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bill Plan Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique surrogate key for the billing plan established by the company for premium payments. Examples of billing plan can be Single Payment Plan, 4 installment with 16 percent down, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Class Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the business class code as prescribed by the Regulator.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Day Of Month",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Business Day Of Month is used to specify the business day of the month on which the Payout should take place. If BusinessDayOfMonth is specified, then DayOfMonth, WeekInMonth, and DayOfWeek should not be specified. Sample values are OLIALLOWDAY18 is The Eighteenth, OLIALLOWDAY8 is The Eighth, OLIALLOWDAY11 is The Eleventh, OLIALLOWDAY15 is The Fifteenth, OLIALLOWDAY5 is The Fifth, OLIALLOWDAY1 is The First, OLIALLOWDAY14 is The Fourteenth, OLIALLOWDAY4 is The Fourth, OLIALLOWDAY19 is The Nineteenth, OLIALLOWDAY9 is The Ninth, OLIALLOWDAY2 is The Second, OLIALLOWDAY17 is The Seventeenth, OLIALLOWDAY7 is The Seventh, OLIALLOWDAY16 is The Sixteenth, OLIALLOWDAY6 is The Sixth, OLIALLOWDAY10 is The Tenth, OLIALLOWDAY3 is The Third, OLIALLOWDAY13 is The Thirteenth.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Domain",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of the business domain., such as Institutional or Retail Brokerage. This is used to control access to data across distinct business operations.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Risk",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the level of risk associated with this account with respect to business characteristics. List of values are in the range of 0 10 with increasing values denoting increasing risk levels.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Segment Category Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Business Segment Category code. Indicative Values are LIFE for Life insurance, PANDC for Property and Casualty, HEALTH for Health Insurance, ANNUITY for Annuity Contracts, RETIREMENT for Retirement Accounts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Unit Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the business unit code as defined by the organization. A business unit is generally a broader definition and represents all the units in an organization. Business Unit dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "CUSIP Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identification number issued to the instrument. CUSIP stands for 'Committee on Uniform Securities Identification Procedures' and refers to a 9 digit alphanumeric code assigned to all security issues approved for trading. By acting as a unique identifier for each security, CUSIPs help market participants avoid confusion and ensure that securities transactions are correctly matched and settled. Additionally, they are also needed to ensure that dividends, interest, and other payments are properly applied.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Calculation Option Display Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the choice between Just shifting the dates for holiday calendar and recalculating the payments based on the new dates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cancellation Requested By Insured Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if cancellation of the policy was requested by the insured.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cancelled Premium Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "The amount of premium to be refunded to the policyholder in case of cancellation of the policy. Cancellation of policy is the termination of an insurance policy or bond, before its expiration, by either the insured or the insurer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cash Dividend Paid Inception Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of Dividend paid to particular policy as a cash since Inception.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cash Dividend Paid Month Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of Dividend paid to particular policy as a cash in a given month.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cash Value Maturity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Cash value at Maturity. Specified amount received by an insured at the end of an endowment period usually the face amount of the endowment policy, or by the owner of an ordinary life policy usually the individual insured who lives to a given age.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Ceded Premium Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the portion of written premium ceded to the reinsurance company as per the reinsurance contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cohort Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the Cohort Mapping Identifier.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Collected Fee Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the fees amount collected for the policy acquired in the natural currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Collected Tax Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the tax amount collected for the policy acquired in the natural currency. Examples of taxes collected are Premium Taxes in some jurisdictions Premium Tax is collected and paid to the province by administrators of funded and unfunded benefit plans, anyone buying insurance placed with an insurer not licensed in that stated, reciprocal or inter insurance exchanges. These are collected from the policyholders.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Commission Option Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the commission option selected for the policy. The commission description which correlates to the commission code or compensation plan which the original writing agents choose to be compensated by when the policy was sold. Sample values are OTHER is Other, UNKNOWN is Unknown, NOTRL is Full first year commission but no trails, FULLFRSTYR is Full First Year Commission rate with no Persistency or Expense Allowance payments from This policy, HEAPED is Heaped Levelized Commission Option, LVL is Level cash flow and trails, WRAP is No commissions i.e. wrap, REDFRSTYPERS is Reduced First Year Commission rate plus the policy counting for Persistency payment, REDFRSTYREXP is Reduced First Year Commission rate plus the policy is included in the Expense Allowance plan, REDFRSTYRNONE is Reduced First Year Commission rate with no Persistency or Expense Allowance payments included, RED is Reduced front end commission with trails, TRL is Trails Only high trail.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Common Chart Of Account Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the chart of accounts is a listing of the names of the accounts that a financial institution has identified and made available for recording transactions in its general ledger. A financial institution has the flexibility to define its chart of accounts as per requirement, including adding accounts as needed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Compounding Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to compounding frequency, which is used calculate interest income. Compounded interest is calculated only when the compounding frequency is <less than payment frequency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Compulsory Annuity Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates the compulsory annuity flag. Compulsory purchase annuities are bought with pension funds, everyone who has a private non state pension scheme was, until recently, required by the Government to buy a compulsory annuity with at least percent of their pension fund allowing for 25 percent to be taken as a cash free lump sum, as at June 2010 the Government is phasing this requirement out. These are called pension or retirement annuities. The main difference between voluntary and compulsory purchase annuities is voluntary purchase annuities are bought with personal savings, not pension scheme savings, or a capital lump sum, there are also tax differences. The capital lump sum used to buy a voluntary annuity can be the 25 percent tax free cash lump sum you are allowed to take from your pension fund. Voluntary purchase annuities can offer an alternative to putting your savings into a bank or building society. Putting your savings into a bank account means you can earn interest and you get your full savings amount back from the Bank when you die or close the account. However, the amount of interest earned is affected by rising and falling interest rates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Subject To Tax Aggregation Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the contract is subject to tax aggregation rules or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Whether an exposure belongs to hedging, trading, Investment book or Banking Book .",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contractual Riders Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "This is the flag indicating presence of riders on the policy. Riders are contingent additional benefits over a primary policy, available at an additional premium or fee, which come into play in case of a specific eventuality. They offer financial cover over and above basic sum assured in a life insurance policy. They need to be elected by the policyholder. Allowed List of values are Y which means riders are present or N which means riders are not present.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Country Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the country code associated with the account or instrument or party or location. There are several popular country codes as part of ISO 3166 standard published by the International Organization for Standardization. ISO 3166 defines codes for the names of countries, dependent territories, special areas of geographical interest and their principal subdivisions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Coverage Fund Paid To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date to which the coverage is currently funded.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Coverage Withdrawal Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date of converting from accumulation phase to withdrawal phase.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Deferred Premium Or Discount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the current Deferred Premium or Discount refers to Current non amortized deferred balance representing future income or expense such as premium or discount. Deferred Current Balance holds the discount or premium associated with an instrument. A discount loan or instrument is one with interest deducted from the face value of the loan at its origination. The discount amount is the difference between the loans current market price and its stated par value. The deferred current balance, which represents income, will be amortized over the life of the instrument according to a constant yield calculation. Therefore, as the instrument approaches maturity, the book balance approaches the face value or par balance. For discounted instruments, the deferred current balance is a negative balance. This indicates to the cash flow engine that the balance is income.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of fees accrued and outstanding for the current reporting period. Current fees may include over the limit fees, wire transfer fees, cheque book issued, bankers draft etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to current annualized gross rate of an account. This rate would be different in case of a consortium funding. When conventionally amortizing a records balance with the Model with Gross Rates option selected, the cash flow engine uses the current gross rate as the customer rate. If the option is not selected, then the cash flow engine uses current net rate as the customer rate for amortization calculation. Also to determine the prepayment rate, the current customer rate must be compared to the market rate. If the Model with Gross Rates option is selected, then the customer rate is represented by the current gross rate. If the Model with Gross Rates option is not selected, the current net rate is used as the current customer rate. When this is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Net Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Long",
                    "gcd": "Refers to the current interest rate or Current nominal interest rate is used to derive the interest cash flow, income or expense, that is due to the financial institution, referred to as net. All term accounts require a valid current interest rate. For non interest earning or bearing accounts, current interest rate equal to 0. For transaction accounts where the rate changes daily based upon average balances, current interest rate should be the spot rate at the time the extract program is run. For interest bearing accounts, current interest rate is greater than or equal to 0.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Static Spread",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the Static spread, as calculated from the as of date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Surrender Charge Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Stores Surrender charge Amount. Surrender Charge is the amount that would be assessed and deducted from the payout proceeds if the policy were completely surrendered on the As Of Date of the Policy. The rules for calculation differ depending upon the surrender charge and the surrender period as defined in the product master.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Tax Year Reportable Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Current Tax Year Reportable Amount. Contributions that may only be claimed for tax of the current year. Use Holding or As Of Date to determine the current tax year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Customer Information File Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the original CIF key for the account from the source Customer Information File system.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Customer Risk Tolerance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "This is the degree of risk, the customer is willing to take on investments in this account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Jurisdiction",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the mantas classification associated with this record. This can be a jurisdiction which represents geographical or legal entity monitoring on data restrictions. Values can be AMEA, INDV, CORP etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source system from where data is extracted. Data can be sourced from multiple sources, this column will Refers to the source code from where the data is extracted for this extraction date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Date Proof Of Death Submitted",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Date on which proof of death has been submitted. If the death has occurred on December 1, Insurer was notified of death on December 2 but a valid proof of death as per the law applicable in the jurisdiction was only submitted on December 3. So in this case December 3 is the Date on which the proof of death is considered to be submitted.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Day Count Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the day count indicator. Expected values are A/360, A/365, A/A, 30/360, 30/360 EUROPEAN, 30/A. Suggested default value are 1=30/360 for amortizing transactions OR 3=Act/Act. for non amortization.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Death Benefit Claimant Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code for the role on the contract for whose death the claim is made. This is usually used to determine who the death benefit is being claimed against the insurance company. This can either be the annuitant or the owner some cases same person. This differentiation allows financial institution to know which file to go to death benefit processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Death Notice Effective Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the Death Notice Effective Date, which refers to but is not limited to, the date the insurer received the information or gained knowledge of a death from confirmed source or record maintained or located in insurer records of the deaths reported. For example the insured may have passed on 1st Dec but if the insurance company was notified on 2nd December than 2nd December is the death notification effective date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Deferred Acquisition Cost",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Deferred Acquisition cost.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Deferred Commission Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the deferred commission. Deferred commissions and contingent deferred sales commissions are costs incurred at time of sale of an annuity. The process of recouping these costs is provided for in the annuity contract and is charged to the agent if the policyholder surrenders the contract, fully or partially, within the 1st year or any minimum period defined by the insurer for the product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Deferred Costs",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the deferred financing costs or debt issuance costs is an accounting concept meaning costs associated with debt issuing process, such as various fees and commissions paid to investment banks, law firms, auditors, regulators, and so on.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Deferred Fees Unamortized Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the current deferred fees amount, reflecting the unamortized portion. Fees that are amortized through the life of the loan such as Closing Fees or Amendment Fees.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Digital Wallet Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description",
                    "gcd": "Refers to the digital wallet address.\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Direct Or Assumed Insurance Indicator",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "Indicator",
                    "gcd": "Indicates if the insurance is a directly assumed insurance or not. List of values are D is direct insurance, A is Assumed. D will be used by entity in capacity of Insurance Company whereas A will be used by entity in capacity of Reinsurer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Disbursement Account Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Stores the type of account where the disbursement proceeds are to be deposited .",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discount Margin",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Discount Margin is average expected return earned over a given reference rate, that is additional to given reference rate, for a floating rate security. Column is applicable for instruments like Floating Rate Note. Refers to the margin or spread that must be added to discount rate obtained from interest rate curve to get the final discount rate that is used to calculate present value of an instrument. This is an optional input and is specified as a rate or price, see Discount Rate Margin Type.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Discount Rate Margin Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Indicates the form in which Discount Margin is given. Indicative Values are RATE, Rate Spread, PRICE, Price of instrument per 100. When it is given as PRICE then engine solves it to obtain a rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Dividend Added To Sum Insured Inception Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of Dividend paid to particular policy which has been used to increase the Sum Insured. Refers to the Sum Insured amount due to dividend payment since inception.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Dividend Added To Sum Insured Month Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of Dividend paid to particular policy which has been used to increase the Sum Insured. Refers to the Sum Insured amount due to dividend payment in a given month.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Dividend Payment For Premium Reduction Inception Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of Dividend paid to particular policy which has been used to offset against the premiums due on a policy from inception to date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Dividend Payment For Premium Reduction Month Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of Dividend paid to particular policy which has been used to offset against the premiums due on a policy from the beginning of the calendar month to the extraction date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Dividend Payment To Policy Funds Inception Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of Dividend paid to particular policy and credited to the policy fund instead of cash payment. Refers to the dividend amount paid on paid since inception.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Dividend Payment To Policy Funds Month Till Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of dividend paid to particular policy and credited to the policy fund instead of cash payment. Refers to the dividend amount paid on paid for a given month.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Earned Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the portion of fees amount earned due to the coverage provided by the insurance contract. The fees amount may be fully earned depending upon the insurance contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Earned Tax Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the portion of tax amount earned in the natural currency due to the coverage provided by the insurance contract. The tax amount may be fully earned depending upon the insurance contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Embedded Options Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the security has an embedded option within it. Embedded option refers to a provision in a security that is an inseparable part of the instrument. An embedded option is a special condition attached to a security, and in particular, a bond that gives the holder or the issuer the right to perform a specified action at some point in the future. An embedded option is part of another security, and as such does not trade by itself. Nevertheless, it can affect the value of the security of which it is a component. A security is not limited to one embedded option, as there may be several embedded options in one security.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Employee Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether an employee of the financial institution has a personal association on this account, either through a direct customer role or a family member relationship.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Employee Contribution Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Employee Contribution Amount. Amount of Salary contribution elected by the participant. When a participant applies for a salary reduction plan e.g. 401k, they specify the amount of their salary that will be contributed from each paycheck.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Employee Contribution Issue To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Employee Contribution Issue to Date. Total value of the employee contribution since the Holding was issued.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Employee Contribution Month To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Total of Employee Contribution Amount Month to Date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Employee Contribution Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the employee contribution percent, Percentage of Salary contribution elected by the participant. When a participant applies for a salary reduction plan e.g. 401 k, they specify the percentage of their salary that will be contributed from each paycheck.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Employer Contribution Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Employer Contribution Amount. Amount of contribution by the employer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Employer Contribution Amount Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "This is Employer Contribution Percentage. Percentage of contribution by the employer. In plans such as a Defined Benefit plan the employer and the employee make premium contributions to the fund in pre determined percentages.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Employer Contribution Issue To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Employer Contribution Issue to Date. Total value of the employee contribution from issue to date, to a qualified plan that requires both employer and employee contribution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Employer Contribution Month To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Employer Contribution Month to Date. Total value of the employee contribution from issue to date, to a qualified plan that requires both employer and employee contribution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Equity Credit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the equity credit for the account. This is calculated as the product of allocated equity and the equity credit rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Estimated Payout Age",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the estimated payout age, On Payout, it is used to identify the age at which the client intends to initiate the income stream. The Life expectancy of the annuitant is used to calculate the payout amounts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Excluded Payout Amount For Tax",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of the payout that is excludable from current income for the purpose of calculating income taxation. This property is mutually exclusive with the Payout or Exclusion Ratio element. That is, you may specify an exclusion amount or a ratio, but not both.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fatca Reporting Period End Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the FATCA reporting period end date. This date is the date on which the net worth is reported at the account level for FATCA purpose. This is used in conjunction with the column FATCA Reporting Period Net Worth Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fatca Reporting Period Net Worth Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the FATCA Reporting Period Net worth amount. This is the total net value of all assets associated with this account expressed in base currency as of the end of the last reporting period. This is the aggregate value of all holdings in this account, with a reduction for any margin loans or other debts owed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fatca Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the FATCA Status Code. List of values are INDETER  Indeterminate, RECALC  Recalcitrant, USP  US Person, NPFFI  Non Participating Foreign Financial Institution, PAS NFFE  Passive Non Financial Foreign Entity, ACT NFFE  Active Non Financial Foreign Entity, PFFI  Participating Foreign Financial Institution, EXC NFFE  Excepted Non Financial Foreign Entity, OWNER.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Federal Tax Withheld Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the federal tax withheld amount, On Payout, it indicate the TOTAL federal tax withholding..",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Federal Taxable Gain Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Federal Taxable Gain Amount. The amount of taxable gain that would be reported as taxable income, if the annuity were fully surrendered at the As Of Date. In the United Stated the Federal Taxes and State Taxes are reported and paid separately. It takes into account all prior withdrawals that may have affected the cost basis of the policy. Gains are any increase in the accumulated cash value of the contract due to interest credited to the account, appreciation of the value of the funds, in case of unit linked products, bonus credited less any cost basis that has already been taken as part of the previous withdrawals. On an annuity contract income tax is payable whenever there are disbursements made out of the contracts. In the United States calculation of taxable gain changes depending upon whether the annuity contract is qualified or non  qualified. In a non qualified contract only the gains are subjected to taxation but cost basis is exempt. In case of a qualified annuity the entire amount being withdrawn is considered as taxable. For Life insurance contracts death benefit payments are tax free. However, in case of surrender of the life insurance policy gains made on the contract become taxable.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fee Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the fees charged or paid by the Financial Institution in originating or acquiring the given instrument or account. Incase of investments, It Refers to the fee receivable i.e. current fee which has been assessed internally but not yet due to be charged for the account. It is used to calculate the Amortized Cost. If Amortized cost is not sourced in the Investments table, then it is derived from EOP balance + Current Deferred Premium Or Discount  Accrued interest  Fees  Deferred Fees Unamortized Amount. In case of bills, it refers to the fees charged by the financial institution in purchasing the bill and paying the amount to the exporter.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fee General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds fee amount. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fiduciary Losses Recovered",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total recoveries from the account for the loss incurred during fiduciary activities.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fiduciary Relationship Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account is held with the bank under a fiduciary capacity. Fiduciary capacity means trustee, executor, administrator, registrar of stocks and bonds, transfer agent, guardian, assignee, receiver, or custodian under a uniform gifts to minors act investment adviser, if the bank receives a fee for its investment advice any capacity in which the bank possesses investment discretion on behalf of another or any other similar capacity that the regulator authorizes. For example deposits that are placed with a bank by a national bank for which the bank is a fiduciary.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Free Look Up Provision Investment Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the Free Look Provision investment rule indicates how funds are to be invested during the Free Look period. List of values are O is Other, U is Unknown, I is Initial Allocation in Free look, G is Invest in General Account, S is Safe Harbor for Free look.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Free Look Up Reserve Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Free Look Up Reserve Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fund Lock Effective Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "The fund lock effective date, the date until which investments made in a fund comprising an investment option cannot be withdrawn. For e.g. In ULIP policies, it is 3 to 5 years.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fund Lock Expiry Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "This is the fund lock Expiry date, the date after which investments made in a fund comprising an investment option can be withdrawn. For e.g. In ULIP policies, it is 3 to 5 years.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Funding Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "This is the status of funding of the retirement account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "General Account Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the value as at a particular date for the separate accounts or funds multiple which the policy holder selects upon initial policy purchase and thereafter when the policy holder have the opportunity to change the selected funds that finance the policy.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "General Ledger Account Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique general ledger account code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Geography Risk",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the level of geographical risk associated with this account. List of values are in the range of 0 10 with increasing values denoting increasing risk levels.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Government Owned Retirement Plan Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "This Indicates whether a particular policy falls under any government owned retirement plans or not. List of values are y is yes and n is no. Example Employee Retirement Income Security Act ERISA in the USA.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Grace Period End Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the end date of the Grace Period. A grace period is a period immediately after the deadline for an obligation during which a late fee, or other action that would have been taken as a result of failing to meet the deadline, is waived provided that the obligation is satisfied during the grace period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Grace Period Start Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Start date of the Grace Period. A grace period is a period immediately after the deadline for an obligation during which a late fee, or other action that would have been taken as a result of failing to meet the deadline, is waived provided that the obligation is satisfied during the grace period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Gross Fee Income",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the fee income of the financial institution before offering any waivers. Fee income is charged for service rendered by financial institutions. Components that generate fee income include annual fee, over the limit fees, wire transfer fees, cheque book issued, bankers draft etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Gross Margin",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to contractual spread above or below pricing index applied to CUR_GROSS_RATE. However, cur_net_rate and cur_gross_rate would be different only in case of consortium funding. Otherwise, it would be the same. This is applicable for floating rate accounts, which are typically funded by a consortium. The current net rate = Applicable rate from the IRC Plus margin. This is used along with Current Gross Rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Gross Premium Amount From Issue To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Gross Premium Received Amount issue to date by the policyholder during the reporting period in natural currency, as of premium payment date. Gross Premium refers to the amount charged to the insured for the insurance procured. It is the premium after deduction of discounts, refunds and rebates of premium and commission if any but before deduction of any premium paid or payable by an insurer for reinsurance ceded, as well as before deduction of relevant and applicable tax by insured or insurance company to the respective government or regulatory authority.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Gross Premium Received Amount Inception To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Gross Premium Received Amount inception to date by the policyholder during the reporting period in natural currency, as of premium payment date. Gross refers to the premium paid by policy holder. It generally consists of net premium plus taxes plus expenses minus interest if any and minus reinsurance ceding if any.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Gross Premium Received Amount Month To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Gross Premium received from the beginning of the calendar month to the extraction date. Gross Premium refers to the amount charged to the insured for the insurance procured. It is the premium after deduction of discounts, refunds and rebates of premium and commission if any but before deduction of any premium paid or payable by an insurer for reinsurance ceded, as well as before deduction of relevant and applicable tax by insured or insurance company to the respective government or regulatory authority.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Gross Withdrawn Amount Inception To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Gross withdrawal amount inception to date before taxation, this is premature withdrawal from insurance policy. Taxation of premature withdrawals. Withdrawals taken before permissible age say 59 and half in the US, it may be subject to a penalty.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Gross Withdrawn Amount Month To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Gross withdrawal amount month to date before taxation, this is premature withdrawal from insurance policy. Taxation of premature withdrawals. Withdrawals taken before permissible age say 59 and half in the US, it may be subject to a penalty.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Guaranteed Interest End Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to guaranteed interest end date. The date through which the guaranteed interest rate is applicable. A fixed annuity that has an interest rate guarantee for the same period of time as its surrender period. For example, an annuity with a guaranteed interest rate of 5 percent per year for five years, where there are no surrender penalties after five years. Some offer a higher rate the first year, and a lower, but guaranteed rate, for all subsequent years of the surrender period – e.g. 8.5 percent first year, with a guaranteed renewal at 4 percent for years 25 for a blended average of 4.88 percent per year for five years. The key feature is that you know what interest rate you get for the entire surrender period, and for this reason we ONLY recommend Multiyear Guarantee Annuities.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Guaranteed Lifetime Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to Guaranteed Rate of Return. The guaranteed lifetime interest rate. This is the interest rate that the insurer has guaranteed on the contract throughout the lifetime of the contract regardless of the prevailing interest rate in the market.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Guaranteed Rate Of Return",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the payout amount is based upon the guaranteed rates of a particular product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Hedge Portfolio Set Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique hedge portfolio set code or Hedge identification number, hedge ID, under which this account is covered.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holiday Display Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holiday calendar code as per the holiday calendar defined through the UI.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holiday Rolling Convention Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holiday rolling convention code, based on which the date on which cash flow has to happen is decided. This includes  Following business day, Modified following business day, Previous business day, Modified previous business day etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Individual Retirement Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to identify if the account is an Individual Retirement Account , IRA, .List of values are Y for Yes and N for No.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Individual Retirement Account Funding Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code to identify whether the account is in contribution or disbursement mode.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Initial Life Administration Charge",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the charge that is associated with a Annuity product category which will be charged to the policy holder upon the first year of the policy contact life.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Initial Premium Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the initial premium amount, this amount is the calculated initial premium required to put the policy or rider in force. This is not meant to reflect any payments applied towards satisfying the initial premium. Actual premium that has been paid can be found on the financial activity. Payment amount is not intended to reflect the required initial premium. It is possible for someone to pay nothing in the first year due to the rollover amounts, CWA Amt etc. So the payment amount on the policy would not indicate what the actual initial premium amount would be.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to a unique Code representing a particular Instrument. This code can be ISIN Code, CUSIP, SEDOL etc. Instrument Contract dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of instrument type, which is defined as code identifying the instrument category of the customer account. Instrument Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Insurance Class Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the code which identifies the general liability nature of business for the insured. The source of this code list is the Insurance Services Office Commercial Lines Manual , also known as CLM, or individual insurer rate manuals.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Insurance Group Rounding Rule Method Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is Group rounding rule method Code. Identifies whether the calculated value will be rounded off or truncated. Possible values include ROUND UP , ROUND , TRUNC.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Insurance Latest Notice Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the type of the latest notice sent by the insurer to the policyholder. Sample values are OTHER is Other , UNKNOWN is Unknown , CONFIRM is Confirmed , PREM1 is First Premium Notice , PREM4 is Fourth Premium Notice , FLEXGRACE is Grace notice for flexible premium COI , GRACE is Grace period notice expiration , INITIAL is Initial Invoice , LAPSE is Lapse Notice , FLEXLAPSE is Lapse notice for flexible premium COI , LOANINT is Loan interest notice , PREMREM is Premium Reminder , REBILL is Rebilled Invoice , PREM2 is Second Premium Notice , PREM3 is Third Premium Notice , FLEXWARN is Warning notice for flexible premium COI.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Insurance Sponsoring Plan Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the type of Sponsored Benefit plan to which this Policy belongs. Sample values are OTHER is Other , UNKNOWN is Unknown , ESLTC is Employer Sponsored Long Term Care , SEWBP is Single Employer Welfare Benefit Plan. Employer Sponsored Benefit Plans are funded by companies on behalf of their employees as a part of a comprehensive package of benefits for their staff. The employer makes a large contribution to the insurance premiums for the employees and their dependents. The employees, if electing coverage, must cover the remainder of the premium.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Insurance Valuation Class Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is valuation class type code. Identifies basic type of insurance. Valuation Class Type is needed to identify the product category used to determine policy reserves assembled in exhibits in the Annual Statement. Such exhibits provide reserves by type of coverage including life insurance, annuity, supplementary contracts with life contingencies, etc. possible values are ACCIDENTONLY is Accident Only, COLLECTRENEW is Collectively Renewable etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Insurance Withdrawal Rule Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "The rule that should be followed when a client requests a partial withdrawal. Possible values are Greater of Two Rule, in Max.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Insured Attained Age",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "The age attained of the annuitant in months. Attained Age is the number of months since the date of birth of annuitant till current date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Accrued Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the accrued interest amount associated with the contract. This is the interest that has accumulated on an instrument since the last interest payment up to, but not including, the settlement date. Accrued Interest is defined as Interest earned but not received, realized. For example, bonds usually pay interest every six months, therefore interest accrues between one interest payment and the next. The buyer of a bond pays its market value plus the interest earned up to the settlement date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Accrued General Ledger Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the GL code corresponding to the ledger account that holds accrued interest amount. Accrual of interest is required to report as on date due should the customer choose to close the account prematurely. The accrued interest is liquidated on the installment payment date until to the account. If the installment is received the interest is accounted as received, if delinquent the interest is capitalized to the principal  with the increase in principal the interest will start to accrue on the increased principal. If the account is in default, prolonged delinquent, the interest accrual is suspended on the account. General Ledger Account Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Amount Available For Withdrawal",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of interest available for withdrawal that does not include any surrender fees or charges. .",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Calculation Method",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the method of computing interest. Expected values are Simple and Compounded.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Earned Amount Inception To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Interest Earned amount inception to date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Earned Amount Month To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Interest Earned amount month to date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Expense",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the interest expense incurred for the account by the financial institution during the current month to till date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Payment Method Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the method of paying interest in account as whether interest is paid by cheque or deposited to saving account directly or capitalized to the principal.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the interest rate code that identifies the index to which adjustable rate accounts are tied. Transfer Pricing references interest rate code when calculating option costs and uses the relevant interest rate from the defined interest rate code, IRC, together with the margin to determine the reprice rate for the instrument. The value populated in this column for each account record must be synchronized with the actual interest rate code values defined in Transfer Pricing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the type of interest rate paid on this transaction., For instance Fixed Or Floating.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Timing Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of interest timing. if the interest accrual is in advance or in arrears. If the value is selected as Arrears than interest payments are paid at the end of the payment period along with the principal payments. If the value is selected as Advance than Interest payments are paid at the beginning of the payment period starting from the origination date. Payments are made on every payment date except for the Maturity date. Expected values are ARR, Interest In Arrears, ADV, Interest In Advance, or SIA, Set In Arrears. For repo it can be defaulted to ARR.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Intragroup Exposure Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the policy is between two entities belonging to same group and Refers to Y if it is treated as an Intergroup transaction else N. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Issue Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Date on which the account was originated or issued by the originating institution. For accounts originated by the current institution, ISSUE DATE is equal to ORIGINATION DATE. For accounts acquired through acquisition of another institution, or purchase of a pool of accounts, ISSUE DATE less than ORIGINATION DATE. If ORIGINATION DATE from the original institution is not available, ISSUE DATE is equal to ORIGINATION DATE. ISSUE DATE less than or equal to ORIGINATION DATE, ISSUE DATE cannot be greater than ORIGINATION DATE.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Issuer Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the issuer code for the financial instruments. Issuer is defined as a legal entity that develops, registers and sells securities or financial instruments. Issuers may be domestic or foreign governments, corporations or investment trusts. Issuers are legally responsible for the obligations of the issue and for reporting financial conditions, material developments and any other operational activities as required by the regulations of their jurisdictions. The most common types of financial instruments issued are common and preferred stocks, bonds, notes, debentures, negotiable instruments, bills and derivatives.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Item Processing Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the item processing expense. This is typically a set expense for the type or item. Processing expenses are usually the expenses associated with creating or opening an account or contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Joint Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the account is jointly held by two or more individuals which means if the value is updated as Y the account is held by two or more people and if the value is updated as N the account is held by single entity.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Joint Life Attained Age",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "This is the Joint attained age. Attained Age is the number of months since the date of birth of annuitant till current date. Joint attained age is the attained age of the joint lives. In case of Joint policies the insurance companies base their policy dates like maturity dates and payout dates on Joint Attained age.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Joint Life Sex Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to sex of the joint life. List of values are  M : Males, F : Female.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Jurisdiction Tax Withheld Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Jurisdiction Tax Withheld amount, it indicate the TOTAL state tax withholding.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Cost Of Insurance Charged Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the Date Last Cost of Insurance and Expenses were charged. Associated with the Last Cost Of Insurance and Expense amounts. Generally applicable to life insurance policies such as variable and universal life, cost of insurance charges are monthly charges for mortality, administration, and other aspects of expenses on the part of the life insurance company.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Deposit Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount that was deposited in the account in the immediate past. Deposits in the account may include the amount deposited in the account like salary credited, interest on the balance credited etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Deposit Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the immediate past date on which a deposit was made to the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Payment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the immediate past date on which the payment was made to the account. For a repo contract this will generally be same as origination date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Premium Payment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "This is the immediate past date on which the premium was paid by the policy holder.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Premium Received Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Last Premium Received amount. Amount of last payment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Reprice Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the adjustable instruments last repriced or the date on which the current interest rate changed. For a repo contract this will generally be same as origination date. For an adjustable rate straight term transfer priced record, Transfer Pricing uses the Last reprice date to identify the assignment date, Yield Curve Date. The assignment date of the Interest Rate Code just before, or equal to, the last reprice date of the record is used as the transfer pricing yield curve. For example, if the last reprice date of the record is 15th Jan 2006 and the Historical Rate interest rate code, IRC, is defined at monthly intervals and only at month end, the assignment date would be 31st Dec 2005. The reprice frequency is then matched to the same term on the transfer pricing yield curve, IRC, defined in the Historical Rates in Transfer Pricing. For fixed rate records, the last reprice date and next reprice date are not referenced. Origination date and maturity dates are used instead. This column has been added to support Tiered Balance Interest Rates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Repricing Date Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the balance as on Last Reprice Date when transfer pricing adjustable rate records. When transfer pricing adjustable rate records, Last Reprice Date BALANCE is used as the starting balance from the LAST_REPRICE_DATE. It will same as EOP Balance for a repo contract.\nIf payments, amortization, occurred in between the Last Reprice Date and the extract period, the end of period balance of the record is smaller than it was on the LAST_REPRICE_DATE. Therefore, in order to provide an accurate balance amount at the time of the Last Reprice Date, the Last Reprice Balance has been provided.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Statement Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the immediate past date on which the last account statement was generated on this account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Sum Insured Modification Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "This is the Last Sum insured modification Date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Withdrawal Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount that was withdrawn from the account in the immediate past. Withdrawal can be done from the account in any form like amount transferred to other account, cash withdraw from account etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Last Withdrawal Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the immediate past date on which customer has withdrew from the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Legal Entity Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the entity code of the legal entity to which the account will be attributed in the general ledger.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Letter Of Intent OR Rights Of Accumulation Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to LOI or ROA Amount. The amount the client has committed to under the LOI or ROA agreement. Letter of Intent or Rights of Accumulation Commitment end date. As per www.finra.org, A right of accumulation, ROA, allows investors to aggregate their own holdings as well as the holdings of certain related parties, such as spouses and children, toward achieving the investment thresholds at which breakpoint discounts become available. An investor may sign a Letter of Intent, LOI, which allows the investor to receive breakpoint discounts based upon a commitment to buy a specified number of mutual fund shares over a period of time, usually 13 months. For example, an investor who plans to buy UDS 25,000 worth of shares in a particular mutual fund over the course of a year, but in 5 increments of USD 5,000 could sign a letter of intent pursuant to which the investor could obtain the breakpoint discount available on purchases of USD 25,000 on each USD 5,000 purchase. Thus, signing an LOI allows the investor to take advantage of discount that would not otherwise be available.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Letter Of Intent OR Rights Of Accumulation Commitment End Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date of LOI or ROA Commitment ending date. Letter of Intent OR Rights of Accumulation Commitment end date. As per www.finra.org, A right of accumulation, ROA, allows investors to aggregate their own holdings as well as the holdings of certain related parties, such as spouses and children, toward achieving the investment thresholds at which breakpoint discounts become available. An investor may sign a Letter of Intent, LOI, which allows the investor to receive breakpoint discounts based upon a commitment to buy a specified number of mutual fund shares over a period of time, usually 13 months. For example, an investor who plans to buy USD 25,000 worth of shares in a particular mutual fund over the course of a year, but in 5 increments of USD 5,000 could sign a letter of intent pursuant to which the investor could obtain the breakpoint discount available on purchases of USD 25,000 on each USD 5,000 purchase. Thus, signing an LOI allows the investor to take advantage of discount that would not otherwise be available.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Letter Of Intent OR Rights Of Accumulation Number Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to LOI or ROA reference Number type code. Used to define what type of id is being provided as the key or code for this Letter Of Intent or Rights of Accumulation LOI or ROA agreement.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Letter Of Intent OR Rights Of Accumulation Reference Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to LOI or ROA reference Number. The reference id of the Letter Of Intent or Rights of Accumulation LOI or ROA agreement.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Letter Of Intent OR Rights Of Accumulation Reference Type Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates LOI or ROA reference Type Flag. Identifies if a Letter of Intent, LOI, or Rights of Accumulation, ROA, applies to the product. LOI applies to a single contract  letter of intent would indicate the initial dollars and the dollars intended within the carriers guarantee period. ROA is determined on the assets held with the carrier across multiple contracts and LOBs. Based upon the Total Amount of the LOI or ROA, the customer would get the sales charge rate, or the accumulation rate bonus, for the intended amount. If the value is NULL or Unknown, then neither LOI nor ROA are allowed. List of Values \nL  Letter of Intent \nR  Rights of Accumulation\nB  Both Letter of Intent and Rights of Accumulation\nO  Other\nU  Unknown.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Line Of Business Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to line of business, LOB, is a functional unit that offers the products to the customer by the financial entity. Example: Corporate Finance, Trade Services, Private Wealth Management, Treasury Services, Retail Banking, Cards services etc. Refers to the unique code of the line of business applicable to the respective product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Location Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique location code. Location code is defined as the code which will represent the address of the property from zip code onwards like which city, country etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Locked Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if deposit funds are locked in or not locked in. For example, funds cannot be redeemed until retirement or a Rate Lock applies for a fund. If TRUE, then locked in. If FALSE, then not locked in. List of Values Y is Yes, N is No.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mandatory Disbursement Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "This is the date when the disbursements to the account should begin as per the law.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mantas Account Holder Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Mantas defined internal or external customer type that uses this account. This will be used for identifying Mantas defined customer types relevant to financial crime compliance based on set of rules. Expected values are  CR - Retail Customer CI - Institutional Customer IA - Investment Advisor CO - Correspondent Financial Institution EE - Employee or Family Member FP - Firm Trading FO - Firm Owned, Non-Trading FA - Firm Administrative FE - Firm Error or Suspense DC - Clearing Organization IS - Issuer or Writer.\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mantas Control Group Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "This is the control group code used to identify a control group with which this account is associated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margin Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the margin is the contractual spread that is added to the pricing index and results in the financial institutions retention, net, rate, for adjustable rate accounts. It is used as current net rate = Applicable rate from the Interest Rate Curve Plus margin. The gross rate, CUR_GROSS_RATE, is equal to the index to which the record is tied to plus a spread, which is defined by the MARGIN_GROSS field.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Price",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the most recent price at which an instrument has traded. It can be the bid or ask price that buyers and sellers were able to agree on. Generally this information is available with market data but in cases of OTC instruments like floating rate notes it may not be available with market data. Hence needed here. Column is applicable for instruments like Floating Rate Note. In case of bonds and stocks, Refers to the market price. In case of mutual funds, Refers to the net asset value, NAV.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Segment Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the code of the market segment to which the customer belongs.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Value Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the captures the date on which the market price is evaluated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maturity Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount to be referred to on the maturity date, for generating cash flows. This is specifically introduced for Annuity. Specified amount received by an insured at the end of an endowment period usually the face amount of the endowment policy, or by the owner of an ordinary life policy usually the individual insured who lives to a given age.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maturity Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the contractual date on which the principal balance is expected to fully amortize and the balance payable would be nil. This is applicable for term loan products but not for revolving credit or overdraft type of account. In case of insurance policy, for some whole life insurance products the maturity date is aligned to maximum attained age and the policy is payable upon the earlier of the maturity date or the death of the insured. In case of Term Life insurance policies the maturity date is determined as policy issue date plus Term of the contract. In case of an annuity it is the date from which the annuitant has chosen to take the payouts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Maximum Age For Premium Payable",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the age to which premiums are paid in a fixed plan. In a flexible premium plan the maximum age to which premiums can be accepted.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Minimum Premium Initial Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Minimum Premium Initial Amount required to continue the policy in force. Modal or annual premium may or may not be equal to the Minimum Premium Amount. For example, Minimum Premium Initial Amount could be three months worth of monthly premiums, which may be far less than Modal or annual Premium Amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Miscellaneous Cash Value Adjustments Inception To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Miscellaneous Cash Value Adjustments Inception to Date. These are adjustments that are not shown under any other heads. Any additional credits or charges that would apply when calculating the gross total for a given policy value since the inception of the policy.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Miscellaneous Cash Value Adjustments Month To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Miscellaneous Cash Value Adjustments Month to Date. These are adjustments that are not shown under any other heads. Any additional credits or charges that would apply when calculating the gross total for a given policy value for a given month.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Modal Premium Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Modal premium calculated for the policy at the inception in Natural currency. An insurance company comes up with many premium payment options. Premium can be paid monthly, quarterly, semi annually and annually. in cases where premium is paid as installment then one pays extra premium ranging from 3 to 5 percent depending on the span of payment. For example if annual premium is 2400 USD if paid annually, and for monthly it could be 205. Customer can populate either annualized premium amount or modal premium amount as per use cases.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Net Premium Received Amount Inception To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Net Premium Received Amount inception to date by the policyholder during the reporting period in natural currency, as of premium payment date. Net premium is the expected present value of a policy’s benefits less the expected present value of future premiums. The net premium calculation does not take into account future expenses associated with maintaining the policy.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Net Premium Received Amount Month To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Net Premium Received Amount month to date by the policyholder during the reporting period in natural currency, as of premium payment date. Net premium is the expected present value of a policy's benefits less the expected present value of future premiums. The net premium calculation does not take into account future expenses associated with maintaining the policy.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Net Withdraw Amount Issue To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Net withdraw amount Issue to date. The net cumulative total policy withdrawals taken since issue. This is a net amount that does not include surrender charges, loans, loan interest, or any other misc. cash.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Net Withdrawal Amount Inception To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the net cumulative total policy withdrawals taken since issue. This is a net amount that does not include surrender charges, loans, loan interest, or any other misc. cash value adjustments.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Net Withdrawal Amount Month To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the net withdrawal amount month to date after taxation, this is premature withdrawal from insurance policy. Taxation of premature withdrawals. Withdrawals taken before permissible age say 59 and half, it may be subject to a penalty tax.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Next Payment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the Due date of the next scheduled payment. Otherwise known as cash flow date or date of runoff. Otherwise known as cash flow date or date of runoff. NEXT PAYMENT DATE is used to define the next scheduled, forecasted, payment date. If REMAINING NO PAYMENTS > 1, NEXT PAYMENT DATE < MATURITY DATE, If REMAINING NUMBER OF PAYMENTS = 1, NEXT PAYMENT DATE = MATURITY DATE. If next payment date is unknown, set to either: CALENDAR PERIOD + PMT FREQ, or MATURITY DATE.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Next Premium Payment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the next premium payment is due. This is normally calculated as last premium date + premium frequency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Next Reprice Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which interest rate will be reprice for the instrument. It is applicable for adjustable rate accounts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notification Letter Suppression Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether the account information change letter has been suppressed for this account means the customer does not want to receive notification for the changes done on the account. If the Y, then the customer should not be notified of changes to account information such as address or phone number and if the value is N means the customer should be notified of any changes on the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Offer Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the offer. An offer is defined as an abstract, physical and or monetary benefit attached to a product for a predetermined period of time with a view to increase the sales of a product. Offer dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Office Of Foreign Asset Control Reason Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Indicates the OFAC reason indicator for this account. List of valid values are: O OFAC Freeze, P  Patriot Act Freeze, V  Patriot Verification, F  Systematic CIP Freeze, D  Compliance CIP Override and N  Registered Principle. Office Of Foreign Asset Control, OFAC, is defined by the department of the U.S. Treasury that enforces economic and trade sanctions against countries and groups of individuals involved in terrorism, narcotics and other disreputable activities.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Onerous Classification Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Onerous Classification code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Open Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Indicates if the account is open. Accounts are in open status for all active accounts and accounts in dormant state. Account is considered to be closed if the account has reached maturity date with Nil end of period balance or if the customer has prematurely closed the account in the case of fixed term accounts or has notified in writing for closure of the account in the case of CASA or Overdraft account. \nA CASA or OD type of account can have a Nil end of period balance and still be open.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Organization Unit Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the cost center to which the account belongs to. Organization Unit dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Deferred Premium Or Discount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the original premium or discount which is the original non amortized income or expense, such as premiums or discounts. Unamortized income or expense are the unrealized on the account and would begin to accrue after issue of the security. The discounted bonds sells at a price lower than the par value and would amortize to mature at par. Likewise, the premium bond sells at premium over the par value of the bond as it may be offering a higher coupon rate compared to market. The premium paid amortizes over the period to mature at par value on the maturity date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Gross Par Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the par balance at the time of origination. Original par balance represents the starting balance from which all fixed rate transfer pricing cash flows are generated, including principal run off, prepayments, and interest cash flows. ORG_PAR_BAL = ORG_BOOK_BAL  DEFERRED_ORG_BAL .",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to contractual interest rate at origination date whereas the interest rate field would store the interest rate applicable to the instrument as on As of Date. This is used for computing Effective Interest Rate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Market Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to market value of the instrument as of origination date. Generally, this would be same as the End of period balance as on the origination date. Market value is what investors believe a stock is worth, the price is determined by the market demand and supply basis. A stock can be benchmarked against a price during the trading day  however, the same method of evaluation has to be maintained consistently.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Net Book Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the original net book value  net of participations. Percent Sold is a column used to calculate net balance when the instrument is partially participated out to another financial institution. In the case of a participated loan, the bank partially owns the loan. A bank would participate out the balance of the loan to another financial institution if it was not able to lend the entire amount or if lending the entire amount would exceed the banks legal lending limits. By selling most of the financing to another financial institution, the bank would earn fee income from servicing the loan and would be able to retain other banking relationships, such as checking accounts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Net Par Balance",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the par value net of participations at date of origination. Percent Sold is a column used to calculate net balance when the instrument is partially participated out to another financial institution. In the case of a participated loan the bank partially owns the loan. A bank would participate out the balance of the loan to another financial institution if it was not able to lend the entire amount or if lending the entire amount would exceed the banks legal lending limits. By selling most of the financing to another financial institution the bank would earn fee income from servicing the loan and would be able to retain other banking relationships such as checking accounts. In case of accounts with tiered interest rate this amount is required for each tiered separately.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Next Payment Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Store the next payment date is the due date of the next scheduled payment. Otherwise known as cash flow date or date of runoff. Original next payment date Refers to the next payment date from the account start date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Payment Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to payment amount at the date of origination. Cash flow transfer pricing methodologies for fixed rate records use original payment amount as the payment amount for amortization purposes. For a fixed rate record, the cash flow engine rolls forward from the origination date by payment frequency when defining payment dates up to the maturity date of the record. From origination, the cash flow engine amortizes the original balance by the original payment amount. The precise method of this amortization depends on the amortization type code. Original payment amount is also used if the User Defined Payment Pattern payment method percent Original Payment is designated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Policy Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the original contract number held by the source system. If there are multiple source systems without unique contract numbers, we expect the contract number and source system to be concatenated as part of the primary key, while this term will store the original contract number which as generated by the source system.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Original Sum Insured",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the original sum insured amount as of the policy issue date, the changes due to contract agreement or dividend payout or contractual obligation, sum insured will be changed from its original amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Term",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to contractual term as on origination date. Original Term is used in conjunction with original term unit to define the contractual term at origination date. Transfer Pricing cash flow methodologies use original term when calculating the current payment for adjustable rate accounts and in transfer pricing fixed rate accounts. For adjustable rate accounts, the cash flow engine compares original term against amort term, checking to see if the account is a balloon type account. If original term < amort term, the engine recognizes the record as a balloon. The cash flow engine amortizes the outstanding principal balance over the calculated number of payments, based upon the amortization maturity date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Term Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the unit of the original term such in D days, M months or Y year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Origination Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the Date on which current institution originated or acquired the instrument. For rolled instruments the greater of date last rolled or date acquired.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Other Acquisition Expense Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the acquisition expenses in natural currency incurred by the insurance company to acquire the Business other than report cost, commission amount, field supervision amount, and collection expenses.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Other Processing Expense",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the other account expenses. This is a catch all bucket to capture all the miscellaneous expenses for which no specific head exists.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Outstanding Deferred Premium Tax As Of The Valuation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the outstanding deferred premium tax. When a policy is set up in the admin system the deferred premium income is calculated as income to be earned by the insurance company over the life of the policy. Similarly there will be premium tax associated which is remitted to each state for example. As such the outstanding deferred premium tax is the amount still to be recognized over the life of the policy.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Ownership Category Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code for Ownership Category. Ownership Category dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Ownership Of Fund Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Indicates that this is a compulsory purchased annuity that is purchased under the Retirement Annuity Fund or purchased under the rules of GN18. Ownership of Pension Funds, List of Values are F  Purchased Under Retirement Annuity Fund, M  Purchased under Rules of GN18. GN18 is the certification of Loss Reserves for the Non Admitted Insurers Information Office.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Ownership Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the organization defined code for the ownership type of the account. Expected values are IND  Individual, JOINT  Joint Tenant or Community Property, TRUST  Trust, CUST  Custodian, CORP  Corporate, FIRM  Firm Owned and OTHER  Other.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Change Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the frequency at which the payment adjusts. This is used to compute current payment for negatively amortized accounts and is not applicable for fixed term accounts. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Change Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the units D days or M months or Y years of Pmt_chg_freq. This column is part of the loan contract that will be drawn against the commitment and is applicable only for rate lock commitment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Decrease Cycle",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum payment decrease allowed during the payment change cycle of an adjustable rate instrument. \nTransfer Pricing cash flow methodologies reference payment decrease cycle when recalculating the current payment for negative amortization events such as negative amortization limit, payment adjust date and payment change frequency and is relevant for negatively amortizing accounts. \nFor negative amortization type accounts, the cash flow engine uses payment decrease cycle to calculate the maximum decrease in the payment amount allowed from the previous payment change to the next.\n\nPMT_DECR_CYCLE is defined in terms of a percentage. The engine performs the following check:\nPrevious Current Payment  Newly calculated payment >, PMT_DECR_CYCLE Divided by 100 * Previous Current Payment,\nIf the newly calculated payment satisfies the above equation, the engine limits the decrease to the amount =, PMT_DECR_CYCLE * Previous Current Payment.\nFor example, if PMT_DECR_CYCLE = 5.00, the calculated current payment is not allowed to decrease by more than 5 Percent of the previous current payment. If PMT_DECR_CYCLE = 0, the cash flow engine assumes that there is no payment decrease limit per payment change period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Decrease Life",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum payment decrease allowed during the life of an adjustable rate instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Payment frequency is used in conjunction with PAYMENT FREQUENCY UNIT to define the payment frequency of an account. Using this, the Next Payment Dates are calculated. For a repo since there is only one payment at maturity, this column can be defaulted to number of days between Maturity and Original date. \nTransfer Pricing Application cash flow methodologies reference PAYMENT FREQ for calculating and processing payments and prepayments. The engine forecasts future next payment dates by incrementing NEXT PAYMENT DATE forward by PAYMENT FREQUENCY. PAYMENT FREQUENCY is referenced by the cash flow transfer pricing methodologies when deriving discounted cash flows. PAYMENT FREQUENCY > 0 in all cases. PAYMENT FREQUENCY = 0 can cause incorrect calculations to occur. Note that PAYMENT FREQUENCY = 1 and PAYMENT FREQUENCY MULT = D requires the cash flow engine to perform cash flow calculations for every day of the modeling horizon.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Payment frequency unit is used in conjunction with PAYMENT FREQUENCY to define the payment frequency of an account. Expected values are D Day, M Month and Y Year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Increase Cycle",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum payment increase allowed during a repricing cycle on an adjustable rate instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Increase Life",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum payment increase allowed during the life of an adjustable rate instrument.\nCash flow methodologies of Transfer Pricing application, reference payment increase cycle when recalculating the current payment for negative amortization events such as negative amortization limit, payment adjust date and payment change frequency.\n\nFor negative amortization type accounts, the cash flow engine uses payment increase cycle to calculate the maximum increase in the payment amount allowed from the previous payment change to the next.\n\nPMT_INCR_CYCLE is defined in terms of a percentage. The cash flow engine performs the following check:\nNewly Calculated Payment  Previous Current Payment >, PMT_INCR_CYCLE Divided by 100* Previous Current Payment,\nIf the newly calculated payment satisfies the above equation, the cash flow engine limits the increase to the amount =, PMT_INCR_CYCLE * Previous Current Payment.\nFor example, if PMT_INCR_CYCLE = 5.00, the calculated current payment is not allowed to increase by more than 5 percent of the previous current payment. \n\nIf PMT_INCR_CYCLE = 0, the cash flow engine assumes that there is no payment\nincrease limit per payment change period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payout End Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the Payout date on which payments are scheduled to end.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payout Levelized Frequency Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the payout levelized frequency type. Income Payments are calculated at inception of the contract and will not vary until the payment is next levelized. For example, income payments are calculated annually at the beginning of each annuity year and will not vary during an annuity year. Each income payment paid monthly, quarterly, semi to annually or annually will remain level during an annuity year, but may increase or decrease the next annuity year. An Assumed Interest Rate is selected for the levelization calculation. Sample values are ANNUALCAL is Annual Calendar, ANNUAL is Annual or Annually, ANY is Any Pay mode is allowed, BIWKLY is Bi to Weekly every two weeks, OTHER is Other,EVERY10MTHS is Every 10 months, UNKNOWN is Unknown,4WKLY is Every 4 weeks 4 weekly, OLIPAYMODEELEVENTHLY is Payments made 11 times per year. OLIPAYMODETHIRTTEENLY is Payments made 13 times a year, OLIPAYMODEFOURTEENTHLY is Payments made 14 times per year., OLIPAYMODESIXTEENTHLY is Payments made 16 times a year, OLIPAYMODEEIGTHTEENLY is Payments made 18 times a year, OLIPAYMODENINETEENLY is Payments made 19 times a year, OLIPAYMODETWENTYLY is Payments made 20 times a year, OLIPAYMODETWENTHFIRSTLY is Payments made 21 times a year, OLIPAYMODETWENTYSECONDLY is Payments made 22 times a year, OLIPAYMODETWENTYEIGHTHLY is Payments made 28 times per year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payout Levelized Option Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the payout Levelized Option type, is used with Levelization Frequency to specify the mode for levelization. Sample values are LEVELIZEDOPTANN is Levelization Annual, LEVELIZEDOPTFLOOR is Levelized Payment Floor, LEVELIZEDOPTSTEPUP is Levelized Payment Floor with Step to up, LEVELIZEDOPTNOT is Not Levelized, OTHER is Other, UNKNOWN is Unknown.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payout Start Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the Payout Start Date is the first date the disbursement will be or was made. This date is also referred to as the Income Start Date or Payment Start Date. The date payments will start may be defined by the carrier, it is not required on a new business transaction or message. This property does not define the Annuity Starting Date, or the contract effective date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payout Status Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Payout Status type. Sample values are OLIHOLDSTATACTIVE is Active the Holding is in force, OLIHOLDSTATDORMANT is Dormant to Suspended, OLIHOLDSTATINACTIVE is Inactive Terminated, Lapsed or expired, OLIHOLDSTATPROPOSED is Proposed to Pending to Not yet in force, OTHER is Other, UNKNOWN is Unknown..",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payout Taxable Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the payout taxable amount. The portion of the modal payout amount that is subject to current income taxation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Acquisition Fee Expense Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "The Expenses incurred towards fees for acquiring policy in the natural Currency. Examples of Fee expenses incurred are payments made for procuring of reports required for underwriting, remuneration paid to producer or agents in lieu of commissions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Acquisition Tax Expense Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the amount of tax charge pertaining to the policy acquired in the natural currency. Examples of such taxes are Premium Tax, Goods and Services Tax.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Admin Charge Fee Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the policy administration charges. These charges are applied on policy directly.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Anniversary Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "This is the policy Anniversary Date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Cancellation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "This is the date on which the termination of an insurance contract or bond, before its expiration, by either the insured or the insurer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Unique identifier of the currency code in which the account is represented. ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alphanumeric. This is the standardized currency code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Effective Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "This is the policy effective date, the explicit meaning of which is implied by its parent or its usage.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Exchange Reason",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the Exchange Reason Code, it is used when only a single exchange reason is needed. If multiple reasons for the exchange must be expressed, use Exchange Reason aggregate instead. Sample values are Other, Levelized Payment Floor , Brokers Direction , Communications , Fees , High Interest Rate , Higher reward, Inappropriate Investment , Investment Options , Investment Performance , Living Benefit Accumulation Feature , Living Benefit Income , Living Benefit Withdrawal , Product Features , Reduce Market Risk, Service.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Form Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the Policy Form Number for this Coverage, as filed with the State in the U.S. or other appropriate regulating jurisdiction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Identifier",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the unique identifier of the policy held by the customer. An insurance policy identifier or number is a unique identifier provided by insurance company which is used to identify particular contract between insurance company and policyholder wherein insurance company accepts to cover specific risks in return of premium payments by policyholder as per terms and agreements. The policy number can be referenced from policy document and needs to be quoted with all communication with insurance company.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Policy Issue Country",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "This is Policy Issue country.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Issue Location Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the Policy Issue Location Code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Issue State",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Stores Policy Issue State. In countries like the United States where different states have different regulations for insurance the laws of the issue state apply for governance of the policy.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Lapse Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "This is date on which the policy has lapsed. Generally a policy would lapse at the grace period end date plus one day, if renewal premiums are not received. However for operational purposes the insurer may have a different lapse date set.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Lapse Reason Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This refers the code for policy lapse reason. It usually occurs because one party fails to act on its obligations or one of the terms on the policy is breached. For example, an insurance policy will lapse if the holder does not pay the premiums.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Purchase Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "This is the date on which policy has been purchased by insurer from another insurance company.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Replacement Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the proposed policy Replacement Type reflects, in aggregate, the Replacement Types of all existing contracts that are being replaced. When used on the old or replaced or exchanged policy it reflects the Replacement Type for that specific contract. This usage is applicable in the context of the current transaction. It is not intended to reflect any historical replacement information for the replaced or exchanged policy. For example in a new business submission, when you are replacing both an internal and external policy the proposed policy Replacement Type will be equal to 4 Replacing both an internal and an external policy . One existing policy Replacement Type will be 2 Internal Replacement . The other existing policy Replacement Type will be 3 External Replacement . Sample values are Other , Unknown , Both internal and intra statutory , External Replacement , Finance Purchase , Group Conversion , Guaranteed Purchase option , Internal , Internal replacement , Intra statutory , None , Replacing both an internal and an external policy , Term Conversion.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Status",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the unique code identifying the applicable status of the policy for example Active, Terminated, Matured etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Status Reason",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the policy Reason for Status. Sample values are OTHER is Other , UNKNOWN is Unknown , APPEAL is Appeal , APPDECLINE is Applicant declined offer , BACKPROC is Back Process , CHANGEREQDENIED is Change Request Denied , COMPLEX is Complex, Policy Addition, Historical Addition , ANNIVERSARYLOAD is Deficient anniversary load , COI is Deficient Cost Of Insurance , LOANCAP is Deficient Loan Capitalization , DELREQPENDING is Delivery Requirements Pending , DELREQSATISFIED is Delivery Requirements Satisfied , EFFDATE is Effective Date Not Reached , EXCESSCLAIM is Excessive Claims , NOTAVAILABLE is Feature Not Available , GRPEXP is Group Expired.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Tax Country Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "This is the policy country identifier representing the Tax Jurisdiction represents the current jurisdiction of this policy for tax purposes. It can be used for determining the jurisdiction that applies when calculating tax information for a policy when a jurisdiction is not specified for a particular financial arrangement or activity.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "This is the unique code identifying the policy type issued by the entity. Sample values are in are IND for individual, GROUP is Group Policy, PACKAGE for Package Policy and OTH for Other Policies.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policyholder Death Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "The date on which the policyholder death occurred according to information received by insurer. Death date can also be taken from official record like a death certificate.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Portfolio Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of a portfolio. The term portfolio refers to any collection of financial assets such as stocks, bonds, cards and cash equivalents, as well as their mutual, exchange traded and closed fund counterparts. Portfolios may be held by individual investors and or managed by financial professionals, hedge funds, banks and other financial institutions. It is a generally accepted principle that a portfolio is designed according to the risk tolerance, time frame and investment objectives of the investor.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Power Of Attorney Or Signatory Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether this account has power of attorney or signatory authority granted to a person with a US address. . This is required for FATCA purpose. List of values are Y, N. If the value is updated as Y means this account has power of attorney granted to a person with a US address and if the value is updated as N means the power of attorney is not granted to a person with US address or this account does not have any power of attorney.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Pre Existing Conditions Limits Claims Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "This is the pre existing conditions limit the benefits for claims or the validation of the policy. Sometimes a pre existing condition unknown by the carrier can result in rescinding of the contract. List of values are Y, N. Certain Benefits in the Long Term Disability Claim can be denied on the basis of pre condition clause.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Premium Due Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "The next premium due amount from the policyholder in natural currency. Also known as renewal premium.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Premium Freeze Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the premium freezes. This is applicable when coverage is for income protection. This date applies only when the payment structure is stepped.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Premium Overdue Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Premium overdue amount. The premium is considered to be overdue if the policyholder does not pay the premium before or on the renewal due date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Premium Payment Method Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of premium payment method. Indicative values are AMEX is American Express, DINER is Diner s Club Card, DISCV is Discover, MASTR is Master Card, VISA is Visa, BOND is Surety Bond, CASH is Cash etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Premium Payment Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code identifying premium type and frequency of the premium payment. Possible values for premium type are Single, in case it is a single premium policy, or Monthly, Quarterly, Half yearly, Annually etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Present Value Of New Business Premium",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the present value of future premiums for new policies at the time of inception in natural currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Prior Carrier Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the Prior Carrier Code, this is set of denormalized properties added for reinsurance transactions. The properties are provided by the direct carrier to the reinsurer in order to meet integration requirements. They are needed as part of a reinsurance activity or facultative transaction that will be sent from the cedant to the reinsurer. Because they are part of the cedant perspective of the policy, they affect the direct insurance sections of the model. These properties may only be used in situations where there is a one to one correspondence between a current policy and the one being converted, replaced, exchanged, or reissued. If additional information about the prior policy is needed or there are multiple prior policies, details should be obtained by building a relationship between this holding and other holdings representing the ones being converted, replaced, exchanged or reissued.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Producer Agent Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the unique identifier of the producing agent working for a given producer or agency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Producer Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is producer or agent identifier for a policy. Also know as agency or broker with whom the agent is employed.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Product Bundle Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of product bundle code. Bundling is a marketing strategy that joins products or services together in order to sell them as a single combined unit. Bundling allows the convenient purchase of several products and or services from the same financial institution. The products and services are usually related, but they can also consist of dissimilar products which appeal to one group of customers. For example Credit card product is bundled with savings account product or loan product is bundled with a CASA account. There are certain interest cost advantages that are available as part of product bundle, should the customer close a product which is part of the bundle, the financial institution could review the advantage provided to other accounts as part of the bundle.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Product Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code assigned to each of the Products offered by the Bank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Product Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the product type associated with account. Product type is defined as classification like loan, deposit, cards, etc. Product Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Projected Annual Income At Maturity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is Projected Annual income at maturity This amount is displayed on policy print and is included as a part of the status page for an advanced product flexible premium annuity. The annual income amount at maturity is system maintained and reprojected annually.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Purchase Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the purchase price of an asset. This amount is not the same as the Balance Outstanding. It is an accounting rule that mandates that during the purchase of loans that have evidence of credit deterioration since origination, the net investment in loans is recorded. The net investment in loans is the lower of the acquisition cost of the loan or the estimated fair value at the date of acquisition.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Qualified Plan Employer Name",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "This is Name of the qualified plan employer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Cap Life",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Rate cap life refers to maximum interest rate allowed during life of an adjustable rate instrument. If Forecast Rate Plus Margin > Rate Cap Life, then the rate specified in Rate Cap Life is used.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Change Minimum",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the minimum change in the repricing index that is required for a corresponding change to the interest rate and is used by FTP engine to calculate option cost. \nFor adjustable rate records, the cash flow engine will match the REPRICE_ FREQ, INTEREST_RATE_CODE, and the reprice date to the information generated by the monte carlo rate engine. The margin will then be added to this forecasted rate. Any rounding will be applied, followed by a check of the RATE_CHG_MIN, when determining the fully indexed rate. Rate caps or floors and tease periods will be applied, and the resulting rate will be used as the records repriced rate.\n\nIf the absolute value of, forecasted rate + margin,, previous rate + margin,] <RATE_CHG_MIN, the engine will set the new forecasted rate = previous rate. The cash flow engine will not change the previous rate to the new forecasted rate. The previous rate is defined as either the rate on the detail record, CUR_ NET_RATE or CUR_GROSS_RATE, or the previous forecasted rate from the monte carlo engine.\n\nAfter the RATE_CHG_MIN is calculated any other cap or floor, rounding, and tease periods will then be applied to calculate option cost.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Change Rounding Factor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the value to which forecasted interest rates are rounded. The rate change factor is read with rate change round code. Truncate rate change round code would not have any factor as the decimal is ignored by the engine.\n\nRound Up rate change code  will round the interest to the nearest integer by the factor mentioned in the column. Example, if the unrounded forecasted rate is 8.65 and the RATE_CHG_RND_FAC = 0.5, the rounded forecasted rate = 9.00.\n\nRound down rate change code  will round down by the factor mentioned in the column to the nearest integer. Some instance it can round it to the nearest 0.5 as well. Example, if the unrounded forecasted rate is 8.65 and the RATE_CHG_RND_FAC = 0.25, the rounded forecasted rate = 8.50\n\nRound Nearest  The cash flow engine rounds the rate to the nearest multiple of RATE_CHG_RND_FAC. For example, if the unrounded forecasted rate is 8.65 and the RATE_CHG_RND_FAC = 0.25, the rounded forecasted rate = 8.75.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Decrease Cycle",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum rate decrease allowed during a repricing cycle for an adjustable rate instrument.\nTransfer Pricing references RATE_DECR_CYCLE when calculating option costs. The cash flow engine references RATE_DECR_CYCLE when calculating a forecasted interest rate. RATE_DECR_CYCLE sets the maximum amount, in terms of basis points, by which the interest rate may decrease in a given REPRICE_FREQ.\n1. For adjustable rate records, the cash flow engine matches the REPRICE_ FREQ, INTEREST_RATE_CODE, and the reprice date to the information generated by the Monte Carlo rate engine. The margin is then added to this forecasted rate. Any rounding, rate caps or floors, RATE_DECR_ CYCLE, and tease periods are applied, and the resulting rate is applied to the record as its repriced rate.\n\nWhen applying the RATE_DECR_CYCLE, the engine checks for the following:\n  Previous Current Rate > Calculated forecasted rate\n  Previous Current Rate  Calculated forecasted rate > RATE_DECR_CYCLE\nIf both equations are true, the rate change during the repricing period has exceeded RATE_DECR_CYCLE. In this case, the new forecasted rate is limited to the previous current rate  RATE_DECR_CYCLE.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Decrease In A Year",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum interest rate decrease allowed during a year for an adjustable rate instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Floor Life",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Rate floor life refers to Minimum interest rate allowed during the life of an adjustable rate instrument. If Forecast Rate + Margin < Rate Floor Life, then the rate specified in Rate Floor Life is used.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Increase Cycle",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum rate increase allowed during a repricing cycle for an adjustable rate instrument.\n\nTransfer Pricing references RATE_INCR_CYCLE when calculating option costs. The cash flow engine references RATE_INCR_CYCLE when calculating a forecasted interest rate. RATE_INCR_CYCLE sets the maximum amount, in terms of basis points, that the interest rate may increase in a given REPRICE_FREQ.\n1. For adjustable rate records, the cash flow engine matches the REPRICE_ FREQ, INTEREST_RATE_CODE, and the reprice date to the information generated by the Monte Carlo rate engine. The margin will then be added to this forecasted rate. Any rounding, rate caps, RATE_INCR_CYCLE, or floors, and tease periods are applied, and the resulting rate is applied to the record as its repriced rate.\n\nWhen applying the RATE_INCR_CYCLE, the engine checks for the following:\n  Calculated forecasted rate > Previous Current Rate\n  Calculated forecasted rate  Previous Current Rate > RATE_INCR_CYCLE. If both equations are true, the rate change during the repricing period has exceeded RATE_INCR_CYCLE. In this case, the new forecasted rate is limited to the previous current rate + RATE_INCR_CYCLE.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Increase In A Year",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the maximum interest rate increase allowed during a year for an adjustable rate instrument.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Plan Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier assigned to the rate plan that quoted premiums were calculated from.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Set Lag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the lag days to the next reprice date. This determines the date the interest by an adjustable rate instrument should refer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rate Set Lag Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the values as D  Days, M  Month and Y  Years, this is in conjunction with Rate Set Lag.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Recalcitrant Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether this account is considered to be a recalcitrant account. A Recalcitrant account is defined as an account that, 1, fails to comply with reasonable requests for information pursuant to IRS mandated verification and due diligence procedures to identify US Accounts,, 2, fails to provide a name, address and taxpayer identification number or, 3, fails to provide a bank secrecy waiver upon request. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Receive Pay Logic",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate the receive pay logic as 0 is Received, 1 is Paid.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Count",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of records aggregated to the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Region Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the geographical grouping of the market based on certain common characteristics like language, ethnicity, country, continent, city and state. The region can vary based on the definition of market. Global market vs local market can have different definition of region.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Reinstatement Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "The date on which the policy was reinstated from the earlier lapse status. Reinstatement is a process by which a lapsed contract is put back into active status. This process may involve payment of all the accumulated premium and re underwriting of the policy.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Reinsurance Contract Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the unique identifier of the reinsurance contract associated with given direct insurance contract. Reinsurance is a process whereby one entity takes on all or part of the risk covered under a policy issued by an insurance company in consideration of a premium payment. When particular reinsurance contract is participation across multiple reinsurers, same should be updated in stage insurance participation details and not here. Users should update here only when reinsurance contracts are not participated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remaining Number Of Payments",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the remaining number of payments due as per agreed payment schedule. The remaining number of principal, interest, or principal and interest payments to be made from the as of date until the maturity date of the record. This is used to compute the payment dates on which payment of principal and interest happen. As each payment is made during the life of the instrument, the cash flow engine reduces the remaining number of payments by 1 and rolls the payment period forward by the payment frequency. If the newly calculated remaining number of payments = 1, the cash flow engine no longer rolls the payment frequency and makes the next, and final, payment on the maturity date. If Remaining number of payments = 0, record is invalid. Also If Remaining number of payments = 1, Next payment date = Maturity date. For non term accounts, Remaining number of payments = 1.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remaining Number Of Premiums",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "The number of premium payments which are yet to be paid for this policy until the maturity or until the end of the premium paying duration.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remaining Tenor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the remaining tenor of the account. Tenor is the term to maturity. The remaining tenor is computed as Maturity Date  As Of Date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Remaining Tenor Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Remaining term unit is used in conjunction with remaining term to determine the remaining term of an account as on processing date. List of values are D Day, M Month and Y Year.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Renewable Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the contract or account can be renewed. Renewal, in case of loans is the extension of the original loan period which is applicable in case of loans that do not amortize over time like interest only loans. Contracts like Repos could also be renewed to extend the contract period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Renewal Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the account was renewed. Renewal is defined as the action of extending the period of validity of a license, subscription, or contract.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Replaced Policy Physical Status Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "This indicates the physical status or state of a contract when it is a replacement. This indicates where the actual policy contract is e.g. agents or carriers possession, or whether it is lost or stolen. List of values are A is Active , C is Cancelled , O is Complete , N is Did not take place , H is History , P is Pending , S is Suspended , V is Void , T is Other , U is Unknown.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Report Cost Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "The cost incurred in natural currency to get the report necessary, for analyzing risk to the insurance company, from the vendors or any other third party. Reports are generally ordered at the time of underwriting, claims settlement. These could include reports relating to medical condition of the insured, party financial related information and reports related to losses occurred.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repricing Frequency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to reprice Frequency is used in conjunction with Repricing Frequency Unit to define the frequency of rate change of an account. Repricing Frequency is used to identify whether records are adjustable or not. If Repricing Frequency> 0, the record is considered adjustable. If Reprice Frequency = 0, the record is fixed rate. It is used to compute the re price dates after the next_reprice_date. REPRICE_FREQ must be either 0 or positive.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Repricing Frequency Unit",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to reprice frequency unit is used in conjunction with Repricing Frequency to store the unit of frequency of rate change for an account. List of values are D, M and Y for Days, Months and Years respectively. Example  if the rate adjustment is 6 months, the repricing frequency will be 6 and repricing frequency unit will be M.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Required Minimum Distribution Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of annual Required Minimum Distribution RMD associated with the annuity policy as determined by the carrier and their RMD calculation method. Required minimum distribution is the minimum amount the annuitant must withdraw from their annuity account each year. The annuitants generally have to start taking withdrawals from their IRA, SEP IRA, SIMPLE IRA, or retirement plan account when they reach age 72 or 70, if they reach 70 before January 1, 2020.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Required Minimum Distribution Basis Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the Required minimum distribution basis value. The calculated total amount upon which the mortality factor may be applied to determine the annual Required Minimum Distribution amount for this annuity for this calendar year. This amount represents the annuities entire interest which includes the contract value as of December 31 of the last calendar year and may include the actuarial present value of additional benefits that will be provided under the contract, if the actuarial present value is to be added per the IRC regulations. Required minimum distribution is the minimum amount the annuitant must withdraw from their annuity account each year. The annuitants generally have to start taking withdrawals from their IRA, SEP IRA, SIMPLE IRA, or retirement plan account when they reach age 72 or 70, if they reach 70 before January 1, 2020.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Required Minimum Distribution Factor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the Required minimum distribution factor. The Calculated RMD Percent Factor is the Factor used in the equation to get the Required Minimum Distribution value for a Contract. This should be represented as a factor e.g. .06 rather than a percent e.g. 6 percent .RMD amount is calculated by dividing the tax deferred retirement account balance as of December 31 of last year by the life expectancy factor. The life expectancy factor is taken from the IRS Uniform Lifetime Table.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Required Minimum Distribution Tax Rule Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the required minimum distribution Tax Rule code. Sample values are TAXRULEUSA1987 is Based on 1987 USA Tax rules, TAXRULEUSA2001 is Based on 2001 USA Tax rules, TAXRULEUSAMDIB is Based on Minimum Distribution Incidental Benefit MDIB Table to 2001 USA Tax rules, TAXRULECANPRE93 is Pre 1993 Canadian Tax Rules, OTHER is Other, UNKNOWN is Unknown, TAXRULEUSA2002 is Revenue Ruling 2002 to 62.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Return On Equity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the return on equity which is calculated as Net Income divided by Total Equity.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Returned Fee Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the fees amount refunded in natural currency by the insurance company to the policyholder if the policy gets cancelled or does not complete full term.\n .",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Returned Premium Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is different than Cancelled premium. Return of Premium is a feature on some insurance products. A percentage of premium is refunded to the policy holder in case policyholder survives the term of the contract in case of Term Life policy. Incase of Long Term care policy or auto insurance premiums are returned at the end of the contract period in case there are no claims made during the contract period. This is amount of premium returned.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Returned Tax Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is amount of taxes returned. Taxes previously collected from the policyholder as part of premium or fee may have to be returned when there is a return of premium or fee. Return of Premium is a feature on some insurance products. A percentage of premium is refunded to the policy holder in case policyholder survives the term of the contract in case of Term Life policy. Incase of Long Term care policy or auto insurance premiums are returned at the end of the contract period in case there are no claims made during the contract period.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rider Base Policy Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the Rider Base Policy Number only if First Riders can be issued and priced separately are treated as separate policies or insurance contracts in OIDF. This means they can have separate policy or contract number maturity date, beneficiaries. This term denotes the separated policy.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Rollover Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if the contract is rolled over. List of values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sales And Distribution Channel Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code of the sales and distribution channel used to acquire the account. Distribution channels are mediums which are used to sell the product. In most cases, there is no difference between sales channels and distribution channels. Channels like Internet, branch, telephone, newspaper etc. are examples of distribution channels. Channel dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Self Directed Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to identify if the account is self directed. It indicates whether the funds in a deposit account against a retirement plan is managed by the owner of account or not. The List of Values are Y and N. If this flag is Yes, then the customer or owner of the account controls the investments in the account. For example As per FDIC 370, Self directed Employee contribution plans are treated under ORC Certain retirement Accounts and non self directed Employee contribution plans are treated under ORC Employee Benefit Plan. The list of values are Y and N. If this flag is Y, then the customer or owner of the account controls the investments in the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Separate Account Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This represents the value as at a particular date for the separate accounts or funds multiple which the policy holder selects upon initial policy purchase and thereafter when the policy holder have the opportunity to change the selected funds that finance the policy. This is applicable in case of unit linked or variable policies. The market risk in a separate account lies with the policyholder.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date at which a security transaction must be paid by the buyer and the securities delivered by the seller. Stocks and bonds have a settlement date of three business days subsequent to the trade date . Listed options and government securities must be settled by the next business day. This is different from contract settlement date. A contract can have multiple settlements in different settlement types.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Source Of Fund Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to source of fund type Code. The source of funds is used to capture the result of the event or transaction that generated or created funds, not the location or financial repository from which they were taken to satisfy the financial requirement of the transaction. Possible Values include 1035EXCH 103 EXCHANGE, ANNUITY ANNUITY, BROKERAGEACCT Brokerage Account ETC.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Source Of Initial Funds",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the source from where the initial funds will come as stated by the customer for the account, e.g. salary, lottery, etc..",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Split Percent For Fixed Payout",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the designated split between the fixed and variable portions of payout for an annuity. The percentage expressed is the percentage of payout based on fixed portion and the remainder then is the variable portion.\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Spousal Continuation Effective Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the spouse elects to continue the annuity policy. A spouse can continue the existing contract and treat the annuity as their own and name a new beneficiary. When a spouse chooses to treat an inherited annuity as their own, there are no immediate tax repercussions. It is as if the spouse has owned the annuity from the beginning.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Spouse Date Of Birth",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date of birth of the spouse of the party. Date of birth refers to the day, month, and year when person was born.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Spouse Policy Continuation Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates the Spousal continuation Rule states that the deceased owners surviving spouse can become the contract owner. In the Spousal continuation Rule there is special flexibility on death benefits for spouses of owners. This rule gives the surviving spouse of a deceased owner, the right to continue to build a tax deferred asset for heirs without being forced to take any form of distribution. Therefore, the surviving spouse is not forced to take any assets until so desired. This column indicates if Spouse has exercised the continuation choice offered. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Standing Instructions To Us Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether there are standing instructions to transfer funds from this account to an account maintained in the United States. This is required for FATCA purpose. If the value is updated as Y means there are standing instructions to transfer funds to US account and if the value is updated as N means there are no instructions to transfer funds from the account to US account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "State Taxable Gain Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of taxable gain that would be reported to the state as taxable income, if the annuity were fully surrendered at the As Of date . In the United State the Federal Taxes and State Taxes are reported and paid separately. It takes into account all prior withdrawals that may have affected the policy cost basis. Gains are any increase in the accumulated cash value of the contract due to interest credited to the account, appreciation of the value of the funds, in case of unit linked products, bonus credited less any cost basis that has already been taken as part of the previous withdrawals. On an annuity contract income tax is payable whenever there are disbursements made out of the contracts. In the United States calculation of taxable gain changes depending upon whether the annuity contract is qualified or non qualified. In a non qualified contract only the gains are subjected to taxation but cost basis is exempt. In case of a qualified annuity the entire amount being withdrawn is considered as taxable. For Life insurance contracts death benefit payments are tax free. However, in case of surrender of the life insurance policy gains made on the contract become taxable.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Statement Suppression Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether the distribution of statements is suppressed for this account. Normally it is done to switch to paperless where customer will always have access to his records online. If the value is updated as Y means the distribution of statement is suppressed and if the value is updated as N means the distribution of statement is not suppressed for the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Stretch Policy Contract Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Stores the Stretch Contract Number. Some annuities allow dependents to establish a contract that is associated with an existing contract held by one or more of their parents. Often these contracts arise in the aftermath of the death of an annuitant. These contracts allow the beneficiaries to get a periodic income in addition to benefitting from the tax deferment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Subject To Tax Aggregation Rules Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates Subject to tax Aggregation Rules flag. Tax Aggregation rule is that if one owns multiple nonqualified annuities, which are contracts outside of a tax qualified retirement plan, the Government Regulatory Authority like IRS will treat all of those annuities as a single entity for tax purposes. Indicator that contract is subject to tax aggregation rules. List of values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sum Insured",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This refers the maximum value for a particular policy and a given year that the insurance company agreed to pay for relevant and valid claims made on the policy. Any amount exceeding the sum insured will have to be borne by the policyholder. Generally referred as Sum Insured or Sum Assured is stored here. Sum Assured refers to the amount payable upon occurrence of an event as agreed between the insured and the insurer. Events could be death, accident, hospitalization etc. In case of Life insurance the Sum Assured changes in events like Surrender, Dividend payment, lapsation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Superannuation Guaranteed Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the Superannuation guaranteed amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Superannuation Guaranteed Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "This is the Superannuation guaranteed percentage of salary.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Surrender Charge Free Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the Surrender Charge Free Date can continue to be transmitted even though the date is in the past indicating policy is free of surrender charges. If future premium payments introduce new surrender charges the date transmitted should be updated to reflect the new surrender charge free date. This standard usage follows the usage for the data element called Surrender Charge Expiration Date in the Life and Annuity DTCC EDI Positions and Valuation record layout.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Surrender Option Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Amount paid to the policy holder on his exercising the surrender option of the policy in natural currency. When a policy is exchanged and it is still subject to a surrender value, if there are any loan taken against the policy then the surrender value of the policy is adjusted to recoup the outstanding loan amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Surrender Short Fall Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the surrender short fall amount, the difference between the current accumulation value and the current surrender value, assuming that there are no loans on the policy. In other words, it is the surrender charge that would be assessed if the policy were completely surrendered on the extraction date of the Holding.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Suspense Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Suspense Amount is used when a company receives a payment that does not match a scheduled payment. Money that has been received and the company does not know how the owner intended for the money to be applied.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Tax Exempt Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to percent of interest income that is tax exempt. For instance, if 40 percent of interest income is exempt from tax and the balance is taxable, then this field would store 40 percent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Tax Expense",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the tax amount associated with this account. This is the actual tax amount withheld by the financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Tax Withholding Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to identify whether the financial institution is to withhold taxes on this accounts earnings from redemptions that result in payments to the customer. Income tax withheld from employees wages and paid directly to the government by the employer. List of values are Y = Yes, N= No.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Taxable Benefit Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This Indicates if payment is taxable. Sample values OTHER is Other , UNKNOWN is Unknown , FEDJURIS is Federal and Jurisdiction , FED is Federal Only , JURIS is Jurisdiction Only , NONE is None. In some of the countries like the United States State Income Tax and Federal Income Taxes are calculated separately.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Taxable Gain Amount At Surrender",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount of taxable gain that would be reported as taxable income, if the annuity were fully surrendered at the As Of Date. It takes into account all prior withdrawals that may have affected the policies cost basis. Gains are any increase in the accumulated cash value of the contract due to interest credited to the account, appreciation of the value of the funds, in case of unit linked products, bonus credited less any cost basis that has already been taken as part of the previous withdrawals. On an annuity contract income tax is payable whenever there are disbursements made out of the contracts. In the United States calculation of taxable gain changes depending upon whether the annuity contract is qualified or non qualified. In a non qualified contract only the gains are subjected to taxation but cost basis is exempt. In case of a qualified annuity the entire amount being withdrawn is considered as taxable. For Life insurance contracts death benefit payments are tax free. However, in case of surrender of the life insurance policy gains made on the contract become taxable.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Taxable Status Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "This is the Taxability status of the policy. Tax qualified plan are captured in a separate attribute and not this one. Defines whether taxing is required List of Values C is compulsory , V is voluntary.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Account Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the sum of all expenses incurred on the account during the period. Types of expenses include administrative, collections and recovery expenses, legal expenses etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Deposit From Issue To Current Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is Total Deposit from Issue to current date. This Includes lumpsum and premiums paid.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Distribution Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the sum of distribution related expenses for the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Fees And Charges",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the total fees and charges collected or levied by the bank. This includes penal charges, fees, etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Total Process Expenses",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the expenses pertaining to data processing, item processing, retail operations, deposit insurance etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transfer Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the transfer rate that is applicable for the contract. In case of fixed rate instruments, this is the rate that ALM cash flow engine uses to calculate certain transfer rate related FEs. For adjustable or floating or administered rate instruments, this is the initial rate that is picked up by ALM cash flow engine for transfer pricing the record till the first reprice event, after which it picks the TP rate from the TP IRC for future reprice dates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transition Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the transition date which refers to the date on which policies were transitioned to IFRS 17. Later when cohort gets updated or policy gets sold, this transition date is an important reference and should be at seriatim level.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Treatment Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identification code for a treatment. Treatment is defined which is channel specific instance of an offer. Treatment Refers to the message associated with the offer. Treatment dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underwriter Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the underwriter identifier for a policy. An insurance underwriter is a financial professional that evaluates the risks of insuring a particular person or asset and uses that information to set premium pricing for insurance policies.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Unearned Fee Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the portion of fees, in natural currency, not earned due to coverage period that is yet to be completed. In case the policy is cancelled within this period then proportionate fee for the unexpired period would have to be returned to the policyholder. If an annual fee or 100 is charged on Jan 01 2020 on a policy that has coverage until Dec 31 2020 and the policy is cancelled on June 30 2020.Then the fee for the remaining period will be refunded to the policyholder if company allows for refund.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unearned Tax Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the portion of tax amount Unearned in the natural currency due to the coverage provided by the insurance contract. The tax amount may be fully earned depending upon the insurance contract. Unearned taxes are that portion of a policy tax that applies to the unexpired portion of the policy. Although taxes are often paid in advance, insurers may earn the taxes at an even rate throughout the policy term. If a policy has an annual tax of 100 dollars made on Jan 1 2019, and the contract tenure is 1 year the tax of 100 dollars is considered to be earned on completion of the tenure of the policy i.e. Dec 31 2019.But as of June 30 2019, 50 dollars is considered as unearned.\n .",
                    "isPII": "NO"
                },
                {
                    "logicalName": "VIP Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the member is categorized as a VIP by the financial institution.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Valuation Base Series",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the valuation base series. Used to distinguish plans of insurance for variations in death benefits, premium changes, cash values and any other information that can vary from plan to plan. The values assigned to this data attribute are defined by the carrier.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Valuation Sub Series",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the valuation sub series. Describes variations in the methods used to compute gross premiums, cash values and dividends. Completes the Base Series. These codes describe variations in the methods used to compute gross premium, cash value and dividends.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Variable Benefit Payment Spread Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the spread to be added to benchmark for arriving at variable benefit payment rate. The pricing spread is added to the IRC value for obtaining the current net rate. This is applicable for Life insurance contracts where benefit payment is defined like 50 basis points above the benchmark like 1 year USD Treasury yield, 3 month GBP LIBOR. In above example 50 is what is stored here and assumed to be defined in basis points.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Waived Fees",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the fees that is waived by the financial intuition during the download period. Waivers are provided on processing fee, annual fee, joining fee or any other fee that may be levied.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Withdrawal Count Month To Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "This is number of policy withdrawals or partial surrenders taken during the current month.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Withdrawal Notice Period",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the number of days of notice required to be given by a customer to the bank before a withdrawal of funds is allowed from a notice savings account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Worker Compensation Line Of Business Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the worker compensation business line code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Written Fee Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the total fee amount written for the policy period in the natural currency. Insurance producers may charge a fee to the prospective for any services that they may provide and this fee may be charged only if there is a written agreement in place in which the fee to be charged is specified. This is called written fee amount. Insurer may collect fee amount collected for the policy at the time of acquisition. Insurer may charge fee to the policyholder for rider, front end loading in a product, administrative charge. Some jurisdictions Permit an MGA or Insurer, through their producing agents, to collect a per policy managing general agent fee to cover the costs of the managing general agent associated with underwriting and issuance of the policy. This fee is a component of the insurer rate filing and is fully earned at the time of collection. An insurer may also charge fees to the policyholder on certain policy feature like riders, front loading in case of unit linked policies.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Written Tax Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the tax amount collected for the policy acquired in the natural currency. Examples of taxes collected are Premium Taxes in some jurisdictions Premium Tax is collected and paid to the province by administrators of funded and unfunded benefit plans, anyone buying insurance placed with an insurer not licensed in that stated, reciprocal or inter insurance exchanges. These are collected from the policyholders.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [],
            "useCases": []
        }
    ]
}