{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "As Of Date",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source system from where data is extracted. Data can be sourced from multiple sources, this column will Refers to the source code from where the data is extracted for this extraction date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Dimension Value Closed Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the given dimension value record has been disabled or expired. The list of values includes Y- Indicates that the dimension value has been disabled, N- Indicates that the dimension value is not disabled and is still active.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securitized Product Code",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier for the Securitized Product. This refer to the lower level of security type like Residential Pass Through securities which are grouped under Pass through securities class. E.g.. Pass Through Certificates, mortgage backed securities.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securitized Product Description",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description",
                    "gcd": "Refers to the SECURITIZED PRODUCT description like Residential pass through securities, Residential mortgage backed securities.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securitized Product Numeric Identifier",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "SurrogateKey_Long",
                    "gcd": "Refers to the equivalent numeric identifier of the Securitized Product Code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securitized Product Type Class Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the SECURITIZED PRODUCT type code like PTC, MBS. Class refer to the higher level grouping consisting of Asset Backed Securities, Mortgage Backed Securities and Pass through securities.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Securitized Product Type Description",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description",
                    "gcd": "Refers to the SECURITIZED PRODUCT type description like Pass Through Certificates, mortgage backed securities.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Seeded Record Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "It Indicates if dimension record is seeded by product or not. The SCD component would not overwrite the record if it is set to 'Y'.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [],
            "useCases": []
        }
    ]
}