{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "Account Description",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to description of the account. Applicable for instruments that are traded.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "As Of Date",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source system from where data is extracted. Data can be sourced from multiple sources, this column will Refers to the source code from where the data is extracted for this extraction date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Dimension Value Closed Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the given dimension value record has been disabled or expired. The list of values includes Y- Indicates that the dimension value has been disabled, N- Indicates that the dimension value is not disabled and is still active.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the original account number held by the source system. If there are multiple source systems without unique account numbers, we expect the account number and source system to be concatenated as part of the primary key, while this column will store the original account number as generated by the source system.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Originator Bank Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "This stores the code of bank which has originated the loan.\n",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Seeded Record Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "It Indicates if dimension record is seeded by product or not. The SCD component would not overwrite the record if it is set to 'Y'.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Serviced Loan Account Number",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the service account or service contract held by the customer. Account number is defined as numbers, letters or alphanumeric code assigned to every significant customer, supplier and lender for ease of reference in accounting records of a financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Serviced Loan Account Numeric Identifier",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "SurrogateKey_Long",
                    "gcd": "Refers to the equivalent numeric identifier of the Serviced Loan Account Numeric Identifier.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [],
            "useCases": []
        }
    ]
}