{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "As Of Date",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Central Bank Reserves Stress Drawdown Percentage",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the percentage of central bank reserve that can be drawdown during time of stress. Local supervisors should discuss and agree with the relevant central bank the extent to which central bank reserves should count towards the stock of liquid assets, i.e. the extent to which reserves are able to be drawn down in times of stress.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source system from where data is extracted. Data can be sourced from multiple sources, this column will Refers to the source code from where the data is extracted for this extraction date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Dimension Value Closed Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether the given dimension value record has been disabled or expired. The list of values includes Y- Indicates that the dimension value has been disabled, N- Indicates that the dimension value is not disabled and is still active.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Seeded Record Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "It Indicates if dimension record is seeded by product or not. The SCD component would not overwrite the record if it is set to 'Y'.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Standard Account Head Description",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Medium",
                    "gcd": "Refers to the description of standard accounting head.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Standard Account Head Identifier",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier for a standard accounting capital head.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Standard Account Head Identifier Numeric Identifier",
                    "isPk": "NO",
                    "isNull": "NO",
                    "ldd": "SurrogateKey_Long",
                    "gcd": "Refers to the equivalent numeric identifier of the Standard Account Head Identifier.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Standard Account Head Level One Description",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the description corresponding to the Standard Accounting Head Level1 Code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Standard Accounting Head Level One Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the description of classification into which a granular standard accounting head falls one level higher than the standard accounting head.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Withdrawal Reserve Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates whether there are any restrictions on the withdrawal of a reserve balance held by the entity in a foreign central bank. This is required to classify a reserve held with a foreign central bank as a level 1 high quality liquid asset, HQLA, or not for the purpose of inclusion in the stock of high quality liquid assets while computing the Liquidity Coverage Ratio, LCR. List of values are Y, N.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [],
            "useCases": []
        }
    ]
}