{
    "DataModelDetail": [
        {
            "attributes": [
                {
                    "logicalName": "Account Or Contract Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique identifier of the account or contract held by the customer. Account number is defined as numbers, letters or alphanumeric code assigned to every significant customer, supplier and lender for ease of reference in accounting records of the financial institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Accounting Rule",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the manner in which the cash or security involved in this transaction is held in the account. Sample Values are OCB= on a cash basis, ON=on margin, or ASP=as a short position.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Acquirer Bin Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric_Long",
                    "gcd": "Refers to the bin number to identify acquirer. Acquirers is the financial institution that enters into agreements with merchants to accept bankcards as payment for goods and services. Most often a bank acts as an acquirer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Acquisition Cost",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to The Cost Of Acquisition.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Annuitized Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the annuitization transaction amount. Annuitization is the process of converting an annuity investment into a series of periodic income payments. Annuities may be annuitized for a specific period of time or for the life of the annuitant.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "As Of Date",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Date",
                    "gcd": "Refers to the date as on which the snapshot of source data extracted for processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Assumed Policy Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the unique identifier associated with the assumed policy.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Authorizer Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the transaction authorization user identifier. User who will authorize the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Automated Transaction Process Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the transaction process decision was Automatic. A transaction was automated when the decision to process the transaction was automatic without any manual decision.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Average Acquisition Cost",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the average acquisition cost of the exposure. This will be used in calculating the exposure at default amount of the retained exposures.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bank To Bank Instructions",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Medium",
                    "gcd": "Refers to the instructions that the sending bank provides to the receiving bank for processing this transaction. For segmented instructions, all components should be loaded as a concatenated value.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bank To Bank Transfer Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the transfer is between the financial institutions. For electronic funds transfers, indicates whether this transaction is an institution to institution transfer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Big Ticket Sale Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Flag indicates if card holder has made even one big ticket sale during the month. Big ticket items are high value items, such as houses and cars, as well as expensive products such as appliances, home theater systems and furniture.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Bounced Payment Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the card payment amount that has bounced.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Branch Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the branch code. A branch, banking center or financial center is a retail location where a financial institution offers a wide array of face to face and automated services to its customers. This column Refers to the unique branch code assigned by the financial institution. A branch may specialize to offer certain type of products to customers. Branch needs approval from the regulators.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Segment Category Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Business Segment Category code. Indicative Values are LIFE for Life insurance, PANDC for Property and Casualty, HEALTH for Health Insurance, ANNUITY for Annuity Contracts, RETIREMENT for Retirement Accounts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Business Unit Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the business unit code as defined by the organization. A business unit is generally a broader definition and represents all the units in an organization. Business Unit dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Canceled Pairing Transaction Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Store the Transaction Reference Identifier of the cancelled transaction. For cancelled transactions, contains the Transaction Reference Identifier of the cancelling transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Canceling Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to identify if the transaction cancels another transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Card Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the card account number.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Card Not Presented Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates that card was not presented for the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Carrying Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the carrying value.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cash Surrender Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This attribute holds the Cash Surrender Value of the reinsured policy as reported by the direct insurer to reinsurer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Channel Risk",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the level of risk associated with the channel through which this transaction was conducted. The value expected is a number between 0 and 10 with 0 increasing minimum risk and 10 indicating maximum risk.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Channel Transaction Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the channel transaction was recorded in the system.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cheque Bounce Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the check bounced.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cheque Transaction Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the cheque transaction was recorded in the system.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Claim Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to a unique identifier for each claim made.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Clearing Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the clearing date. For monetary instruments and checks, the date on which the clearing institution cleared the monetary instrument associated with this transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Clearing Time",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Timestamp",
                    "gcd": "Refers to the time on Clearing Date at which the monetary instrument associated with this transaction was cleared by the clearing institution and is applicable for monetary instruments and checks. Refers to the time along with time zone information.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Conductor Sequence Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric_Long",
                    "gcd": "Refers to the unique Conductor Sequence Identifier in the transaction. It Refers to the unique sequence for the combination of the Conductor Identifier, ID Type, ID Issued State, and ID Issued Country for each transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Conductor Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the type or Role of the conductor in the transaction. List of Values are A Person conducting transaction on own behalf, B Person conducting transaction for another, D Courier Service, private.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Contract Quantity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the contract quantity associated with the contract. One contract of a derivative like forwards can have multiple quantity associated with it.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Conversion Factor",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the conversion factor is provided by the exchange as a daily value for the underlying instrument, which is used to calculate the cheapest to Deliver set of instruments.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Conversion Rate From Accounting To Local Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Long",
                    "gcd": "Refers to the Conversion rate from Accounting currency to local currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Conversion Rate From Transaction Currency To Account Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Long",
                    "gcd": "Refers to the rate that is applied to convert the transaction amount from the transaction currency to the account currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Conversion Rate From Transaction Currency To Local Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent_Long",
                    "gcd": "Refers to the Conversion rate from Transaction to Local currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Conversion Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the conversion type for rate conversion between entered amount and accounted amount for FAH. This may be populated for specific FAH related activities. Possible Values include spot, corporate, user.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Country Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the country code associated with the account or instrument or party or location. There are several popular country codes as part of ISO 3166 standard published by the International Organization for Standardization. ISO 3166 defines codes for the names of countries, dependent territories, special areas of geographical interest and their principal subdivisions.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Coverage Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the coverage.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Cross Border Transaction Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if this transaction passed through multiple countries.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Currency Transaction Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to identify whether the transaction is a currency transaction or not.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Current Payment Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the current period payment made. Current Payment is the installment amount received from the customer. Current payment in the case of asset products represents the current periodic payment made to repay the outstanding balance. For standard amortization types, those that are not non patterned and non scheduled, Transfer Pricing Application, remaining term methods, uses the current payment from the detail record for the life of the record until a payment recalculation occurs. This will same as maturity amount in case of repo contracts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Data Source Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the source system from where data is extracted. Data can be sourced from multiple sources, this column will Refers to the source code from where the data is extracted for this extraction date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Debit Credit Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Flag to indicate if the account balance is in debit or in credit. If the value is updated as D means the balance is in debit and if the value is updated as C means the balance is in credit. Debit balance will indicate the amount which is due and credit balance is the amount which could arise due to overpayment of the cycle balance.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Deductible Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique code for the deductible identifier. This is to be updated when transaction amount pertains to deductible amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Depositing Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the monetary instrument associated with this transaction was deposited at the depositing institution.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Depositing Time",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Timestamp",
                    "gcd": "Refers to the time on depositing date at which the monetary instrument associated with this transaction was deposited at the depositing institution. Refers to the time along with time zone information.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Dividend Payout Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of dividend payout type. Indicates the method in which the plan or coverage participates in dividends. Sample values are ACCUM is Accumulate at interest, CV is Add dividend to cash value UL, PUACASH is Buy Paid Up Additions to a planned specified amount Remainder to Cash, CONTRACT is Contract Fund, INVEST is Investment Fund, NONE is None, CASH is Paid in cash, PUALR is Paid Up Addition and Loan Reduction, PUA is Paid Up Additions, PAYINT is Pay off loan and accumulate remainder at interest, PLANENHANCE is Plan Enhancement, OTHER is Other, UNKNOWN is Unknown.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Dwelling Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the dwelling Identifier. It can be home owners, commercial property and dwelling fire. A dwelling is a home where someone lives. Houses, apartments, and condos are all dwellings.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Event Date Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the date on which transaction event occurred in a number format i.e. YYYYMMDD for FAH.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Event Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric_Long",
                    "gcd": "Refers to the event identifier generated via the FAH event generation program. This column should not be populated during implementation.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Execution Time",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Timestamp",
                    "gcd": "Refers to the time on Execution Date at which this transaction was conducted and is applicable for cash transactions and electronic fund transfer. Refers to the time along with time zone information.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Feature Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique identifier of the feature such as credit shield, bill pay etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Fixing Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the fixing date. This is applicable for floating payment and is the date upon which the rate to be paid is fixed. Typically, this occurs two days prior to the payment date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Full Surrender Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the surrender transaction amount when the insurance policy is completely surrendered. The surrender value is the actual sum of money a policyholder will receive if he tries to access the cash value. This is also referred to as the surrender cash value or, in the case of annuities, annuity surrender value. The cash value and surrender value .",
                    "isPII": "NO"
                },
                {
                    "logicalName": "General Ledger Account Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique general ledger account code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Group Program Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the policy Group Program identifier.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Header Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the header identifier required for FAH header line Processing. A header record will have multiple transaction lines in the transaction tables.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holding Transfer Or Sale Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to that investment value that was either sold or transferred from one holding type to another.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holding Type Transfer From",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holding type that where investment has been transferred from. Used to identify transfers done from Held to Maturity to Held for sale, available for trading or outright sale from any holding types.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Holding Type Transfer To",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the holding type that where investment has been transferred to. Used to identify transfers done from Held to Maturity to Held for sale, available for trading or outright sale from any holding types.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "ISO Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "ISO currency codes is a standard published by the International Organization for Standardization 4217, which delineates currency designators and country codes, alpha and numeric. This column will capture the standardized currency code. Currency dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Indirect Investment Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Flag Indicates if investment is direct or indirect investment. Direct investment is any nonfinancial equity investment that the holding company or any of its consolidated subsidiaries holds directly in a nonfinancial entity whereas indirect investment is N. List of Values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Inflow Outflow Amount Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the indicator to identify the transaction amount as inflow or outflow. List of Values are I = Inflow and O= Outflow.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Initiating Role Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Indicates whether transaction originated as a request from the debited account or credited account. List of values can be D  Debiting role, C  Crediting role.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Installment Received Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the installment payment is received.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to a unique Code representing a particular Instrument. This code can be ISIN Code, CUSIP, SEDOL etc. Instrument Contract dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Net Present Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the end of the day Net Present value of the instrument. This will be a download in case of exchange traded instruments and will be priced using Quantlib pricing Engines in case of OTC instruments. Price at which this trade was executed, expressed in issuing currency. Value is to be expressed in the issuing currency of the associated security. Also indicates the price of the instrument on its primary market.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Risk",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the level of risk associated with the product that was involved in this transaction. The value expected is a number between 0 and 10 with 0 increasing minimum risk and 10 indicating maximum risk.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Instrument Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of instrument type, which is defined as code identifying the instrument category of the customer account. Instrument Type dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interchange Fee",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the interchange fees which are involved in the transaction. Interchange fee is a charge paid by merchants to a credit card issuer and a card network as a fee for accepting credit cards. They generally range from 1 to 3 percent.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Rate_Percent",
                    "gcd": "Refers to the interest rate as applicable as on As of Date. This is expected for both, fixed rate as well as floating rate instrument. For floating rate instruments, the rate would be computed at the time of next re pricing date.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Interest Rate Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the type of interest rate paid on this transaction., For instance Fixed Or Floating.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "International Banking Facility Account Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the account or transaction is belongs to an international banking facility. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Inward Transaction Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the currency code for incoming transaction amount.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Issuer Bin Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric_Long",
                    "gcd": "Refers to the bin number to identify issuer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Issuer Region Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the region to which issuer belongs. This needs be populated from bin master.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Issuing Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the issuing date of the instrument. For monetary instruments and checks, the date on which the monetary instrument associated with this transaction was issued or purchased.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Issuing Time",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Timestamp",
                    "gcd": "Refers to the time on Issuing Date at which the monetary instrument associated with this transaction was issued or purchased and is applicable for monetary instruments and checks. Refers to the time along with time zone information.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Legal Entity Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the entity code of the legal entity to which the account will be attributed in the general ledger.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Line Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric",
                    "gcd": "Refers to the line identifier of the transaction. A single logical transaction may result in multiple lines and each such line will be identified by this attribute.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Line Of Business Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to line of business, LOB, is a functional unit that offers the products to the customer by the financial entity. Example: Corporate Finance, Trade Services, Private Wealth Management, Treasury Services, Retail Banking, Cards services etc. Refers to the unique code of the line of business applicable to the respective product.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Loan Conversion Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to identify if the transaction is converted into loan.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Local Instrument Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the local instrument code which provides additional information about the type of payment. For wire transactions, this code determines additional required and permissible tags in sequence B of the Customer Transfer Plus message format. List of valid values are: ANSI  ANSI X12 format, COVS  Cover Payment Structured, GXML  General XML format, IXML  ISO 20022 XML format, NARR  Narrative Text, PROP  Proprietary Local Instrument Code, RMTS  Remittance Information Structured, RRMT  Related Remittance Information, S820  STP 820 format, SWIF  Remittance Information, UEDI  UN or EDIFACT format.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Location Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique location code. Location code is defined as the code which will represent the address of the property from zip code onwards like which city, country etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mantas Transaction Adjustment Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code of the type of adjustment being made by this transaction. List of valid values are: ADJ CORR  Adjustment or Correction Transaction, REV  Reversal Transaction, DISHON CHECK IN  Dishonored Check Transaction, DISHON CHECK OUT  Dishonored Check Transaction, STOP PMT  Stop Check Payment Transaction and CANCEL  Canceled or Canceling Transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mantas Transaction Asset Class Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the mantas transaction asset class code. Expected values are FUNDS  Transaction transfers funds, SECURITIES  Transaction transfers securities, COMMODITIES  Transaction transfers tangible good or asset that can be deposited and PROPERTY  Transaction transfers property.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mantas Transaction Channel Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the mantas code of the channel used to initiate this transaction. List of valid values are: ATM  Conducted via an automated teller machine, BRANCH TELLER  Conducted via a branch teller, DEBIT TERMINAL  Conducted via a debit terminal, ON LINE  Conducted via the internet, RETAIL OUTLET  Conducted via a retail outlet, MAIL  Mail, TELEPHONE  Conducted via a telephone, INTERNAL SYSTEM  Conducted via a system of the Firm, OTHER ANONYMOUS  Conducted via another anonymous channel, OTHER NON ANONYMOUS  Conducted via another non anonymous channel and MOBILE PDA  Conducted through mobile phone or PDA device.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mantas Transaction Product Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the mantas financial product code associated with the transaction. List of valid values are: AUTO BILL PAY  Automatic Bill Payment, DEBIT CARD  Debit Card, SVC  Stored Value Card, CASH EQ CASHIER CHECK  Cashiers Check, CASH EQ CERT CHECK  Certified Check, CASH EQ MONEY ORDER  Money Order, CASH EQ TRAVELERS CHECK  Travelers Check, CASH EQ OTHER  Other Cash Equivalent Product, CASH LETTER  Cash Letter, CHECK  Personal or Business Check, CHECK ACH  Check via Automated Clearing House, CREDIT CARD  Credit Card, CURRENCY  Currency, EFT ACH  Electronic Funds Transfer via Automated Clearing House, EFT TREASURY  Electronic Funds Transfer via Treasury, EFT FEDWIRE  Electronic Funds Transfer via Fedwire, EFT SWIFT  Electronic Funds Transfer via SWIFT, EFT OTHER  Electronic Funds Transfer via Other Mechanism, EST FO  Electronic Securities Transfer for Front Office, EST BO  Electronic Securities Transfer for Back Office, PAPER OTHER  Other Paper Products, PAYROLL DEDUCTION  Payroll Deduction and PHYS  Physical Delivery or Receipt of Securities.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mantas Transaction Purpose Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the mantas purpose code of this transaction. List of valid values are: DIST  Distribution Transaction, For example, IRA, DIV  Dividend Transaction, FEE IA  Investment Advisor Fee Transaction, FEE OTHER  Non Investment Advisor Fee Transaction, INT  Interest Transaction, TOA  Transfer Of Account Transaction and GENERAL  Transaction whose purpose does not align with other purpose codes.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Margin Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the margin amount. Margins are cushion required by the financial institution to allow the customer to trade in derivative instruments like Options and Futures. These are highly volatile products and the potential loss is high, hence only informed customers are allowed to trade in such products. Margin amount is also relevant in the case of OTC contracts, this is maintained with the counterparty of the transaction. Margin amount refers to the difference between the market value of a collateral and amount of the loan advanced against it.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Value",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount_Long",
                    "gcd": "Refers to the market value of the instrument as on the As of Date. Market value of the asset is the price that would be received to sell an asset in an transaction between market participants on the given day. It is often the quoted market price which is available as part of market data and used to determine the market value of the asset.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Market Value Effective Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the effective date for which the market value of this transaction was determined. An effective date is the date upon which something is considered to take effect. This may be different from the date upon which the event actually occurs or is recorded.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Merchant Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric_Long",
                    "gcd": "Refers to the merchant number.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Merchant Point Of Sale Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the identifier of the merchant point of sale through which this transaction was initiated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Mode Of Payment",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the mode of payment. The common modes of payment are Cash, Cheque, Debit card, Credit card, Electronic Fund Transfer etc. \nThe payment instruction is governed under negotiable instruments act, which is referred to under article 3 and 4 of Uniform Commercial Code. This does not apply to cash.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Next Settlement Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the next settlement is due.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Non Premium Transaction Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicating if the transaction is related to premium or not. List of values are Y meaning not a premium transaction and N meaning it is a premium transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notional Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the notional amount of the exposure or instrument. This will be the amount, post adjustment for any regulatory capital calculation purpose. If there are any adjustments to the accounting exposure amount due to netting, or any other regulatory capital related computations, the same will be updated. For futures and options corresponds to contract size multiplied by the number of contracts and for swaps and forwards corresponds to the contract amount. This is applicable to off balance sheet instruments such as swaps.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Notional Amount Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the ISO currency code of the notional amount. The value expected is a valid ISO 4217 currency code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Number Of Days To Process",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric_Long",
                    "gcd": "Refers to the number of days taken to process the transaction. This will represent the total number of days from when the transaction begins till its completed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Obligation Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to time specific obligation identifier. Time specific obligations are obligations which must be settled at a specific time within the day or have an expected intraday settlement deadline.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Offset Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the account number that is being offset. It Refers to the loan account number which this liability account is offsetting. There can be multiple savings account offsetting a loan, but a liability account would not offset more than one loan account. For hypothecated deposits, it Refers to the account number of the related loan that is used to net against the deposit.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Offset Accounting Rule",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the manner in which the cash or security involved in this transaction is held in the offset account, for example, on a cash basis, on margin, or as a short position.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Organization Unit Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the cost center to which the account belongs to. Organization Unit dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Original Transaction Reference Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the original transaction reference number which is being corrected or rebooked.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Originator To Beneficiary Instructions",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Medium",
                    "gcd": "Refers to the instructions that the transactions originator provides to be conveyed to the beneficiary upon receipt of this transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Over Limit Fees On Card",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the over limit fees paid for using a card beyond the credit limit. This is useful as it shows the bank has been unsuccessful in predicting the customers credit needs and should have offered an increase in the credit limit earlier than this event. This is useful in Marketing Triggers.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Over Limit Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to identify if the transaction has crossed the limit in terms of soft exposure.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Parent Transaction Reference Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Captures the parent transaction reference number. This is required to identify the corresponding debit or credit entry passed in another account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Partial Surrender Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the surrender transaction amount when the insurance policy is partially surrendered. The surrender value is the actual sum of money a policyholder will receive if he tries to access the cash value. This is also referred to as the surrender cash value or, in the case of annuities, annuity surrender value. The cash value and surrender value .",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Party Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier for the party. Party is defined as an entity or a person who takes part or is involved in an agreement, lawsuit, or transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Pass Through Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether the originator or beneficiary on this transaction is not the ultimate originator or beneficiary of the funds, for example, a wire transfer with instructions for further credit to a third party. List of values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment By Security Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates the transaction payment or settlement happened by security or any other form like cash. List of Values are: Y  security, N  other than security.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Instrument Comments",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Medium",
                    "gcd": "Refers to the Payment Instrument Comments. For monetary instruments, any additional comments associated with the monetary instrument associated with this transaction during processing.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Instrument Markings",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description",
                    "gcd": "Refers to the Payment Instrument markings. For monetary instruments, any markings found on the monetary instrument associated with this transaction, for example, the memo on a check.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Instrument Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the Payment Instrument number. For monetary instruments, the serial number of the monetary instrument associated with this transaction, for example, the check number on checks.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Instrument Routing Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the Payment Instrument routing code. For monetary instruments, the routing code from the MICR line of the monetary instrument associated with this transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Instrument Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "This is used to represent the unique number imprinted on the instrument type used for the payment.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Mechanism Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the Payment Mechanism Identifier of the transaction. For monetary instruments, the name of the specific instrument used in this transaction, for example, American Express Travelers Check.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Posted Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the payment was posted in the Financial Institution books.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Reason Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the payment reason for the transaction. Examples CCD Transfer of funds between business accounts or to consolidate funds from several accounts of the same business , CIE Credit entry initiated by an individual , usually through a bill payment service, used to pay some sort of obligation.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Payment Settlement System Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the Payment Settlement system Identifier. A payment and settlement system can be described as a system which consists of a particular group of institutions and a set of instruments and procedures, designed to ensure the circulation of money and speed up interbank and other settlements resulting from the various economic transactions either within a country or between countries.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Through Large Value System Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates the payments done through large value payment systems or not. List of Values are Y and N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Transaction Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique transaction id of the payment transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Payment Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code that indicates the nature of transaction like interest payment, fees payment, principal payment etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the unique identifier of the policy held by the customer. An insurance policy identifier or number is a unique identifier provided by insurance company which is used to identify particular contract between insurance company and policyholder wherein insurance company accepts to cover specific risks in return of premium payments by policyholder as per terms and agreements. The policy number can be referenced from policy document and needs to be quoted with all communication with insurance company.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Policy Rating Class Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This fields corresponds to rating classification code for a policy.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Policy Transaction Reference Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is unique alpha numeric reference code for the transactions occurring in the policy. This is usually the source system transaction identifier.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Policy Transaction Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This refers to unique code for the policy transaction type.\n .",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Posting Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to identify if the transaction is posted or not. List of Values are Y=yes, N=no.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Posting Time",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Timestamp",
                    "gcd": "Refers to the time on Posting Date at which this transaction was posted against the associated account in the books and records of the client and is applicable for monetary instruments and checks. Refers to the time along with time zone information.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Premium Offset Method",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the premium offset method. One option is called Premium OffsetPlan or POP. Under POP, thepremium due or part of it is paid with the built up values of the policy. Sample values are AUTOPREMPYMT is Automatic Premium Offset Payment option.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Premium Suspense Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the premium suspense amount. Used when additional money is submitted as part of a premium payment. The premium is applied and the balance is put into a suspense account. A suspense premium is one which is suspended because the insurer is unable to determine how this money should be applied.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Premium Suspense Reason Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the Premium Suspense Reason code, documents the reason if known behind the premium suspense amount recorded as Premium Suspense Amount. Sample values are BALDUE is Balance due the Company or allowance due the Insured. , LOANINT is Loan Interest.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Processing Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the transaction processing was completed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Producer Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is producer or agent identifier for a policy. Also know as agency or broker with whom the agent is employed.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Product Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code assigned to each of the Products offered by the Bank.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Product Long Description",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the long description of the product involved in the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Proprietary Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the proprietary code associated with this transaction. Proprietary code provides additional information about the type of payment. This code is usually available when the Local Instrument Code has a value equal to PROP.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Receipt Or Payment Indicator",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Refers to the indicator to identify if a transaction is a receipt to the bank or payment done by the bank. List of Values are R and P for Receipt and Payment Respectively. Use Inflow Outflow Flag.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Record Creation Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the record creation date. It has been added to all catalog entities to enable partitioning and archival.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Recurring Transaction Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Indicator",
                    "gcd": "Flag Indicates of whether this is a scheduled recurring transaction, for example, scheduled bill payment or mutual fund recurring purchase. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Reinsurance Claimed Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the reinsurance amount claimed for the said claim by insurance company. The reinsurance claim is governed by contract between reinsurer and insurer. Said reinsurance claim may or may not be approved. For amount actually received by insurer refer to reinsurance amount received.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Reinsurance Contract Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the unique identifier of the reinsurance contract associated with given direct insurance contract. Reinsurance is a process whereby one entity takes on all or part of the risk covered under a policy issued by an insurance company in consideration of a premium payment. When particular reinsurance contract is participation across multiple reinsurers, same should be updated in stage insurance participation details and not here. Users should update here only when reinsurance contracts are not participated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Reinsurance Received Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the reinsurance amount received for the said claim by insurance company. The reinsurance claim is governed by contract between reinsurer and insurer.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Report Class Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the reporting classification code for the report class. List of valid values are : ALTER  Alternative Investment, CAPIM  Capital Market, CASHE  Investment Cash and Short term investment, CHKNG  Checking or Interest Checking, CONVE  Convertible Bond, CDRLI  Credit Line, EQUTY  Equities, ESCRO  Escrow Account Information, FIXIN  Fixed Income, SAVNG  Savings or Time Deposit, OTHER  Others.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Reversal Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether the transaction event was as a result of a cancelled transaction. List of values are Y, N.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Run Identifier",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the run identifier for a set of Records participating in the particular Run with the Run Execution identifier. This is a combination of Run Main Identifier and Run Execution Identifier.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Service Charge Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique service charge code of the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Session Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the transaction session.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the amount to be settled for the FRA contract as a result of the differential between contract and market rates in local currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Settlement Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date at which a security transaction must be paid by the buyer and the securities delivered by the seller. Stocks and bonds have a settlement date of three business days subsequent to the trade date . Listed options and government securities must be settled by the next business day. This is different from contract settlement date. A contract can have multiple settlements in different settlement types.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Standard Transaction Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the standard transaction type code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Statement Suppression Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate whether the distribution of statements is suppressed for this account. Normally it is done to switch to paperless where customer will always have access to his records online. If the value is updated as Y means the distribution of statement is suppressed and if the value is updated as N means the distribution of statement is not suppressed for the account.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Sub Producer Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This stores sub producer identifier who helps or assists producer in acquiring a policy.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Teller Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the Teller who attended the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the unique Transfer Account Number.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Accounting Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the ISO currency code in which statements for the associated account are denominated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Adjustment Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code identifying the type of adjustment being made by this transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Amount",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the transaction amount expressed in the transaction currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Amount Account Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the transaction amount expressed in the account currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Amount Activity",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the monetary value in activity currency of the funds or securities transferred via this transaction. For issue cashiering, the value can be calculated from closing price of the security or its price at the time of this transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Amount In Natural Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the transaction amount in Natural currency. It Refers to the Negative value in case of reversals.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Amount In Reporting Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the Transaction Amount expressed in reporting currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Amount Inward Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to Monetary value of the funds transferred via transaction denominated in the incoming currency in which this transaction was conducted.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Amount in Accounting Currency",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "This is the Transaction Amount expressed in accounting currency.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Automated Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag indicates if the transaction was automated. List of Values are: Y Yes or N No.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Book Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "This is the date on which the transaction is booked.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Channel Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the financial institution specified channel through which this transaction was initiated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Channel Geographic Location",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the geographic location of the transaction channel. This could be an IP address in case of internet and co ordinates in case of physical location.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Channel Location Address",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description",
                    "gcd": "Refers to the location address of the transaction channel.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Transaction Channel Location Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the location identifier associated with the Financial Institution Transaction Channel used to initiate this transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Channel Location Identifier Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the type of the location identifier of the transaction channel. Example:\nA Casino or Card club\nB Depository institution\nC MSB\nD Securities or Futures\nZ Other.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Channel Location Name",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the location name associated with the Financial Institution Transaction Channel used to initiate this transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Channel Type",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the currency transaction report transaction delivery channel type e.g. Armored car, mail, shipment, night deposit etc.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to unique list of the transaction code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Cost",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Amount",
                    "gcd": "Refers to the charges like brokerage charges, brokerage commissions, taxes, and any other expenses and applicable charges.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Currency Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Currency",
                    "gcd": "Refers to the ISO code for the currency in which the transaction is done.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Customer Service Routed Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag Indicates if the transaction was routed by the customer service. List of values are Y=yes, N=no.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the transaction was recorded in the system. Transaction Date is the date on which a security or other financial instrument is traded. The transaction date represents the time at which ownership is transferred.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Description",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Medium",
                    "gcd": "Refers to the description relating to each of the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Entry System Logon Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the system logon used by the individual who entered the transaction. If this transaction is entered through an automated channel, this field contains the system logon associated with that channel.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Entry Terminal Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the identifier of the terminal used to enter this transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Group Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the identifier of the set of transactions of which this transaction is a part. For example this can be used to identify a pouch or deposit that included several monetary instruments, of which one is this transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction IP Address",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the IP address of the machine used to conduct the transaction.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Transaction Lifecycle Status Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the lifecycle status code of the transaction. Expected Values includes Open, Cancelled, Confirmed, Settled.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Location Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique location code from where the currency transaction took place. This will Refers to the address of the branch from where the currency transaction originates.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Mnemonic Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique transaction mnemonic code.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Online Account Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the identifier of the online account used in the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Online Account Name",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the name of the online account used to perform the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Origin Country Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the ISO country code where the transaction originated.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Phone Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Numeric_Long",
                    "gcd": "Refers to the phone number which was used to conduct the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Phone Operator Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the identifier of the phone operator who facilitated the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Posting Account Number",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Description_Short",
                    "gcd": "Refers to the transaction posting account number.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Posting Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which this transaction was posted against the associated account for monetary instruments and checks.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Process Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the transaction is processed.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Purpose Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the unique code of the purpose of this transaction. Transaction Purpose Dimension is the equivalent dimension table for this column.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Reason Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to code for CTR,currency transactions report, Transaction Business Reason e.g. Deposit, Payment, Gaming Instruments, Negotiable Instruments, Wagers etc. List of Values are:\nDP Deposits,, Only Cash in,\nPM Payments,\nFT Fund Transfers,\nNI Negotiable Instruments,\nCX Currency Exchange\nPA Prepaid Access\nGI Gaming Instruments\nBI Bills inserted into gaming devices, Only Cash in,\nWG Wagers\nWD Withdrawals,, Only Cash out,\nAC Advances, on Credit, including markers,, Only Cash out,\nTI Travel and complimentary expenses and gaming incentives, Only Cash out,\nTP Payment tournament, contest or other promotions, Only Cash out,\nOT Other.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Reason Description",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to Reason for Transaction. When the Business Reason Code has been given an OT Other, then the description of the same can be given here.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Reference Number",
                    "isPk": "YES",
                    "isNull": "NO",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to transaction reference number. Transactions are cash inflows or cash outflows that occurs for each account. Each transaction will be represented with a unique identifier which is called as transaction reference number.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Reversal Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to Date of the transaction which is a reversal entry that made to cancel out a specific entry. These reversal entries are the entries that can be passed as a result of a cancelled transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction User Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "Refers to the unique identifier of the user who is performing the transaction.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Transaction Value Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the date on which the transaction happened.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Underwriter Identifier",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric_Long",
                    "gcd": "This is the underwriter identifier for a policy. An insurance underwriter is a financial professional that evaluates the risks of insuring a particular person or asset and uses that information to set premium pricing for insurance policies.",
                    "isPII": "YES"
                },
                {
                    "logicalName": "Unrelated Party Code",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Code_Alphanumeric",
                    "gcd": "Refers to the code which indicates the basis on which it was determined that the transaction is to or from an unrelated party. List of valid values are: N  Name indicates unrelated party, A  Address indicates unrelated party, B  Name and address indicate unrelated party, J  Journal between unrelated accounts, JS  Journal between unrelated accounts managed by the same investment advisor and W  Wire between unrelated parties.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Unrelated Party Flag",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Flag",
                    "gcd": "Flag to indicate if a relationship is known to exist between internal accounts.",
                    "isPII": "NO"
                },
                {
                    "logicalName": "Value Date",
                    "isPk": "NO",
                    "isNull": "YES",
                    "ldd": "Date",
                    "gcd": "Refers to the value date of the contract. Value Date is a securities industry term describing the date on which a trade, bonds, equities, foreign exchange, commodities, etc., settles. That is, the actual day on which transfer of cash or assets is completed, or the settlement amount is calculated. \nIn case of FX swap instrument Refers to the settlement date for spot or near leg. Also considered as the date on which the contract becomes effective.",
                    "isPII": "NO"
                }
            ],
            "processInfo": [],
            "governance": [],
            "useCases": []
        }
    ]
}